[
  {
    "description": "### **Broker Relationship Manager, AVEO Channel**\n\n\n##### **Toronto, ON**\n\n\n##### **Salary Range:** **$160,000 \\- $200,000 /year** **(fully commission\\-based role)**\n\n\n##### **CMLS Financial, one of Canada’s largest Commercial lenders, is looking for a Broker Relationship Manager to join our growing team. The Broker Relationship Manager (BRM) is responsible for growing the residential mortgage business from a designated portfolio of Mortgage Brokers with nesto Group, specializing in Aveo (uninsured alternative residential) mortgages.**\n\n\n##### **The BRM manages a portfolio of brokers, providing exceptional service with a focus on underwriting activities, while also supporting business development, relationship management, and training initiatives to promote Aveo products. This role partners with other Regional Managers to support growth, deliver training, and ensure operational excellence.**\n\n\n##### **About the Role**\n\n\n##### **Business Development**\n\n\n* ##### **Promote growth of Aveo mortgages within a defined geographic territory.**\n* ##### **Manage existing broker relationships, ensuring high levels of prompt and attentive service.**\n* ##### **Prospect and attract new broker partners, including graduate opportunities for Prime partnership status.**\n* ##### **Deliver product and policy presentations and maintain regular follow\\-ups with brokers.**\n* ##### **Maintain knowledge of mortgage products, Aveo policies, market conditions, and competitor activity.**\n* ##### **Represent Aveo at industry meetings and events.**\n\n##### **Relationship Management**\n\n\n* ##### **Maintain regular contact with assigned brokers to encourage growth in referrals.**\n* ##### **Support brokers with product knowledge, pricing, and client\\-facing tools.**\n* ##### **Enhance broker efficiency by improving knowledge of products and processes, increasing look\\-to\\-book ratios, and reducing errors.**\n* ##### **Monitor broker performance and track improvements.**\n\n##### **Underwriting**\n\n\n* ##### **Communicate Aveo lending policies to brokers and ensure thorough knowledge of requirements.**\n* ##### **Review and verify credit documentation (income, down payment, etc.) while ensuring AML/ATF compliance.**\n* ##### **Approve or decline mortgage applications within delegated limits; escalate as necessary.**\n* ##### **Issue commitments, review appraisals, and escalate to credit management/investors when required.**\n* ##### **Identify and report suspicious loans (UTR/STR).**\n\n##### **Customer Service**\n\n\n* ##### **Ensure prompt turnaround times, accuracy, and professionalism in all broker interactions.**\n* Maintain confidentiality of all nesto Group and customer information.\n  \n\n\n **This role is for you, if you have:**\n* ##### **Extensive experience in residential mortgage underwriting.**\n* ##### **Strong knowledge of the mortgage broker industry.**\n* ##### **Expert knowledge of Aveo mortgage products, policies, and procedures.**\n* ##### **Proven interpersonal and communication skills to manage broker relationships and deliver difficult messages tactfully.**\n* ##### **Strong organizational skills with the ability to prioritize and maintain attention to detail.**\n* Knowledge of real estate market trends, competitor products, and innovations.\n  \n\n\n**Benefits and Perks**\n  \n\nSome of the benefits we offer at CMLS are:\n\n\n* Health and Wellness Spending Accounts\n* Health, Drug, Vision, and Dental benefits\n* Paid vacation, sick days, and personal days (in addition to all civil and statutory holidays)\n* RRSP Matching Program\n* Maternity / Parental Leave Top Up Program\n* Discounted gym memberships\n* Travel assistance and EAP\n* Business Casual dress code\n* Company social events \\+ sport teams\n\n\n**Who are we?**\n##### **Established in 1974, CMLS Financial is the leading provider of capital solutions for commercial property owners, developers and real estate investors. We have over 50 years of experience, 30,000 clients, $45 billion in assets under administration, and offices coast to coast. Some of Canada's most prominent banks, investment managers, insurance companies, and pension funds rely on CMLS Financial for a variety of critically important services. Building on our solid foundation of financial strength and experience, we continue to deliver unparalleled capital solutions for all our clients needs.**\n\n\n##### **You will love working here**\n\n\n##### **Employees tell us that they love that we strike the balance in creating an incredibly professional, yet dynamic and enjoyable corporate culture. We work in a fluid and fast\\-paced environment that is supportive of energetic and motivated individuals who pride themselves on being flexible and results\\-driven. Our employees are able to gain valuable industry exposure, lots of learning opportunities, and truly impact the business. We are committed to providing our people with a challenging and rewarding career because our employees are what set us apart and** **we know it****.**\n\n\n##### **Equal Opportunity Employer**\n\n\n##### **CMLS Financial is an equal opportunity employer committed to diversity and inclusion. We are pleased to consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veterans status, Aboriginal/Native American status or any other legally\\-protected factors. Disability\\-related accommodations are available on request for candidates taking part in all aspects of the selection process.**\n\n\n##### **We want to hear from you!**\n\n\n##### **If you are confident that you would be a strong asset to our team, submit both a cover letter and resume today! We thank all applicants for their time in applying, however we will only contact those selected for an interview.** **Consideration of applications will begin immediately and continue until the position is filled.**",
    "id": "in-26c056a62ae0e9a7",
    "currency": "CAD",
    "site": "indeed",
    "location": "Toronto, ON, CA",
    "company": "CMLS Financial",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=26c056a62ae0e9a7",
    "title": "Broker Relationship Manager, AVEO Channel",
    "date_posted": "2025-08-27",
    "job_type": "fulltime",
    "max_amount": 160000.0,
    "min_amount": 160000.0,
    "job_url_direct": "https://recruiting.ultipro.ca/CML5000CMLS/JobBoard/5e2cdd1f-904d-4ae7-97a3-39050c5774dc/OpportunityDetail?opportunityId=7d531ea1-a624-4efb-878d-83ea071c8e0b&postingId=c392ed6e-cba4-4563-a900-00b088d11a7b",
    "company_group": "CMLS Financial",
    "company_search_term": "CMLS Financial",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": [
      "fulltime"
    ],
    "location_city": "Toronto",
    "location_region": "ON",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:27.095246+00:00",
    "posted_days_ago": null,
    "dedupe_key": "972cf3700ac6e3d4ad85e1a1da6eec6d63b6b42c"
  },
  {
    "description": "#### **Team Lead, Commercial Servicing**\n\n\n##### **Vancouver, BC**\n\n\n##### **Salary Range:** **$68,000 \\- $80,000 /yr**\n\n  \n\n\n\nCMLS Financial, one of Canada’s largest Commercial lenders, is looking for a Team Lead, Commercial Servicing to join our growing team.\n\n\n\nThe Team Lead, Commercial Servicing is responsible for delivering senior\\-level expertise and leadership in post\\-funding servicing, with a focus on one or more key areas such as investor reporting and payments, document execution, insurance, loan security, borrower transactions, property taxes, and portfolio management.\n\n\n\nIn this role, you will lead by example: reviewing and auditing the work of others, identifying process gaps, and driving continuous improvement initiatives. You will play a pivotal role in supporting departmental planning in collaboration with the Service Management team, while also managing daily team operations through effective work allocation and oversight.\n\n\n\nAs a hands\\-on leader, you will provide clear guidance, mentorship, and performance management to your direct reports, taking ownership of quarterly and annual reviews, ensuring team’s KPIs, coaching conversations, and supporting individual career development. Your leadership will be critical in shaping a culture of accountability, collaboration, and excellence within the Commercial Servicing group.\n\n\n##### **About the Role**\n\n\n\nThe Team Lead, Commercial Servicing will be accountable for the day\\-to\\-day management and development of a team responsible for a variety of post\\-funding servicing functions. Core responsibilities include, but are not limited to, the following:\n\n\n\nPeople Leadership \\& Development\n\n\n* Lead the training, performance management, and professional development of direct reports, including the successful onboarding of new team members.\n* Provide consistent and constructive feedback, coaching, and mentorship to support technical knowledge transfer and personal growth.\n* Conduct quarterly performance check\\-ins and participate in the annual performance review process, addressing performance concerns in a timely and effective manner.\n* Foster a high\\-performing and collaborative team environment by promoting open communication, accountability, and cross\\-functional learning opportunities.\n\n\nTeam Operations \\& Workload Oversight\n\n\n* Collaborate with Servicing Management to monitor servicing queues and workloads, ensuring effective work allocation, task distribution, and resource coverage.\n* Manage day\\-to\\-day operations of the team’s servicing functions and ensure delivery meets established quality and efficiency standards.\n* Make recommendations on task rotation and workload rebalancing to optimize productivity and minimize risk.\n\n\nProcess Improvement \\& Quality Assurance\n\n\n* Conduct process verifications and quality reviews, including peer or spot checks, to maintain consistency and accuracy across servicing functions.\n* Analyze servicing errors or trends, identify root causes, and implement process improvements to mitigate recurring issues.\n* Proactively gather feedback from team members and relay suggestions to other teams to support broader procedural enhancements.\n* Contribute to policy and procedure updates, project initiatives, and internal action plans by offering insights and ensuring deliverables are completed within defined timelines.\n\n\nProject \\& Departmental Support\n\n\n* Assist the Servicing Management team in planning and coordinating departmental responsibilities and corporate projects.\n* Oversee the allocation of project\\-related tasks across the team, ensuring interdependencies, milestones, and deliverables are met; escalate risks or issues as necessary.\n\n\nStakeholder Relationship Management\n\n\n* Serve as a key escalation point for external clients, including borrowers, lenders, investors, brokers, insurers, and vendors, by managing complex inquiries with professionalism and urgency.\n* Collaborate cross\\-functionally with internal partners in Origination, Credit, Servicing, and Finance to resolve issues and confirm data for high\\-complexity loan transactions.\n\n\nData Integrity \\& Documentation\n\n\n* Assign and oversee routine data collection and reporting responsibilities to team members, ensuring accuracy and consistency across internal platforms.\n* Maintain data integrity in spreadsheets, standard reports, and internal databases through regular oversight and validation.\n* Oversee document management practices, including the creation, review, organization, and maintenance of electronic and physical records.\n* Collaborate with Servicing Management to standardize and enhance templates, reports, statements, and communications to align with service standards.\n\n  \n\n\n##### **This role is for you if you:**\n\n\n* Have a university degree in Business/Finance/ Real Estate/ Accounting/ Insurance, with a professional designation (such as CFA considered an asset).\n* Have a minimum of 3 years of experience as a Mortgage/Lending Specialist. Experience within the financial or lending services industry/ institution and real estate knowledge are considered assets.\n* Have experience managing a team of direct reports providing, teaching, coaching, and mentoring.\n* Are an advanced user of MS Office and Excel.\n* Have proficient communication, interpersonal and organizational skills.\n* Demonstrate interpersonal skills that promote mutually beneficial, respectful, and professional relationships.\n* Have excellent communication, presentation, problem solving, and organizational skills.\n* Have a high level of critical and logical thinking, analysis, and/or reasoning to identify underlying principles, reasons, or facts.\n* Are able to work well under pressure and meet set deadlines.\n* Have strong attention to detail in all areas of work.\n\n  \n\n\n**Benefits and Perks**\n\n\n\nSome of the benefits we offer at CMLS are:\n\n\n* Health and Wellness Spending Accounts\n* Health, Drug, Vision, and Dental benefits\n* Paid vacation, sick days, and personal days (in addition to all civil and statutory holidays)\n* RRSP Matching Program\n* Maternity / Parental Leave Top Up Program\n* Discounted gym memberships\n* Travel assistance and EAP\n* And more!\n\n  \n\n\n**Who are we?**\n\n\n\nEstablished in 1974, CMLS Financial is the leading provider of capital solutions for commercial property owners, developers and real estate investors. We have over 50 years of experience, 30,000 clients, $45 billion in assets under administration, and offices coast to coast. Some of Canada's most prominent banks, investment managers, insurance companies, and pension funds rely on CMLS Financial for a variety of critically important services. Building on our solid foundation of financial strength and experience, we continue to deliver unparalleled capital solutions for all our clients needs.\n\n\n**You will love working here**\n\n\n\nEmployees tell us that they love that we strike the balance in creating an incredibly professional, yet dynamic and enjoyable corporate culture. We work in a fluid and fast\\-paced environment that is supportive of energetic and motivated individuals who pride themselves on being flexible and results\\-driven. Business is booming and that means that our employees are able to gain valuable exposure, have lots of learning opportunities, and truly impact the business. We are committed to providing our people with a challenging and rewarding career because our employees are what set us apart and we know it.\n\n\n**Equal Opportunity Employer**\n\n\n\nCMLS Financial is an equal opportunity employer committed to diversity and inclusion. We are pleased to consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veterans status, Aboriginal/Native American status or any other legally\\-protected factors. Disability\\-related accommodations are available on request for candidates taking part in all aspects of the selection process.\n\n\n**We want to hear from you!**\n\n\n\nIf you are confident that you would be a strong asset to our team, submit both a cover letter and resume today! We thank all applicants for their time in applying, however we will only contact those selected for an interview.",
    "id": "in-8321363552873382",
    "currency": "CAD",
    "site": "indeed",
    "location": "Vancouver, BC, CA",
    "company": "CMLS Financial",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=8321363552873382",
    "title": "Team Lead, Commercial Servicing",
    "date_posted": "2025-07-28",
    "job_type": "fulltime",
    "max_amount": 68000.0,
    "min_amount": 68000.0,
    "job_url_direct": "https://recruiting.ultipro.ca/CML5000CMLS/JobBoard/5e2cdd1f-904d-4ae7-97a3-39050c5774dc/OpportunityDetail?opportunityId=aa044192-44b7-4cc6-9ebb-2673aed50df4&postingId=4fd4f55c-3c05-41de-bef3-68590621723c",
    "company_group": "CMLS Financial",
    "company_search_term": "CMLS Financial",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": [
      "fulltime"
    ],
    "location_city": "Vancouver",
    "location_region": "BC",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:27.102570+00:00",
    "posted_days_ago": null,
    "dedupe_key": "082ee1d90473e773f1a757d48f7cb91900173bd2"
  },
  {
    "description": "#### **Chef d’équipe, Services commerciaux**\n\n\n##### **Montreal, QC**\n\n\n##### **Fourchette salariale :** **$68,000 \\- $80,000 /yr**\n\n  \n\n\n\nCMLS Financial, l’un des plus grands prêteurs commerciaux au Canada, est à la recherche d’un(e) Chef d’équipe, Services commerciaux pour rejoindre notre équipe en pleine croissance.\n\n\n\nLe(la) Chef d’équipe, Services commerciaux est responsable de fournir une expertise de haut niveau et un leadership en matière de services après\\-financement, avec un accent particulier sur un ou plusieurs domaines clés tels que les rapports et paiements aux investisseurs, l’exécution de documents, les assurances, les sûretés de prêts, les transactions avec les emprunteurs, les taxes foncières et la gestion de portefeuille.\n\n\n\nDans ce rôle, vous mènerez par l’exemple : en révisant et en auditant le travail des autres, en identifiant les lacunes des processus et en menant des initiatives d’amélioration continue. Vous jouerez un rôle essentiel dans la planification du service, en collaboration avec l’équipe de gestion des services, tout en assurant la gestion quotidienne des opérations de l’équipe grâce à une allocation efficace du travail et une supervision rigoureuse.\n\n\n\nEn tant que leader actif(ve), vous fournirez des orientations claires, du mentorat et une gestion de la performance à vos collaborateurs directs, en prenant en charge les évaluations trimestrielles et annuelles, en assurant le suivi des indicateurs clés de performance de l’équipe, en menant des discussions de coaching et en soutenant le développement de carrière individuel. Votre leadership sera essentiel pour façonner une culture de responsabilité, de collaboration et d’excellence au sein du groupe des services commerciaux.\n\n\n**À propos du poste**  \n\nLe(la) Chef d’équipe, Services commerciaux sera responsable de la gestion quotidienne et du développement d’une équipe chargée de diverses fonctions de service après\\-financement. Les principales responsabilités comprennent, sans s’y limiter :\n\n\n\nLeadership \\& Développement\n\n\n* Diriger la formation, la gestion de la performance et le développement professionnel des membres de l’équipe, y compris l’intégration réussie des nouveaux employés.\n* Fournir des commentaires constants et constructifs, du coaching et du mentorat pour soutenir le transfert de connaissances techniques et la croissance personnelle.\n* Mener les entretiens trimestriels de performance et participer au processus d’évaluation annuel, en traitant les préoccupations liées à la performance de manière efficace.\n* Favoriser un environnement d’équipe collaboratif et performant en encourageant la communication ouverte, la responsabilisation et l’apprentissage transversal.\n\n\nOpérations \\& Répartition du travail\n\n\n* Collaborer avec la direction des services pour surveiller les files de service et les charges de travail, assurant une répartition efficace des tâches et des ressources.\n* Gérer les opérations quotidiennes des fonctions de service de l’équipe et veiller à ce que la qualité et l’efficacité soient respectées.\n* Recommander des rotations de tâches et des rééquilibrages de charge de travail pour optimiser la productivité et réduire les risques.\n\n\nAmélioration des processus \\& Contrôle de qualité\n\n\n* Réaliser des vérifications de processus et des contrôles de qualité, incluant des examens ponctuels, pour assurer la cohérence et la précision.\n* Analyser les erreurs ou tendances, identifier les causes profondes et mettre en œuvre des améliorations pour prévenir les problèmes récurrents.\n* Recueillir activement les commentaires de l’équipe et proposer des suggestions aux autres départements pour soutenir des améliorations globales.\n* Contribuer à la mise à jour des politiques et procédures, aux projets et plans d’action internes en fournissant des perspectives et en respectant les échéanciers.\n\n\nProjets \\& Soutien départemental\n\n\n* Aider l’équipe de gestion des services dans la planification des responsabilités du service et des projets de l’entreprise.\n* Superviser l’attribution des tâches liées aux projets, veiller à ce que les interdépendances et les échéances soient respectées, et faire remonter les risques au besoin.\n\n\nRelations avec les parties prenantes\n\n\n* Agir comme point d’escalade clé pour les clients externes (emprunteurs, prêteurs, investisseurs, courtiers, assureurs et fournisseurs), en gérant les demandes complexes avec professionnalisme et réactivité.\n* Collaborer avec les équipes internes (Origination, Crédit, Services, Finances) pour résoudre les problèmes et valider les données des transactions de prêts complexes.\n\n\nIntégrité des données \\& Documentation\n\n\n* Assigner et superviser les tâches de collecte de données et de production de rapports, en assurant leur exactitude et leur cohérence.\n* Maintenir l’intégrité des données dans les feuilles de calcul, rapports standards et bases de données internes grâce à une surveillance régulière.\n* Superviser la gestion documentaire, y compris la création, la révision, l’organisation et la conservation des dossiers électroniques et physiques.\n* Collaborer avec la direction des services pour standardiser et améliorer les modèles, rapports, relevés et communications conformément aux normes de service.\n\n\n**Ce poste est pour vous si vous :**\n\n\n* Détenez un diplôme universitaire en administration des affaires, finance, immobilier, comptabilité ou assurance. Un titre professionnel (comme le CFA) est un atout.\n* Possédez un minimum de 3 ans d’expérience comme spécialiste en prêts hypothécaires/crédit. Une expérience dans le secteur financier ou hypothécaire, ainsi qu'une bonne connaissance de l’immobilier, sont des atouts.\n* Avez déjà dirigé une équipe directe, avec expérience en enseignement, encadrement et mentorat.\n* Maîtrisez MS Office, notamment Excel à un niveau avancé.\n* Démontez de solides compétences en communication, relations interpersonnelles et organisation.\n* Êtes reconnu(e) pour votre capacité à bâtir des relations professionnelles mutuellement bénéfiques et respectueuses.\n* Excellez en communication, présentation, résolution de problèmes et organisation.\n* Faites preuve de pensée critique, logique et analytique pour identifier les principes et faits sous\\-jacents.\n* Travaillez bien sous pression et respectez les délais fixés.\n* Avez une grande attention aux détails dans tous les aspects de votre travail.\n\n\n**Qui sommes\\-nous ?**  \n\nFondée en 1974, CMLS Financial est le principal fournisseur de solutions de financement pour les propriétaires, promoteurs et investisseurs immobiliers commerciaux. Avec plus de 50 ans d’expérience, 30 000 clients, 45 milliards $ d’actifs sous administration et des bureaux d’un océan à l’autre, nous servons les plus grandes banques, gestionnaires d’actifs, compagnies d’assurance et fonds de pension au Canada.  \n\nForts de cette base solide, nous continuons à offrir des solutions de financement inégalées à nos clients.\n\n\n**Vous aimerez travailler ici**  \n\nNos employés nous disent qu’ils aiment la manière dont nous équilibrons professionnalisme et ambiance de travail agréable. Nous évoluons dans un environnement dynamique, rapide et stimulant, qui soutient les personnes motivées et orientées vers les résultats. Notre croissance permet à nos employés d'acquérir une expérience précieuse, d’apprendre constamment et d’avoir un réel impact sur l’entreprise. Nous nous engageons à offrir des carrières enrichissantes, car nos employés sont ce qui nous distingue \\- et nous le savons.\n\n\n**Employeur garantissant l’égalité d’accès à l’emploi**  \n\nCMLS Financial est un employeur garantissant l’égalité des chances, engagé envers la diversité et l’inclusion. Nous accueillons avec plaisir toutes les candidatures qualifiées, sans égard à la race, couleur, religion, sexe, orientation sexuelle, identité de genre, origine nationale, âge, handicap, statut de vétéran, statut autochtone ou tout autre facteur protégé par la loi. Des mesures d’adaptation sont offertes sur demande pour les candidats participant au processus de sélection.\n\n\n**Nous voulons vous entendre !**  \n\nSi vous êtes convaincu(e) que vous pourriez être un atout pour notre équipe, soumettez dès aujourd’hui votre lettre de motivation et votre CV. Nous remercions tous les candidats pour leur intérêt, mais nous ne contacterons que ceux retenus pour une entrevue.\n\n\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n#### **Team Lead, Commercial Servicing**\n\n\n##### **Montreal, QC**\n\n\n##### **Salary Range:** **$68,000 \\- $80,000 /yr**\n\n  \n\n\n\nCMLS Financial, one of Canada’s largest Commercial lenders, is looking for a Team Lead, Commercial Servicing to join our growing team.\n\n\n\nThe Team Lead, Commercial Servicing is responsible for delivering senior\\-level expertise and leadership in post\\-funding servicing, with a focus on one or more key areas such as investor reporting and payments, document execution, insurance, loan security, borrower transactions, property taxes, and portfolio management.\n\n\n\nIn this role, you will lead by example: reviewing and auditing the work of others, identifying process gaps, and driving continuous improvement initiatives. You will play a pivotal role in supporting departmental planning in collaboration with the Service Management team, while also managing daily team operations through effective work allocation and oversight.\n\n\n\nAs a hands\\-on leader, you will provide clear guidance, mentorship, and performance management to your direct reports, taking ownership of quarterly and annual reviews, ensuring team’s KPIs, coaching conversations, and supporting individual career development. Your leadership will be critical in shaping a culture of accountability, collaboration, and excellence within the Commercial Servicing group.\n\n\n##### **About the Role**\n\n\n\nThe Team Lead, Commercial Servicing will be accountable for the day\\-to\\-day management and development of a team responsible for a variety of post\\-funding servicing functions. Core responsibilities include, but are not limited to, the following:\n\n\n\nPeople Leadership \\& Development\n\n\n* Lead the training, performance management, and professional development of direct reports, including the successful onboarding of new team members.\n* Provide consistent and constructive feedback, coaching, and mentorship to support technical knowledge transfer and personal growth.\n* Conduct quarterly performance check\\-ins and participate in the annual performance review process, addressing performance concerns in a timely and effective manner.\n* Foster a high\\-performing and collaborative team environment by promoting open communication, accountability, and cross\\-functional learning opportunities.\n\n\nTeam Operations \\& Workload Oversight\n\n\n* Collaborate with Servicing Management to monitor servicing queues and workloads, ensuring effective work allocation, task distribution, and resource coverage.\n* Manage day\\-to\\-day operations of the team’s servicing functions and ensure delivery meets established quality and efficiency standards.\n* Make recommendations on task rotation and workload rebalancing to optimize productivity and minimize risk.\n\n\nProcess Improvement \\& Quality Assurance\n\n\n* Conduct process verifications and quality reviews, including peer or spot checks, to maintain consistency and accuracy across servicing functions.\n* Analyze servicing errors or trends, identify root causes, and implement process improvements to mitigate recurring issues.\n* Proactively gather feedback from team members and relay suggestions to other teams to support broader procedural enhancements.\n* Contribute to policy and procedure updates, project initiatives, and internal action plans by offering insights and ensuring deliverables are completed within defined timelines.\n\n\nProject \\& Departmental Support\n\n\n* Assist the Servicing Management team in planning and coordinating departmental responsibilities and corporate projects.\n* Oversee the allocation of project\\-related tasks across the team, ensuring interdependencies, milestones, and deliverables are met; escalate risks or issues as necessary.\n\n\nStakeholder Relationship Management\n\n\n* Serve as a key escalation point for external clients, including borrowers, lenders, investors, brokers, insurers, and vendors, by managing complex inquiries with professionalism and urgency.\n* Collaborate cross\\-functionally with internal partners in Origination, Credit, Servicing, and Finance to resolve issues and confirm data for high\\-complexity loan transactions.\n\n\nData Integrity \\& Documentation\n\n\n* Assign and oversee routine data collection and reporting responsibilities to team members, ensuring accuracy and consistency across internal platforms.\n* Maintain data integrity in spreadsheets, standard reports, and internal databases through regular oversight and validation.\n* Oversee document management practices, including the creation, review, organization, and maintenance of electronic and physical records.\n* Collaborate with Servicing Management to standardize and enhance templates, reports, statements, and communications to align with service standards.\n\n ##### **This role is for you if you:**\n\n\n* Have a university degree in Business/Finance/ Real Estate/ Accounting/ Insurance, with a professional designation (such as CFA considered an asset).\n* Have a minimum of 3 years of experience as a Mortgage/Lending Specialist. Experience within the financial or lending services industry/ institution and real estate knowledge are considered assets.\n* Have experience managing a team of direct reports providing, teaching, coaching, and mentoring.\n* Are an advanced user of MS Office and Excel.\n* Have proficient communication, interpersonal and organizational skills.\n* Demonstrate interpersonal skills that promote mutually beneficial, respectful, and professional relationships.\n* Have excellent communication, presentation, problem solving, and organizational skills.\n* Have a high level of critical and logical thinking, analysis, and/or reasoning to identify underlying principles, reasons, or facts.\n* Are able to work well under pressure and meet set deadlines.\n* Have strong attention to detail in all areas of work.\n\n  \n\n\n**Benefits and Perks**\n\n\n\nSome of the benefits we offer at CMLS are:\n\n\n* Health and Wellness Spending Accounts\n* Health, Drug, Vision, and Dental benefits\n* Paid vacation, sick days, and personal days (in addition to all civil and statutory holidays)\n* RRSP Matching Program\n* Maternity / Parental Leave Top Up Program\n* Discounted gym memberships\n* Travel assistance and EAP\n* Business Casual dress code\n* And more!\n\n  \n\n\n**Who are we?**\n\n\n\nEstablished in 1974, CMLS Financial is the leading provider of capital solutions for commercial property owners, developers and real estate investors. We have over 50 years of experience, 30,000 clients, $45 billion in assets under administration, and offices coast to coast. Some of Canada's most prominent banks, investment managers, insurance companies, and pension funds rely on CMLS Financial for a variety of critically important services. Building on our solid foundation of financial strength and experience, we continue to deliver unparalleled capital solutions for all our clients needs.\n\n\n**You will love working here**\n\n\n\nEmployees tell us that they love that we strike the balance in creating an incredibly professional, yet dynamic and enjoyable corporate culture. We work in a fluid and fast\\-paced environment that is supportive of energetic and motivated individuals who pride themselves on being flexible and results\\-driven. Business is booming and that means that our employees are able to gain valuable exposure, have lots of learning opportunities, and truly impact the business. We are committed to providing our people with a challenging and rewarding career because our employees are what set us apart and we know it.\n\n\n**Equal Opportunity Employer**\n\n\n\nCMLS Financial is an equal opportunity employer committed to diversity and inclusion. We are pleased to consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veterans status, Aboriginal/Native American status or any other legally\\-protected factors. Disability\\-related accommodations are available on request for candidates taking part in all aspects of the selection process.\n\n\n**We want to hear from you!**\n\n\n\nIf you are confident that you would be a strong asset to our team, submit both a cover letter and resume today! We thank all applicants for their time in applying, however we will only contact those selected for an interview.",
    "id": "in-ae807f13c754b23e",
    "currency": "CAD",
    "site": "indeed",
    "location": "Montréal, QC, CA",
    "company": "CMLS Financial",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=ae807f13c754b23e",
    "title": "Chef d’équipe, Services commerciaux / Team Lead, Commercial Servicing",
    "date_posted": "2025-07-28",
    "job_type": "fulltime",
    "max_amount": 68000.0,
    "min_amount": 68000.0,
    "job_url_direct": "https://recruiting.ultipro.ca/CML5000CMLS/JobBoard/5e2cdd1f-904d-4ae7-97a3-39050c5774dc/OpportunityDetail?opportunityId=b5d8bc95-90cd-42a1-9588-fd8993be1731&postingId=c2cfd9cd-50d4-4f0b-a56b-31826309dbbc",
    "company_group": "CMLS Financial",
    "company_search_term": "CMLS Financial",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": [
      "fulltime"
    ],
    "location_city": "Montréal",
    "location_region": "QC",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:27.100181+00:00",
    "posted_days_ago": null,
    "dedupe_key": "b3eb448f162a0f97ad44c3d6238e3a3ec825b904"
  },
  {
    "description": "### **Analyst, Commercial Lending**\n\n\n**Vancouver, BC**\n\n\n**Salary Range:** $55,000 \\- $70,000/yr\n\n  \n\n\n\nCMLS Financial is looking for an Analyst, Commercial Lending to join our growing team. You will be responsible for supporting our conventional lending program and underwriting teams, including the preparation of various reporting, reviewing and summarizing new commercial lending opportunities, and assisting in the preparation of underwriting presentations.\n\n\n**About the Role**\n\n\n\nIn this role, you will provide timely and proactive support by:\n\n\n* Analyzing and interpreting financial data and credit information on real estate assets and borrower’s, including underwriting property cash flow analysis, valuing real estate assets, reviewing financial statements and assessing credit risk\n* Maintaining ongoing interaction with both internal and external stakeholders as needed to ensure timelines are met and service levels are maintained\n* Working as part of a team in the preparation and review of commercial lending opportunities, including being able to efficiently summarize and assess key deal attributes\n* Staying current with market information and commercial mortgage market trends\n* Performing other duties in keeping with the purpose and accountabilities of the job, such as preparing reports, assisting with compliance\\-related tasks and completing department projects as assigned\n\n\n**This role is for you if:**\n\n\n* You have approximately 1 year (or more) of experience working in the Commercial Real Estate Risk industry (preferred but not required)\n* You have excellent communication skills, both written and verbal, and are able to work well independently as well as within a team environment\n* You have experience creating and delivering business presentations and strong technical writing skills\n* You are very results\\-driven and possess strong organizational skills with a high attention to detail\n* You take ownership of your work and demonstrate a high degree of accountability and commitment at all times\n* You have completed an undergraduate degree in one of the following concentrations: finance, economics, urban land development, accounting or business administration\n* You are an intermediate/advanced level user of Microsoft Office (Excel, Word, PowerPoint, SharePoint)\n* You have a passion for real estate combined with an understanding of financial and statement analysis\n\n\n**Benefits and Perks**\n\n\n\nSome of the benefits we offer at CMLS are:\n\n\n* Health and Wellness Spending Accounts\n* Health, Drug, Vision, and Dental benefits\n* Paid vacation, sick days, and personal days (in addition to all civil and statutory holidays)\n* RRSP Matching Program\n* Maternity / Parental Leave Top Up Program\n* Discounted gym memberships\n* Travel assistance and EAP\n* Business Casual dress code\n* And more!\n\n##### **Who are we?**\n\n\n\nEstablished in 1974, CMLS Financial is the leading provider of capital solutions for commercial property owners, developers and real estate investors. We have over 50 years of experience, 30,000 clients, $45 billion in assets under administration, and offices coast to coast. Some of Canada's most prominent banks, investment managers, insurance companies, and pension funds rely on CMLS Financial for a variety of critically important mortgage services. What sets us apart is our customer forward approach. Building on our solid foundation of financial strength and experience, we continue to deliver unparalleled capital solutions for all our clients needs.\n\n\n**You will love working here**\n\n\n\nEmployees tell us that they love that we strike the balance in creating an incredibly professional, yet dynamic and enjoyable corporate culture. We work in a fluid and fast\\-paced environment that is supportive of energetic and motivated individuals who pride themselves on being flexible and results\\-driven. Business is booming and that means that our employees are able to gain valuable exposure, have lots of learning opportunities, and truly impact the business. We are committed to providing our people with a challenging and rewarding career because our employees are what set us apart and **we know it**.\n\n\n**Equal Opportunity Employer**\n\n\n\nCMLS Financial is an equal opportunity employer committed to diversity and inclusion. We are pleased to consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veterans status, Aboriginal/Native American status or any other legally\\-protected factors. Disability\\-related accommodations are available on request for candidates taking part in all aspects of the selection process.\n\n\n**We want to hear from you!**\n\n\n\nIf you are confident that you would be a strong asset to our team, submit both a cover letter and resume today. Be sure to tell us why you believe yourself to be a perfect fit! We thank all applicants for their time in applying, however we will only contact those selected for an interview. Consideration of applications will begin immediately and continue until the position is filled.",
    "id": "in-f17eec87aa636228",
    "currency": "CAD",
    "site": "indeed",
    "location": "Vancouver, BC, CA",
    "company": "CMLS Financial",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=f17eec87aa636228",
    "title": "Analyst, Commercial Lending",
    "date_posted": "2025-07-09",
    "job_type": "fulltime",
    "max_amount": 55000.0,
    "min_amount": 55000.0,
    "job_url_direct": "https://recruiting.ultipro.ca/CML5000CMLS/JobBoard/5e2cdd1f-904d-4ae7-97a3-39050c5774dc/OpportunityDetail?opportunityId=3dff07e5-5653-464e-a6e9-cfe6208d4bae&postingId=22c342bc-571b-4041-aca2-4b1b5151e54c",
    "company_group": "CMLS Financial",
    "company_search_term": "CMLS Financial",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": [
      "fulltime"
    ],
    "location_city": "Vancouver",
    "location_region": "BC",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:27.104177+00:00",
    "posted_days_ago": null,
    "dedupe_key": "719a5a9135a91ccf89d31891874f65be4ab3f2c0"
  },
  {
    "description": "**Administrator, Commercial Mortgage Operations**\n\n**Vancouver, BC**\n\n\n**Salary Range:** $50,000 \\- $70,000/yr\n\n  \n\n\n\nCMLS Financial, a leading commercial lender in Canada, is dedicated to expanding our award\\-winning Operations team. If you're looking for an entry point into the financial services industry, we have the flexibility to match your unique skills and strengths to the team's evolving needs. Join our high\\-performance group of specialists, account managers, and analysts specializing in borrower relations, payments, property tax, insurance, post\\-funding account management, and securitizations. You will be supported in your training and development journey as we are committed to nurturing your career growth.\n\n  \n\n\n**About the role:**\n\n\n\nAs a Commercial Mortgage Operations Administrator, you will play a pivotal role in managing the full life cycle of a mortgage portfolio. Your responsibilities encompass overseeing end\\-to\\-end Commercial Servicing post\\-funding administration responsibilities, which can include a variation of the following:\n\n\n* Work closely with borrower and other external clients to secure requisite documentation for compliance against their loan agreement, including collecting, verifying, and tracking financial and property data, property tax payments, insurance renewals, and loan security documents.\n* Facilitate the funding of mortgages originated through our third\\-party clients and aiding in the administration of construction advances\n* Accurately record post\\-funding transactions in the commercial loans management system, ensuring security \\& borrower details, payment terms, holdbacks, undertakings, and other relevant information are properly documented and cross referenced with source materials\n* Manage and execute follow\\-up tasks associated with the mortgage life\\-cycle process\n* Calculate interest adjustments, prepayment penalties, monthly tax components or interest accruals\n* Oversee monthly remittances, reconcile trust accounts and manage both automated and manual reporting for internal and external clients\n\n  \n\n\n**Your duties will also entail:**\n\n\n* Ensuring correspondence to borrowers and lenders adheres to company policies.\n* Accurate processing of post\\-closing lending cycle transactions according to team function requirements.\n* Developing a proficiency in other team functions to serve as a function floater, such as Borrower Relations, Collections \\& Investor Relations, and Collateral Management.\n* Implementing controls to safeguard the mortgage loan system's integrity and information accuracy.\n* Conducting peer checks within the team.\n* Attending team and department trainings and meetings, providing recommendations for enhanced practices.\n* Effective document management, including physical and electronic file organization related to client files and databases.\n* Managing client and customer relations, both internal and external, to facilitate information requests.\n* Responding to routine data collection requests, inputting data into spreadsheets, standard reports, and internal systems\n\n  \n\n\n**This role is for you if you are:**\n\n\n* Results\\-driven with strong organizational skills and meticulous attention to detail.\n* Proficient in analytical and numerical skills.\n* Intermediate to advanced Microsoft Office user.\n* Demonstrates professionalism, judgment, and integrity.\n* Passion for real estate lending business.\n* Self\\-motivated, process\\-oriented, and possesses strong administration and operation skills.\n* Ownership and accountability for work, ability to meet tight deadlines, and handle sensitive or confidential information with discretion.\n* Excellent written and verbal communication skills.\n* Undergraduate degree or nearing completion in Real Estate, Business Administration, Math, Accounting, Insurance, or Economics.\n* Experience in the banking, credit union, or financial services industry is an asset\n\n  \n\n\n**Benefits and Perks**\nSome of the benefits we offer at CMLS are:  \n\n\n\n* Health and Wellness Spending Accounts\n* Health, Drug, Vision, and Dental benefits\n* Paid vacation, sick days, and personal days (in addition to all civil and statutory holidays)\n* RRSP Matching Program\n* Maternity / Parental Leave Top Up Program\n* Discounted gym memberships\n* Travel assistance and EAP\n* Company social events \\+ sport teams\n* Hybrid work arrangements and telecommuting opportunities\n* And more!\n  \n\n\n\n\n**Who are we?**\n\n\n\nEstablished in 1974, CMLS Financial is the leading provider of capital solutions for commercial property owners, developers and real estate investors. We have over 50 years of experience, 30,000 clients, $45 billion in assets under administration, and offices coast to coast. Some of Canada's most prominent banks, investment managers, insurance companies, and pension funds rely on CMLS Financial for a variety of critically important services. Building on our solid foundation of financial strength and experience, we continue to deliver unparalleled capital solutions for all our clients needs.\n\n  \n\n\n**You will love working here**  \n\nEmployees tell us that they love that we strike the balance in creating an incredibly professional, yet dynamic and enjoyable corporate culture. We work in a fluid and fast\\-paced environment that is supportive of energetic and motivated individuals who pride themselves on being flexible and results\\-driven. Business is booming and that means that our employees are able to gain valuable exposure, have lots of learning opportunities, and truly impact the business. We are committed to providing our people with a challenging and rewarding career because our employees are what set us apart and **we know it**.\n\n  \n\n\n**Equal Opportunity Employer**  \n\nCMLS Financial is an equal opportunity employer committed to diversity and inclusion. We are pleased to consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veterans status, Aboriginal/Native American status or any other legally\\-protected factors. Disability\\-related accommodations are available on request for candidates taking part in all aspects of the selection process.\n\n  \n\n\n**We want to hear from you!**  \n\nIf you are confident that you would be a strong asset to our team, submit both a cover letter and resume today! We thank all applicants for their time in applying, however we will only contact those selected for an interview.",
    "id": "in-e353ecfb586c21c2",
    "currency": "CAD",
    "site": "indeed",
    "location": "Vancouver, BC, CA",
    "company": "CMLS Financial",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=e353ecfb586c21c2",
    "title": "Commercial Mortgage Administrator, Mortgage Operations",
    "date_posted": "2025-06-18",
    "job_type": "fulltime",
    "max_amount": 50000.0,
    "min_amount": 50000.0,
    "job_url_direct": "https://recruiting.ultipro.ca/CML5000CMLS/JobBoard/5e2cdd1f-904d-4ae7-97a3-39050c5774dc/OpportunityDetail?opportunityId=6f1375cc-55b5-40f2-b786-8557d3307a3a&postingId=57f314df-4ad7-46fa-8ef8-38e9ca622aed",
    "company_group": "CMLS Financial",
    "company_search_term": "CMLS Financial",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": "hybrid",
    "employment_types": [
      "fulltime"
    ],
    "location_city": "Vancouver",
    "location_region": "BC",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:27.105622+00:00",
    "posted_days_ago": null,
    "dedupe_key": "0675e9cb1b771d5bc01af2d605ec174a42f44d2c"
  },
  {
    "description": "### **Analyst, Investor Services**\n\n\n#### **Vancouver, BC or Calgary, AB**\n\n\n**Salary Range:** **$45,000 \\- $50,000/yr**\n\n  \n\n\n\nCMLS Financial, one of Canada’s largest Commercial lenders, is looking for an Analyst, Investor Services to join our growing team. The Analyst, Investor Services is responsible for managing reputational risk by ensuring that the reports provided to our Investors are accurate and timely, therefore maintaining our positive relationship with them. This individual works closely with the Investor team and business stakeholders to proactively identify issues within our servicing portfolio so that they can be resolved without impacting internal and external stakeholders. Our successful candidate will have detailed industry and securitization knowledge and previous work experience with the NHA Mortgage\\-backed Securities program.\n\n#### \n\n\n#### **About the Role**\n\n\n* Prepare monthly reconciliations in accordance with internal standards and procedures, ensuring balances and activities reported are accurate, timely and within the investor guidelines\n* Complete remittance reports to the investor in accordance with investor guidelines and contractual agreements\n* Prepare remittance transfers to investors daily or as required\n* Work with the investor and / or custodian in meeting existing reporting requirements as well as any change requests, answer questions and address concerns as required\n* Pool mortgages for sale to investors as mortgage\\-backed securities.\n* Prepare and submit all government required forms and documents\n* Balance all sales and liquidations daily\n* Complete investor set up on servicing\\-based system to ensure accuracy\n* Help to identify gaps in process and work within the team to improve efficiencies\n* Analyze, research, and resolve errors and reporting differences as communicated through reports, email transmissions or verbal inquiries\n* Support both internal and external audit requirements\n* Comply with all internal standards and guidelines as well as all federally and provincially regulated policies and laws as related to Investor Servicing, Investor Reporting, Securitization, NHA, CMB, MBS, and Privacy laws\n* Support system testing\n\n  \n\n\n#### **This role is for you if you have:**\n\n\n* Have a bachelor’s degree in Accounting, Finance, or related work experience\n* 1\\-3 years experience in securitization through MBS or ABS\n* Knowledge of mortgage servicing or related work experience\n* Experience in securitization and use of mHub is an asset\n* Experience in securitization through MBS or ABS is an asset\n* Highly proficient in Excel / Access\n* Excellent problem\\-solving skills and mathematical aptitude\n* Strong oral and written communication skills\n* Strong organizational and time management skills and the ability to manage multiple priorities while meeting deadlines\n* Demonstrate professionalism, judgment, and integrity in daily operations\n* Have proactive approach with the ability to take initiative and work independently\n* Have high attention to detail\n\n  \n\n\n#### **Benefits and Perks**\n\n\n\nSome of the benefits we offer at CMLS are:\n\n\n* Health and Wellness Spending Accounts\n* Health, Drug, Vision, and Dental benefits\n* Paid vacation and floater days (in addition to all civil and statutory holidays)\n* RRSP Matching Program\n* Maternity / Parental Leave Top Up Program\n* Discounted gym memberships\n* Travel assistance and EAP\n* Business Casual dress code\n* Company social events \\+ sport teams\n* Hybrid work arrangements and telecommuting opportunities\n* And more!\n\n  \n\n\n**Who are we?**\n---------------\n\n\n\nEstablished in 1974, CMLS Financial is the leading provider of capital solutions for commercial property owners, developers and real estate investors. We have over 50 years of experience, 30,000 clients, $45 billion in assets under administration, and offices coast to coast. Some of Canada's most prominent banks, investment managers, insurance companies, and pension funds rely on CMLS Financial for a variety of critically important mortgage services. What sets us apart is our customer forward approach. Building on our solid foundation of financial strength and experience, we continue to deliver unparalleled capital solutions for all our clients needs.\n\n\n**You will love working here**\n\n\n\nEmployees tell us that they love that we strike the balance in creating an incredibly professional, yet dynamic and enjoyable corporate culture. We work in a fluid and fast\\-paced environment that is supportive of energetic and motivated individuals who pride themselves on being flexible and results\\-driven. Our employees are able to gain valuable industry exposure, lots of learning opportunities, and truly impact the business. We are committed to providing our people with a challenging and rewarding career because our employees are what set us apart and **we know it**.\n\n\n**Equal Opportunity Employer**\n\n\n\nCMLS Financial is an equal opportunity employer committed to diversity and inclusion. We are pleased to consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veterans status, Aboriginal/Native American status or any other legally\\-protected factors. Disability\\-related accommodations are available on request for candidates taking part in all aspects of the selection process.\n\n\n**We want to hear from you!**\n\n\n\nIf you are confident that you would be a strong asset to our team, submit both a cover letter and resume today! We thank all applicants for their time in applying, however we will only contact those selected for an interview. **Consideration of applications will begin immediately and continue until the position is filled.**",
    "id": "in-2ebafc61baefa862",
    "currency": "CAD",
    "site": "indeed",
    "location": "Vancouver, BC, CA",
    "company": "CMLS Financial",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=2ebafc61baefa862",
    "title": "Analyst, Investor Services",
    "date_posted": "2025-06-13",
    "job_type": "fulltime",
    "max_amount": 45000.0,
    "min_amount": 45000.0,
    "job_url_direct": "https://recruiting.ultipro.ca/CML5000CMLS/JobBoard/5e2cdd1f-904d-4ae7-97a3-39050c5774dc/OpportunityDetail?opportunityId=cc7d62c7-261b-40d6-845a-36a1b85fcbe5&postingId=20e862eb-2a01-40fa-b6bf-1153dc64dbde",
    "company_group": "CMLS Financial",
    "company_search_term": "CMLS Financial",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": "hybrid",
    "employment_types": [
      "fulltime"
    ],
    "location_city": "Vancouver",
    "location_region": "BC",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:27.106980+00:00",
    "posted_days_ago": null,
    "dedupe_key": "d974e89c152bd5e20598d838010de4a8f7580c72"
  },
  {
    "description": "### **Administrateur bilingue, opérations hypothécaires commerciales**\n\n\n#### **Montréal, Québec**\n\n\n**Fourchette salariale :** 50 000 $ à 70 000 $\n\n\n\nCMLS Financial, un prêteur commercial de premier plan au Canada, cherche à élargir son équipe primée des opérations. Si vous recherchez une porte d’entrée dans l’industrie des services financiers, nous avons la flexibilité nécessaire pour adapter vos compétences et forces uniques aux besoins évolutifs de notre équipe. Rejoignez notre groupe performant de spécialistes, gestionnaires de comptes et analystes spécialisés dans les relations avec les emprunteurs, les paiements, la fiscalité foncière, l’assurance, la gestion des comptes après financement et les titrisations. Vous bénéficierez d’un soutien tout au long de votre formation et de votre développement, car nous sommes engagés dans la croissance de votre carrière.\n\n\n**À propos du poste :**  \n\nEn tant qu’Administrateur des opérations hypothécaires commerciales, vous jouerez un rôle clé dans la gestion du cycle de vie complet d’un portefeuille hypothécaire. Vos responsabilités couvriront l’ensemble des tâches administratives liées au service des prêts commerciaux après financement, incluant notamment :\n\n\n* Collaborer étroitement avec les emprunteurs et autres clients externes pour obtenir la documentation requise afin d’assurer la conformité avec leur contrat de prêt, notamment la collecte, la vérification et le suivi des données financières et immobilières, des paiements de taxes foncières, des renouvellements d’assurance et des documents de garantie du prêt.\n* Faciliter le financement des hypothèques originées par nos clients tiers et participer à l’administration des avances de construction.\n* Enregistrer avec précision les transactions post\\-financement dans le système de gestion des prêts commerciaux, en veillant à ce que les détails de sécurité et des emprunteurs, les modalités de paiement, les retenues, les engagements et autres informations pertinentes soient bien documentés et recoupés avec les sources originales.\n* Gérer et exécuter les tâches de suivi associées au cycle de vie du prêt hypothécaire.\n* Calculer les ajustements d’intérêts, les pénalités de remboursement anticipé, les composantes fiscales mensuelles ou les intérêts courus.\n* Superviser les remises mensuelles, rapprocher les comptes en fiducie et gérer les rapports automatisés et manuels pour les clients internes et externes.\n\n\n**Vos tâches consisteront également à :**\n\n\n* Veiller à ce que la correspondance avec les emprunteurs et les prêteurs soit conforme aux politiques de l’entreprise.\n* Traiter adéquatement les transactions du cycle de prêt post\\-clôture en fonction des exigences des fonctions de l’équipe.\n* Acquérir des compétences interfonctionnelles pour prendre en charge au besoin d’autres tâches dans l’équipe comme les relations avec les emprunteurs, le recouvrement et les relations avec les investisseurs ou la gestion des garanties.\n* Mettre en œuvre des contrôles pour préserver l’intégrité du système de prêts hypothécaires et l’exactitude des informations.\n* Effectuer des contrôles par les pairs dans l’équipe.\n* Participer aux formations et aux réunions de l’équipe ou du service et formuler des recommandations visant l’amélioration des pratiques.\n* Assurer la gestion efficace des documents, en ce qui a trait notamment à l’organisation physique et électronique des dossiers des clients et des bases de données.\n* Gérer les relations avec les clients, tant internes qu’externes, en vue de faciliter le processus des demandes d’information.\n* Répondre aux demandes de collecte régulière de données et saisir des données dans des feuilles de calcul, des rapports standard et des systèmes internes.\n\n\nVotre rôle est essentiel pour garantir l’efficacité et la précision de nos opérations de crédit hypothécaire commercial.\n\n\n**Compétences :**\n\n\n* Vous êtes une personne axée sur les résultats, vous avez un grand sens de l’organisation et un grand souci du détail.\n* Vous avez de solides compétences en analyse et en calcul.\n* Vous utilisez Microsoft Office à un niveau intermédiaire ou avancé.\n* Vous faites preuve de professionnalisme, de jugement et d’intégrité.\n* Les activités de prêts immobiliers commerciaux vous passionnent.\n* Vous faites preuve de motivation, attachez de l’importance aux processus et possédez de solides compétences en matière d’administration et d’exploitation.\n* Vous avez la capacité, de respecter des délais serrés et de traiter des informations sensibles ou confidentielles avec discrétion.\n* Vous possédez d’excellentes aptitudes pour la communication écrite et orale en anglais et en français.\n* Vous avez obtenu, ou êtes en voie d’obtenir, un diplôme de premier cycle en immobilier, administration des affaires, mathématiques, comptabilité, assurance ou économie.\n* Vous avez de l’expérience dans le secteur bancaire, des coopératives de crédit ou des services financiers (atout).\n\n\n**Avantages et privilèges**\n\n\n\nVoici quelques avantages offerts à CMLS :\n\n\n* Comptes de gestion santé et de mieux\\-être\n* Avantages liés aux soins médicaux, aux médicaments, aux soins de la vue et aux soins dentaires\n* Vacances, congés de maladie et congés personnels (en plus de tous les congés civiques et jours fériés)\n* REER collectif avec cotisations patronales de contrepartie\n* Programme complémentaire de congé de maternité et parental\n* Rabais sur l’abonnement à un centre de conditionnement physique\n* Assistance voyage et PAE\n* Événements sociaux et équipes sportives de l’entreprise\n* Modes de travail hybride et occasions de télétravail\n* Et plus encore!\n\n**Qui sommes\\-nous?**\nFondée en 1974, CMLS Financial est le principal fournisseur de solutions de financement pour les propriétaires, promoteurs et investisseurs immobiliers commerciaux. Nous comptons plus de 50 ans d’expérience, 30 000 clients, 45 milliards de dollars d’actifs sous gestion et des bureaux d’un océan à l’autre. Certaines des banques, sociétés de gestion de placements, compagnies d’assurance et caisses de retraite les plus réputées du Canada font confiance à CMLS Financial pour une variété de services essentiels. Grâce à notre solide assise financière et à notre vaste expérience, nous continuons d’offrir des solutions de financement inégalées pour répondre à tous les besoins de nos clients.  \n\n\n**Vous adorerez travailler ici**  \n\nLes employés nous disent qu’ils adorent le fait que nous assurions l’équilibre entre un climat extrêmement professionnel et une culture d’entreprise dynamique et très agréable. Nous travaillons dans un contexte au rythme rapide et fluide, qui soutient des employés énergiques et motivés, fiers de faire montre de souplesse et axés sur les résultats. Les affaires sont en plein essor, nos employés sont en mesure de se faire connaître, profitent de nombreuses occasions d’apprentissage et peuvent vraiment avoir une incidence sur notre entreprise. Nous sommes résolus à offrir à nos employés une carrière intéressante et enrichissante, car ce sont nos employés qui nous permettent de nous différencier et nous le savons.\n\n\n**Équité en matière d’emploi**\n\n\n\nLa Financière CMLS s’engage envers l’équité en matière d’emploi, la diversité et l’inclusion. Nous sommes heureux d’accepter les demandes d’emploi de tous les candidats qui disposent des compétences requises, sans distinction fondée sur l’origine ethnique, la couleur de peau, la religion, le sexe, l’orientation sexuelle, l’identité de genre, le pays d’origine, l’âge, l’invalidité, le statut d’ancien combattant, le statut d’Autochtone ou d’Amérindien ou tout autre élément protégé en vertu de la loi. Si un candidat en fait la demande, nous pouvons lui fournir des accommodements liés à son invalidité dans le cadre du processus de sélection.\n\n\n**Nous voulons vous rencontrer!**  \n\nSi vous êtes convaincu que vous seriez un précieux atout pour notre équipe, envoyez votre curriculum vitæ et votre lettre de présentation dès maintenant. Nous remercions tous les candidats d’avoir pris le temps de déposer leur candidature; toutefois, nous ne communiquerons qu’avec les personnes qui seront convoquées à une entrevue. Les demandes seront acceptées dès maintenant, et ce, jusqu’à ce que le poste soit pourvu.\n\n\n**\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_**\n\n\n### **Bilingual Administrator****, Commercial Mortgage Operations**\n\n  \n\n**Montreal, QC**\n\n\n**Salary Range:** $50,000 \\- $70,000/yr\n\n\n\nCMLS Financial, a leading commercial lender in Canada, is dedicated to expanding our award\\-winning Operations team. If you're looking for an entry point into the financial services industry, we have the flexibility to match your unique skills and strengths to the team's evolving needs. Join our high\\-performance group of specialists, account managers, and analysts specializing in borrower relations, payments, property tax, insurance, post\\-funding account management, and securitizations. You will be supported in your training and development journey as we are committed to nurturing your career growth.\n\n\n**About the role:**\n\n\n\nAs a Commercial Mortgage Operations Administrator, you will play a pivotal role in managing the full life cycle of a mortgage portfolio. Your responsibilities encompass overseeing end\\-to\\-end Commercial Servicing post\\-funding administration responsibilities, which can include a variation of the following:\n\n\n* Work closely with borrower and other external clients to secure requisite documentation for compliance against their loan agreement, including collecting, verifying, and tracking financial and property data, property tax payments, insurance renewals, and loan security documents.\n* Facilitate the funding of mortgages originated through our third\\-party clients and aiding in the administration of construction advances\n* Accurately record post\\-funding transactions in the commercial loans management system, ensuring security \\& borrower details, payment terms, holdbacks, undertakings, and other relevant information are properly documented and cross referenced with source materials\n* Manage and execute follow\\-up tasks associated with the mortgage life\\-cycle process\n* Calculate interest adjustments, prepayment penalties, monthly tax components or interest accruals\n* Oversee monthly remittances, reconcile trust accounts and manage both automated and manual reporting for internal and external clients\n\n\n**Your duties will also entail:**\n\n\n* Ensuring correspondence to borrowers and lenders adheres to company policies.\n* Accurate processing of post\\-closing lending cycle transactions according to team function requirements.\n* Developing a proficiency in other team functions to serve as a function floater, such as Borrower Relations, Collections \\& Investor Relations, and Collateral Management.\n* Implementing controls to safeguard the mortgage loan system's integrity and information accuracy.\n* Conducting peer checks within the team.\n* Attending team and department trainings and meetings, providing recommendations for enhanced practices.\n* Effective document management, including physical and electronic file organization related to client files and databases.\n* Managing client and customer relations, both internal and external, to facilitate information requests.\n* Responding to routine data collection requests, inputting data into spreadsheets, standard reports, and internal systems\n\n\n **This role is for you if you have:**\n\n\n* Results\\-driven with strong organizational skills and meticulous attention to detail.\n* Proficient in analytical and numerical skills.\n* Intermediate to advanced Microsoft Office user.\n* Demonstrates professionalism, judgment, and integrity.\n* Passion for real estate lending business.\n* Self\\-motivated, process\\-oriented, and possesses strong administration and operation skills.\n* Ownership and accountability for work, ability to meet tight deadlines, and handle sensitive or confidential information with discretion.\n* Excellent written and verbal communication skills in English and French.\n* Undergraduate degree or nearing completion in Real Estate, Business Administration, Math, Accounting, Insurance, or Economics.\n* Experience in the banking, credit union, or financial services industry is an asset\n\n**Benefits and Perks**\nSome of the benefits we offer at CMLS are:\n* Health and Wellness Spending Accounts\n* Health, Drug, Vision, and Dental benefits\n* Paid vacation, sick days, and personal days (in addition to all civil and statutory holidays)\n* RRSP Matching Program\n* Maternity / Parental Leave Top Up Program\n* Discounted gym memberships\n* Travel assistance and EAP\n* Company social events \\+ sport teams\n* Hybrid work arrangements and telecommuting opportunities\n* And more!\n\n\n**Who are we?**\n\n  \n\n\nEstablished in 1974, CMLS Financial is the leading provider of capital solutions for commercial property owners, developers and real estate investors. We have over 50 years of experience, 30,000 clients, $45 billion in assets under administration, and offices coast to coast. Some of Canada's most prominent banks, investment managers, insurance companies, and pension funds rely on CMLS Financial for a variety of critically important services. Building on our solid foundation of financial strength and experience, we continue to deliver unparalleled capital solutions for all our clients needs.\n\n\n**You will love working here**  \n\nEmployees tell us that they love that we strike the balance in creating an incredibly professional, yet dynamic and enjoyable corporate culture. We work in a fluid and fast\\-paced environment that is supportive of energetic and motivated individuals who pride themselves on being flexible and results\\-driven. Business is booming and that means that our employees are able to gain valuable exposure, have lots of learning opportunities, and truly impact the business. We are committed to providing our people with a challenging and rewarding career because our employees are what set us apart and **we know it**.\n\n\n**Equal Opportunity Employer**  \n\nCMLS Financial is an equal opportunity employer committed to diversity and inclusion. We are pleased to consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veterans status, Aboriginal/Native American status or any other legally\\-protected factors. Disability\\-related accommodations are available on request for candidates taking part in all aspects of the selection process.\n\n\n**We want to hear from you!**  \n\nIf you are confident that you would be a strong asset to our team, submit both a cover letter and resume today! We thank all applicants for their time in applying, however we will only contact those selected for an interview.",
    "id": "in-f4815ac59cb79bdb",
    "currency": "CAD",
    "site": "indeed",
    "location": "Montréal, QC, CA",
    "company": "CMLS Financial",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=f4815ac59cb79bdb",
    "title": "Administrateur bilingue, opérations hypothécaires commerciales / Bilingual Commercial Mortgage Administrator, Mortgage Operations",
    "date_posted": "2025-06-11",
    "job_type": "fulltime",
    "max_amount": 50000.0,
    "min_amount": 50000.0,
    "job_url_direct": "https://recruiting.ultipro.ca/CML5000CMLS/JobBoard/5e2cdd1f-904d-4ae7-97a3-39050c5774dc/OpportunityDetail?opportunityId=39e78b6e-1613-4bd0-821f-00c14aa6d5da&postingId=ee32ff02-2397-4f99-b63c-4224f39542d2",
    "company_group": "CMLS Financial",
    "company_search_term": "CMLS Financial",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": "hybrid",
    "employment_types": [
      "fulltime"
    ],
    "location_city": "Montréal",
    "location_region": "QC",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:27.110725+00:00",
    "posted_days_ago": null,
    "dedupe_key": "d13ee9b0120b6597f7f136c0b2e9db9d4aa648e6"
  },
  {
    "description": "### **Analyst, Commercial Lending**\n\n\n**Toronto, ON**\n\n\n**Salary Range:** $55,000 \\- $70,000/yr\n\n  \n\n\n\nCMLS Financial is looking for an Analyst, Commercial Lending to join our growing team. You will be responsible for underwriting credit applications and submissions, with summaries and recommendations regarding risk assessment for commercial mortgages.\n\n\n**About the Role**\n\n\n\nIn this role, you will provide timely and proactive support by:\n\n\n* Conducting appropriate due diligence and investigation to gain solid understanding of the borrower, analyzing and interpreting financial data and credit information, assessing the value of security, and underwriting commercial mortgage presentations within the guidelines of lending policies and procedures\n* Maintaining ongoing interaction internal stakeholders to ensure thorough underwriting and funding of the loan\n* Working as part of a team in the completion of mortgage presentations, meeting pre\\-funding conditions and investor instructions to meet all funding requirements within tight deadlines\n* Staying current with market information and commercial mortgage market trends\n* Performing other duties in keeping with the purpose and accountabilities of the job, such as preparing reports, assisting with compliance\\-related tasks and completing department projects as assigned\n\n\n**This role is for you if:**\n\n\n* You have approximately 1 year (or more) of experience working in the Commercial Real Estate Risk industry\n* You have excellent communication skills, both written and verbal, and are able to work well independently as well as within a team environment\n* You have experience creating and delivering business presentations and strong technical writing skills\n* You are very results\\-driven and possess strong organizational skills with a high attention to detail\n* You take ownership of your work and demonstrate a high degree of accountability and commitment at all times\n* You have completed an undergraduate degree in one of the following concentrations: finance, economics, urban land development, accounting or business administration\n* You are an intermediate/advanced level user of Microsoft Office (Excel, Word, PowerPoint, SharePoint)\n* You have a passion for real estate combined with an understanding of financial and statement analysis\n\n\n**Benefits and Perks**\n\n\n\nSome of the benefits we offer at CMLS are:\n\n\n* Health and Wellness Spending Accounts\n* Health, Drug, Vision, and Dental benefits\n* Paid vacation, sick days, and personal days (in addition to all civil and statutory holidays)\n* RRSP Matching Program\n* Maternity / Parental Leave Top Up Program\n* Discounted gym memberships\n* Travel assistance and EAP\n* Business Casual dress code\n* And more!\n\n##### **Who are we?**\n\n\n\nEstablished in 1974, CMLS Financial is the leading provider of capital solutions for commercial property owners, developers and real estate investors. We have over 50 years of experience, 30,000 clients, $45 billion in assets under administration, and offices coast to coast. Some of Canada's most prominent banks, investment managers, insurance companies, and pension funds rely on CMLS Financial for a variety of critically important mortgage services. What sets us apart is our customer forward approach. Building on our solid foundation of financial strength and experience, we continue to deliver unparalleled capital solutions for all our clients needs.\n\n\n**You will love working here**\n\n\n\nEmployees tell us that they love that we strike the balance in creating an incredibly professional, yet dynamic and enjoyable corporate culture. We work in a fluid and fast\\-paced environment that is supportive of energetic and motivated individuals who pride themselves on being flexible and results\\-driven. Business is booming and that means that our employees are able to gain valuable exposure, have lots of learning opportunities, and truly impact the business. We are committed to providing our people with a challenging and rewarding career because our employees are what set us apart and **we know it**.\n\n\n**Equal Opportunity Employer**\n\n\n\nCMLS Financial is an equal opportunity employer committed to diversity and inclusion. We are pleased to consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veterans status, Aboriginal/Native American status or any other legally\\-protected factors. Disability\\-related accommodations are available on request for candidates taking part in all aspects of the selection process.\n\n\n**We want to hear from you!**\n\n\n\nIf you are confident that you would be a strong asset to our team, submit both a cover letter and resume today. Be sure to tell us why you believe yourself to be a perfect fit! We thank all applicants for their time in applying, however we will only contact those selected for an interview. Consideration of applications will begin immediately and continue until the position is filled.",
    "id": "in-4e01e23b9faca8dc",
    "currency": "CAD",
    "site": "indeed",
    "location": "Toronto, ON, CA",
    "company": "CMLS Financial",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=4e01e23b9faca8dc",
    "title": "Analyst, Commercial Lending",
    "date_posted": "2025-06-06",
    "job_type": "fulltime",
    "max_amount": 55000.0,
    "min_amount": 55000.0,
    "job_url_direct": "https://recruiting.ultipro.ca/CML5000CMLS/JobBoard/5e2cdd1f-904d-4ae7-97a3-39050c5774dc/OpportunityDetail?opportunityId=9a203875-b2ab-4b89-99a9-4658d03d90ae&postingId=004ec457-38a9-40e8-94ad-435fc37869f4",
    "company_group": "CMLS Financial",
    "company_search_term": "CMLS Financial",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": [
      "fulltime"
    ],
    "location_city": "Toronto",
    "location_region": "ON",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:27.112416+00:00",
    "posted_days_ago": null,
    "dedupe_key": "6365776a4f713ec293083a05179ab104b9392b3e"
  },
  {
    "description": "### **Vice\\-président régional, Collecte de capitaux, CMLS Gestion de Fonds**\n\n  \n\n**Montréal, QC**  \n\n**Fourchette salariale : 120 000 $ de salaire de base \\+ une commission trimestrielle attrayante (points de base sur les ventes brutes)**\n\n  \n\n\n\nCMLS Gestion de Fonds est à la recherche d’un Vice\\-président régional, Collecte de capitaux (Est du Canada) pour se joindre à notre équipe en pleine croissance.\n\n\n\nCMLS Gestion de Fonds offre à ses clients investisseurs une exposition à la dette immobilière, soit par des investissements collectifs ou des relations de sous\\-conseil direct. Notre produit “flagship” est le Fonds Hypothécaire CMLS, avec un historique de 16 ans et un rendement solide de 6 à 8 %. Notre vision et objectif est d’être reconnu comme un gestionnaire d'actifs alternatifs de confiance.\n\n\n\nL'objectif principal de l'équipe de ventes nationale est de faire croître notre base d'actifs en soutenant nos clients investisseurs directs ainsi que notre réseau de professionnels de l’investissement alors qu'ils préparent leurs clients pour la retraite et d’autres objectifs de vie importants nécessitant une gestion financière ciblée. L'équipe travaille ensemble pour planifier et exécuter une stratégie qui cultive des relations clés et maximise efficacement les ventes sur le territoire.\n\n\n**À propos du rôle :**  \n\nEn tant que membre clé de l’équipe des ventes, le Vice\\-président régional, Collecte de capitaux travaillera en partenariat avec le directeur général de comptes nationaux et collecte de capitaux pour garantir la mise en œuvre efficace et efficiente du plan de vente sur le territoire. Le Vice\\-président régional, Collecte de capitaux apprendra les bases de nos activités, qui sont nos clients, quels sont leurs besoins et comment CMLS peut répondre à ces besoins.\n\n\n**Dans ce rôle, vous devrez :**\n\n\n* Générer et maintenir constamment un pipeline de transactions de qualité pour atteindre les objectifs de ventes et d’activité/engagement\n* Maintenir et renforcer les relations avec nos clients externes\n* Découvrir et explorer de nouvelles opportunités commerciales via des appels de vente\n* Travailler avec le directeur général de comptes nationaux et collecte de capitaux pour optimiser l’utilisation et l'efficacité des gestionnaires de portefeuilles, de la due diligence, de la participation à des conférences et d'autres événements pour la région\n* Gérer les relations avec les investisseurs ; fournir un soutien et des services proactifs aux investisseurs et prospects, répondre aux demandes de renseignements et coordonner le suivi lorsque nécessaire de manière professionnelle et en temps opportun\n* Maintenir des dossiers précis des contacts dans la région, ainsi que le suivi de l’activité des pistes dans le pipeline de ventes et le CRM\n* Voyager au besoin pour des présentations de ventes et des réunions\n* Maintenir vos connaissances à jour sur notre industrie et nos concurrents\n* Participer et contribuer aux réunions régulières de l’équipe et aux séances de planification d’affaires\n* Fournir un soutien continu concernant la marque et la présence de CMLS Asset Management et du Fonds Hypothécaire CMLS, partager des idées et des stratégies visant à développer les ventes globales et la base de clients\n* Coordonner et participer à des événements d’entreprise et sociaux avec des collègues et des professionnels de l'industrie\n* Représenter l'entreprise avec honnêteté et intégrité tout en offrant un service client de haute qualité à nos partenaires externes et internes\n\n\n**Compétences et qualifications :**\n\n\n* Minimum de 3 à 5 ans d’expérience en ventes sur le terrain ou équivalent\n* Diplôme de baccalauréat en arts, sciences ou commerce préféré\n* La réussite du cours canadien en valeurs mobilières (CCVM) est requise\n* Représentant en opérations de courtage est un atout\n* Excellentes compétences interpersonnelles avec une capacité à établir des relations professionnelles\n* Passionné(e), prêt(e) à mettre l’effort supplémentaire pour atteindre les objectifs personnels\n* Excellentes compétences en gestion du temps pour gérer plusieurs tâches simultanément avec peu de supervision, dans un environnement de travail dynamique\n* Motivé(e) et orienté(e) vers les résultats avec une attitude positive\n* Capacité à travailler efficacement autant en équipe que de façon autonome, ouvert(e) à la direction et à un style de travail collaboratif\n* Excellentes compétences en communication écrite et orale\n* Capacité à rester flexible et à respecter les délais sous pression avec peu de supervision\n* Solide compréhension des principes fondamentaux de l'immobilier et des finances\n* Esprit entrepreneurial\n\n\n**Avantages et avantages sociaux**\n\n\n\nCertains des avantages que nous offrons chez CMLS :\n\n\n* Comptes de dépenses pour la santé et le bien\\-être\n* Avantages en santé, médicaments, vision et soins dentaires\n* Vacances payées, congés de maladie et congés personnels (en plus de tous les congés civils et légaux)\n* Programme de cotisation REER\n* Programme de soutien pour le congé de maternité/parental\n* Abonnements au gym à prix réduit\n* Assistance voyage et EAP\n* Code vestimentaire décontracté pour les affaires\n* Événements sociaux d'entreprise \\+ équipes sportives\n* Aménagements de travail hybrides et possibilités de télétravail\n* Et bien plus encore !\n\n\n**Qui sommes\\-nous ?**  \n\nCMLS Asset Management est un gestionnaire d'investissement enregistré, un gestionnaire de portefeuille et un courtier en marché exempt, avec un bilan de 16 ans dans la livraison de rendements stables aux investisseurs recherchant une exposition à la dette immobilière. L’entreprise gère son fonds phare, le Fonds Hypothécaire CMLS, et agit en tant que sous\\-conseiller pour des clients investisseurs institutionnels cherchant à compléter leurs investissements en revenus fixes traditionnels par de la dette immobilière.\n\n\n**Vous allez adorer travailler ici**  \n\nLes employés nous disent qu’ils adorent que nous trouvions l’équilibre entre créer une culture d’entreprise incroyablement professionnelle, tout en étant dynamique et agréable. Nous travaillons dans un environnement fluide et rapide, soutenant des individus énergiques et motivés qui sont fiers d’être flexibles et axés sur les résultats. Nos employés ont la possibilité d’acquérir une expérience précieuse dans l’industrie, de nombreuses opportunités d’apprentissage et ont un réel impact sur l’entreprise. Nous nous engageons à offrir à nos employés une carrière stimulante et enrichissante, car nous savons que ce sont eux qui nous distinguent.\n\n\n**Employeur garantissant l’égalité des chances**  \n\nCMLS Financial est un employeur garantissant l’égalité des chances, engagé dans la diversité et l’inclusion. Nous avons le plaisir de considérer toutes les candidatures qualifiées sans égard à la race, la couleur, la religion, le sexe, l’orientation sexuelle, l’identité de genre, l’origine nationale, l’âge, le handicap, le statut de vétéran protégé, le statut autochtone/amérindien ou tout autre facteur protégé par la loi. Des aménagements liés au handicap sont disponibles sur demande pour les candidats prenant part à toutes les étapes du processus de sélection.\n\n\n**Nous voulons avoir de vos nouvelles !**  \n\nSi vous êtes convaincu que vous seriez un atout précieux pour notre équipe, soumettez dès aujourd’hui une lettre de motivation et un CV ! Nous remercions tous les candidats pour le temps qu’ils consacrent à postuler, cependant, nous ne contacterons que ceux sélectionnés pour un entretien. L’examen des candidatures commencera immédiatement et se poursuivra jusqu’à ce que le poste soit pourvu.\n\n  \n\n\n**\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_**\n\n  \n\n\n### **Regional Vice\\-President, Capital Raising, CMLS Asset Management**\n\n\n**Montreal, QC**\n\n**Salary Range: $120,000 base \\+ attractive quarterly commission (basis points on gross sales)**\n\n  \n\n\n\nCMLS Asset Management is looking for a Regional Vice\\-President, Capital Raising (Eastern Region) to join our growing team.\n\n\n\nCMLS Asset Management provides its investor clients with exposure to real estate debt, either through pooled vehicles or direct sub\\-advisory relationships. Our flagship product is the CMLS Mortgage Fund with a 16\\-year track record and a strong return profile of 6\\-8%. Our vision is to be recognized as a trusted alternative asset manager.\n\n\n\nThe primary objective of the national sales team is to grow our asset base by supporting our direct investor clients and our network of investment professionals as they prepare their clients for retirement and other significant life goals that demand focused financial management. The team works together to plan and execute a strategy that cultivates key relationships and effectively maximizes territory sales.\n\n\n**About the Role:**\n\nAs an integral member of the sales team, the Regional Vice\\-President, Capital Raising will work in partnership with the Managing Director, National Accounts and Capital Raising to ensure the effective and efficient implementation of the territory sales plan. The Regional Vice\\-President, Capital Raising will learn about the fundamentals of our business, who our clients are, what their needs are, and how CMLS can meet those needs.\n\n\n**In this role, you will:**\n\n\n* Consistently generate and maintain a quality pipeline of transactions to meet sales and activity/engagement targets\n* Maintain and strengthen external client relationships\n* Discover and explore new business opportunities via proactive sales calls\n* Work with the Managing Director, National Accounts and Capital Raising to optimize the use and effectiveness of PM access, due diligence, conference participation and other events for the region\n* Manage investor relations; providing proactive support and services to existing supporters, investors, and prospects, responding to inquiries, and coordinating follow\\-up where required in a professional and timely manner\n* Maintain accurate records of contacts in the region, along with activity tracking of leads in the sales pipeline and CRM\n* Travel as needed to deliver sales presentations and meetings\n* Maintain up\\-to\\-date knowledge of our industry and competition\n* Participate in and contribute to regular team meetings and business planning sessions\n* Provide ongoing support regarding the CMLS Asset Management and CMLS Mortgage Fund brand and presence, sharing ideas and strategies designed to develop overall sales and client base\n* Coordinate and participate in corporate and social events with colleagues and industry professionals\n* Represent the Company with honesty and integrity while delivering high levels of customer service to both our external and internal partners\n\n\n**Skills and Qualifications:**\n\n* Minimum 3\\-5 years of successful field sales experience or equivalent\n* Bachelor of Arts, Science or Commerce degree preferred\n* Completion of the Canadian Securities Course (CSC) is required\n* Registered Dealing Representative is an asset\n* Excellent interpersonal skills with proven ability to build relationships\n* Passionate, willing to put in the extra effort to achieve personal goals\n* Excellent time management skills to handle multiple tasks simultaneously with limited supervision, in a fast\\-paced work environment\n* Driven and goal\\-oriented with a positive attitude\n* Ability to work effectively both in a team environment and independently, open to direction and a collaborative work style\n* Excellent written and oral communication skills\n* Must have the ability to remain flexible and meet deadlines under pressure with little supervision\n* Strong understanding of real estate and finance fundamentals\n* An entrepreneurial spirit\n\n\n**Benefits and Perks**\n\n\n\nSome of the benefits we offer at CMLS are:\n\n\n* Health and Wellness Spending Accounts\n* Health, Drug, Vision, and Dental benefits\n* Paid vacation, sick days, and personal days (in addition to all civil and statutory holidays)\n* RRSP Matching Program\n* Maternity / Parental Leave Top Up Program\n* Discounted gym memberships\n* Travel assistance and EAP\n* Business Casual dress code\n* Company social events \\+ sport teams\n* Hybrid work arrangements and telecommuting opportunities\n* And more!\n\n\n**Who are we?**\n\n\n\nCMLS Asset Management is a registered investment fund manager, portfolio manager, and exempt market dealer, with a 16\\-year track record in delivering stable returns to investor clients seeking exposure to real estate debt. The firm manages its flagship fund, the CMLS Mortgage Fund, and acts as subadvisor to institutional investor clients seeking to augment their traditional fixed income investments with real estate debt.\n\n\n**You will love working here**\n\n\n\nEmployees tell us that they love that we strike the balance in creating an incredibly professional, yet dynamic and enjoyable corporate culture. We work in a fluid and fast\\-paced environment that is supportive of energetic and motivated individuals who pride themselves on being flexible and results\\-driven. Our employees are able to gain valuable industry exposure, lots of learning opportunities, and truly impact the business. We are committed to providing our people with a challenging and rewarding career because our employees are what set us apart and **we know it**.\n\n\n**Equal Opportunity Employer**\n\n\n\nCMLS Financial is an equal opportunity employer committed to diversity and inclusion. We are pleased to consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veterans status, Aboriginal/Native American status or any other legally\\-protected factors. Disability\\-related accommodations are available on request for candidates taking part in all aspects of the selection process.\n\n\n**We want to hear from you!**\n\n\n\nIf you are confident that you would be a strong asset to our team, submit both a cover letter and resume today! We thank all applicants for their time in applying, however, we will only contact those selected for an interview. **Consideration of applications will begin immediately and continue until the position is filled.**",
    "id": "in-1732470af47f587a",
    "currency": null,
    "site": "indeed",
    "location": "Montréal, QC, CA",
    "company": "CMLS Financial",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=1732470af47f587a",
    "title": "Vice-président régional, Collecte de capitaux, CMLS Gestion de Fonds / Regional Vice-President, Capital Raising, CMLS Asset Management",
    "date_posted": "2025-04-01",
    "job_type": "fulltime",
    "max_amount": null,
    "min_amount": null,
    "job_url_direct": "https://recruiting.ultipro.ca/CML5000CMLS/JobBoard/5e2cdd1f-904d-4ae7-97a3-39050c5774dc/OpportunityDetail?opportunityId=725eca29-678e-4c57-b5f3-facfbc883d9c&postingId=81bf5a53-17b9-4560-bb6e-a88d4958fec2",
    "company_group": "CMLS Financial",
    "company_search_term": "CMLS Financial",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": "hybrid",
    "employment_types": [
      "fulltime"
    ],
    "location_city": "Montréal",
    "location_region": "QC",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:27.117079+00:00",
    "posted_days_ago": null,
    "dedupe_key": "97e139005504a3d4adb06ab9a719f5fa943b784e"
  }
]