[
  {
    "description": "As a member\\-owned cooperative, we’re helping our members with their real goals and real challenges so they can live the real life they want. It’s what we’ve been doing for over 80 years, and it’s why today we stand almost 600,000 members strong. Plus, we invest 10% of our budgeted profits back into our community – almost $90 million since 2000 alone – because when our members do well, we believe our communities should do well too.\n\n\nCustomer Services Representative\n\n\nJan 5, 2026\n**Location(s):** Georgia Branch\n**Job Type:** Part Time Regular\n**myWork Program:** Office\n**Starting Salary Range:** $45,100\\.00 \\- $49,100\\.00\n**Background Screening Requirement:**\n* Enhanced Criminal Record Check\n* Credit Check\n* Identity Verification\n* Employment Verification\n* References\n\n  \n\n\n**Job Purpose**  \n\n\n\nOn any given shift you will be the face of Coast Capital in the branch and balance a friendly advice and service approach with demonstrated ability to proactively listen and identify opportunities to deepen member relationships. By providing our members with support and financial advice, we help them Build a Better Future, Together. While this job is posted as a Customer Service Representative, internally, we title it a Member Service Representative, always putting members at the centre of everything we do.  \n\n\n**Accountabilities**  \n\n\n* Be the first friendly face our members see at Coast Capital by exhibiting our Coast Capital values;\n* We build connection.\n* We act with courage.\n* We re\\-imagine.\n* Build relationships with member and deliver an outstanding member experience by meeting their initial needs and proactively identifying future opportunities through money chats and so much more!\n* Educating members on our alternate channels (online banking and mobile platforms) to deliver a memorable member experience\n* Contribute to team results through listening, spotting opportunities and partnering with other Coast Capital team members to best meet our members financial needs\n* Build a strong understanding of how Coast Capital Savings assists in providing financial well\\-being to our members\n* Create a positive member experience by proactively taking ownership of resolving and preventing member banking issues.\n* Be the first line of defense by being on the lookout for any counterfeit money or illegal transactions that may occur.\n\n  \n\n\n**Skills \\& Qualifications**  \n\n\n\nTo be successful as a Member Service Representative in a Coast Capital branch, you must be positive, team\\-oriented individual with the following knowledge, skills and abilities.\n* **Communication** – You have strong verbal English communication skills and are comfortable having sensitive conversations with members.\n* **Active Listening** – You listen to your customer and ensure you identify the challenge they may have so you can work towards a positive outcome.\n* **Empathy** – You understand a bank account is more than numbers on a screen and you can show understanding and respect for whatever situation a member might be in.\n* **Initiative** – You don’t sit and wait for something to do. You see something that needs to be done, and do it.\n* **Problem Solving** – You find job satisfaction by identifying a member problem and work towards solving it with them.\n* **Curiosity** – You are a life\\-long learner who loves to grow their understanding of the financial world.\n* **Advisory** – You are comfortable identifying opportunities and suggesting Coast Capital products to our members by referring them to other specialists within our organization.\n* **Adaptability** – You happily handle whatever situation comes your way.\n* **Motivation** – You are a self\\-motivated, positive and are looking to grow your career in customer service and/or banking.\n* **Integrity** – You follow the documented process and do the right thing, every time. Even when no one is watching.\n  \n\n**Equity, Diversity \\& Inclusion at Coast Capital**  \n\n\n\nDon’t meet every single requirement? At Coast Capital, we believe everyone has potential. We are committed to building better, brighter, more inclusive futures for everyone – including our employees. We see the potential in our employees to achieve amazing things and want to invest in your future. If you’re excited about this career opportunity and your experience may not perfectly align with every qualification in this job posting, we still encourage you to apply. You may be just the right candidate for this or other opportunities at Coast Capital.  \n\n\n\nAt Coast Capital, we are committed to equity, diversity and inclusion. We strongly encourage applications from Indigenous Peoples, Black, and racialized persons, persons with disabilities, people of diverse sexual and gender identities and women. We value applicants who have demonstrated a commitment to equity, diversity and inclusion and recognize that diverse perspectives, experiences and expertise benefit of our employees, our members, and our community.  \n\n\n\nCoast Capital is committed to providing an accessible recruitment experience. If you are a candidate with a disability and require accommodation(s) during any stage of the recruitment process, please contact us at accessibility@coastcapitalsavings.com or 778\\-391\\-5836\\. This contact is intended solely for inquiries or feedback related to accessibility barriers, accommodation requests or alternate format requests. We will work with you to ensure your needs are met. You will only receive a response to inquiries related to these topics.  \n\n\nWhy join Coast Capital Savings?\n\n\n* **Purpose is our North Star.** We look at everything through our purpose. It informs the advice we provide our members, the experiences and products we create, and the programs we build to support our employees and communities.\n* **Committed to inclusion and engagement.** We have an ongoing focus on equity, diversity, and inclusion and routinely track how we’re doing, and what we need to do to keep improving. We foster a culture where everyone can feel safe to be who they really are and thrive.\n* **A career that grows with you.** We believe in developing our people and promoting from within. Many employees have spent decades, and sometimes their entire careers, with Coast Capital and have progressed from the frontlines to senior leadership.\n* **Work where you’re most effective.** In 2020 the world changed, and that includes how we work. In response to COVID\\-19 we launched myWork, which gives employees flexibility in where they work based on the nature of their role.\n* **Benefits that flex to the needs of you and your family.** We offer comprehensive, customizable benefits for you and your family, so you can choose what fits best for you and your lifestyle.\n* **Retirement options.** We also take care of our employees once they retire. That’s why we offer the choice of a defined contribution or defined benefit pension plan or RSP’s.\n* **Mortgage and auto financing benefits**. Employees save thousands on their mortgages and auto loans with best\\-in\\-category benefits.\n* **Real Recognition**. We recognize excellence throughout the year, through an online community that lets employees give kudos and thanks throughout the year. We’re human, which means we like to have fun with events, celebrations, and recognition throughout the year.\n* **An award winning culture**. We’re a Platinum member of Canada’s Best Managed Companies and are regularly recognized by Canada’s Most Admired Corporate Cultures and the BC Top Employers Awards.\n* **We reinvest 10% back into the community.** When we do well, our communities do well. That’s why since 2000 we’ve invested over $90 million into our member’s communities.\n* **Double your impact.** Through our employee volunteer program, Coast Capital donates $10 for every hour you volunteer to a Canadian charity or non\\-profit of your choice.",
    "id": "in-d47a73946d9fc711",
    "currency": "CAD",
    "site": "indeed",
    "location": "Vancouver, BC, CA",
    "company": "Coast Capital Savings",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=d47a73946d9fc711",
    "title": "Customer Services Representative",
    "date_posted": "2026-01-05",
    "job_type": "parttime",
    "max_amount": 90.0,
    "min_amount": 90.0,
    "job_url_direct": "https://careers.coastcapitalsavings.com/job/Vancouver-Customer-Services-Representative-Brit-V6E-3C9/1353454700/",
    "company_group": "Coast Capital Savings",
    "company_search_term": "Coast Capital Savings",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": [
      "parttime"
    ],
    "location_city": "Vancouver",
    "location_region": "BC",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:23.387994+00:00",
    "posted_days_ago": null,
    "dedupe_key": "60de5b205ede5c67baf99ab024aac271f026ddaa"
  },
  {
    "description": "As a member\\-owned cooperative, we’re helping our members with their real goals and real challenges so they can live the real life they want. It’s what we’ve been doing for over 80 years, and it’s why today we stand almost 600,000 members strong. Plus, we invest 10% of our budgeted profits back into our community – almost $90 million since 2000 alone – because when our members do well, we believe our communities should do well too.\n\n\nAssociate, Commercial Real Estate\n\n\nDec 30, 2025\n**Location(s):** Georgia Business Centre\n**Job Type:** Full Time Regular\n**myWork Program:** Hybrid\n**Starting Salary Range:** $64,700\\.00 \\- $77,600\\.00\n**Background Screening Requirement:**\n* Enhanced Criminal Record Check\n* Credit Check\n* Identity Verification\n* Employment Verification\n* References\n\n **Overview:**\n\nReporting to the Director, Commercial Real Estate, the Associate supports an assigned team of Relationship Managers in the Commercial Real Estate team in the preparation, execution and fulfillment of everyday banking products/solutions, including simple cash management products and the preparation of financial analysis and credit requests, including annual reviews of credit facilities. Focus of the role is to support deposit gathering, risk and general account management of the commercial portfolio. The position will be exposed to varying deal complexity and sophisticated portfolio of members where the incumbent will be a key contact to commercial members to ensure smooth delivery of our services.  \n\n\n**Individual Key Contributions/Responsibilities:**\n* Plan, organize and complete assigned tasks such that all tasks are completed in a timely manner and to quality standards, while at all times maintaining a high level of customer service.\n* Process customer’s requests accurately and within specified timeframes, in accordance with Credit Union Policies \\& Procedures and applicable legislative/regulatory requirements, to effectively and efficiently support and sustain exemplary customer sales, service and non\\-credit fulfillment.\n* Provide proactive, friendly, courteous, knowledgeable and professional customer service, identifying opportunities and initiating qualified referrals to others including Retail or Commercial business Lines to add value to the customer relationship. Take ownership of customer satisfaction by thoroughly identifying their needs, gathering information and handling any problems/issues tactfully and effectively.\n* Prepare everyday banking (including account opening documentation), lending (non\\-security) and investment product documentation in a courteous and knowledgeable manner in accordance with established standards and legislative/regulatory requirements.\n* Provide service support for basic Cash Management products, referring to specialists in cash management as needed.\n* Assist in the preparation of credit applications, collection and assimilation of information necessary to make credit decisions. Conduct initial financial analysis before consulting with Relationship Managers to assess borrower, industry and facility risk.\n* Generate monthly reporting requirements.\n* Actively identify, record and advise RMs of any potential risk issues. Recommend workflow and administrative process alternatives to improve efficiencies and customer service. Assist in resolving audit and customer issues, ensuring irregularities are corrected, and provide timely, effective problem resolution, escalating issues as needed.\n* Responsible for credit monitoring and compliance requirements which includes obtaining and analysis of financial statements, margin and other reports. Support pre\\-funding due diligence and security documentation completion and follow\\-up.\n* Protect the Credit Union’s assets by understanding the risks and take appropriate actions relating to business banking. Identify risk related to personal banking, including deposit, investment and lending products and regulations, Bank Policies \\& Procedures, legal and ethical requirements, process requirements and established guidelines, to maintain operational integrity.\n* Understand and comply with all regulatory and compliance requirements.\n* Prevent loss due to fraud, counterfeiting, money laundering, or defalcation; identify and support suspicious and other reportable transactions or patterns of activity that are suspected to be related to money laundering.\n* Provide administrative support to the department (couriers, stationary orders, etc)\n* Actively collaborate with other business partners such as Syndications, GRM and branch contacts, to assist RMs in executing sales and referral opportunities, and in acquiring and retaining profitable commercial relationships.\n\n  \n\n\n\n**Job**\\-**Related Experience**\n* Minimum 4 – 6 Years of Job\\-Related Experience\n* Experience in financial services including exposure to lending, commercial banking, portfolio management and business development.\n* High School Diploma plus completion of a Diploma Program (two years of formal education or equivalent).\n* A Bachelor’s Degree in Business/Commerce, MBA or other relevant designation (i.e. accounting designation) would be an asset. Accreditation will be required internally/externally for future mobility.\n* Fundamental knowledge of commercial products (credit and deposits).\n* Basic knowledge of financial statements and analytical skills.\n* Basic knowledge of accounting principles.\n* Basic knowledge of commercial credit (analysis, policies, security analysis and monitoring).\n* Basic knowledge of retail credit analysis, policies, security and legal procedures.\n* Basic knowledge of deposit and cash management products.\n* Basic knowledge of various legal entity structures and contract law.\n* Proficient knowledge in computer programs working with Excel, Word, PowerPoint and Outlook.\n\n  \n\n\n**Equity, Diversity \\& Inclusion at Coast Capital**  \n\n\n\nDon’t meet every single requirement? At Coast Capital, we believe everyone has potential. We are committed to building better, brighter, more inclusive futures for everyone – including our employees. We see the potential in our employees to achieve amazing things and want to invest in your future. If you’re excited about this career opportunity and your experience may not perfectly align with every qualification in this job posting, we still encourage you to apply. You may be just the right candidate for this or other opportunities at Coast Capital.  \n\n\n\nAt Coast Capital, we are committed to equity, diversity and inclusion. We strongly encourage applications from Indigenous Peoples, Black, and racialized persons, persons with disabilities, people of diverse sexual and gender identities and women. We value applicants who have demonstrated a commitment to equity, diversity and inclusion and recognize that diverse perspectives, experiences and expertise benefit of our employees, our members, and our community.  \n\n\n\nCoast Capital is committed to providing an accessible recruitment experience. If you are a candidate with a disability and require accommodation(s) during any stage of the recruitment process, please contact us at accessibility@coastcapitalsavings.com or 778\\-391\\-5836\\. This contact is intended solely for inquiries or feedback related to accessibility barriers, accommodation requests or alternate format requests. We will work with you to ensure your needs are met. You will only receive a response to inquiries related to these topics.  \n\n\nWhy join Coast Capital Savings?\n\n\n* **Purpose is our North Star.** We look at everything through our purpose. It informs the advice we provide our members, the experiences and products we create, and the programs we build to support our employees and communities.\n* **Committed to inclusion and engagement.** We have an ongoing focus on equity, diversity, and inclusion and routinely track how we’re doing, and what we need to do to keep improving. We foster a culture where everyone can feel safe to be who they really are and thrive.\n* **A career that grows with you.** We believe in developing our people and promoting from within. Many employees have spent decades, and sometimes their entire careers, with Coast Capital and have progressed from the frontlines to senior leadership.\n* **Work where you’re most effective.** In 2020 the world changed, and that includes how we work. In response to COVID\\-19 we launched myWork, which gives employees flexibility in where they work based on the nature of their role.\n* **Benefits that flex to the needs of you and your family.** We offer comprehensive, customizable benefits for you and your family, so you can choose what fits best for you and your lifestyle.\n* **Retirement options.** We also take care of our employees once they retire. That’s why we offer the choice of a defined contribution or defined benefit pension plan or RSP’s.\n* **Mortgage and auto financing benefits**. Employees save thousands on their mortgages and auto loans with best\\-in\\-category benefits.\n* **Real Recognition**. We recognize excellence throughout the year, through an online community that lets employees give kudos and thanks throughout the year. We’re human, which means we like to have fun with events, celebrations, and recognition throughout the year.\n* **An award winning culture**. We’re a Platinum member of Canada’s Best Managed Companies and are regularly recognized by Canada’s Most Admired Corporate Cultures and the BC Top Employers Awards.\n* **We reinvest 10% back into the community.** When we do well, our communities do well. That’s why since 2000 we’ve invested over $90 million into our member’s communities.\n* **Double your impact.** Through our employee volunteer program, Coast Capital donates $10 for every hour you volunteer to a Canadian charity or non\\-profit of your choice.",
    "id": "in-3eb0617b1df6f7db",
    "currency": "CAD",
    "site": "indeed",
    "location": "Vancouver, BC, CA",
    "company": "Coast Capital Savings",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=3eb0617b1df6f7db",
    "title": "Associate, Commercial Real Estate",
    "date_posted": "2025-12-30",
    "job_type": "fulltime",
    "max_amount": 90.0,
    "min_amount": 90.0,
    "job_url_direct": "https://careers.coastcapitalsavings.com/job/Vancouver-Associate%2C-Commercial-Real-Estate-Brit-V6E-3C9/1352419000/",
    "company_group": "Coast Capital Savings",
    "company_search_term": "Coast Capital Savings",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": "hybrid",
    "employment_types": [
      "contract",
      "fulltime"
    ],
    "location_city": "Vancouver",
    "location_region": "BC",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:23.389497+00:00",
    "posted_days_ago": null,
    "dedupe_key": "8173ab6da40b93bae68acb6b4ee0fe7bc11bee31"
  },
  {
    "description": "As a member\\-owned cooperative, we’re helping our members with their real goals and real challenges so they can live the real life they want. It’s what we’ve been doing for over 80 years, and it’s why today we stand almost 600,000 members strong. Plus, we invest 10% of our budgeted profits back into our community – almost $90 million since 2000 alone – because when our members do well, we believe our communities should do well too.\n\n\nRegional Manager, Small Business Banking\n\n\nDec 29, 2025\n**Location(s):** Newton Branch\n**Job Type:** Full Time Regular\n**myWork Program:** Hybrid\n**Starting Salary Range:** $108,100\\.00 \\- $146,000\\.00\n**Background Screening Requirement:**\n* Enhanced Criminal Record Check\n* Credit Check\n* Identity Verification\n* Employment Verification\n* References\n\n **What’s the Job?**\n\nReporting to the Director, Small Business Banking , the Regional Manager, Small Business Banking is responsible for effectively managing a small business sales force within the network as well as functionally and operationally executing the development of strategies, objectives and business plans. The Regional Manager has a material impact on CCS’ earnings, operations, image and provides the greatest impact on the function for which they are fully accountable: i) Primary objectives consist of developing business within the geographic region with an emphasis on establishing new relationships ii) Develop the capabilities of direct reports in the area of relationship management, risk and needs based selling iii) Provide strong sales leadership for direct reports iv) Ensure high standards are maintained in the areas of Member Experience; Operational Excellence and credit control/risk mitigation.  \n\n\n**Individual Key Contributions/Responsibilities**\n* Works collaboratively with the Director, Small Business Banking to execute the small business strategies and grow the overall business.\n* Works collaboratively with the Director, other Regional Managers and partners (broader Commercial, Retail and Wealth) to develop and implement action plans that influence positive results through a consistent and collaborative member and staff experience.\n* Creates an environment which fosters exceptional sales and service culture, supports collaborative behaviors while capitalizing on individual’s expertise.\n* Responsible for performance management including performance evaluations, goal setting, career counseling, training, development, recruiting, creating a talent pipeline \\- both internally and externally, promotions, salary recommendations, transfers, ensuring each reporting staff member has an individual business and development plan and is pursuing a Professional Development Plan.\n* Identifies learning and skill building opportunities to strengthen the knowledge, skills and abilities of the Small Business team and works collaboratively with others to develop training materials to address learning opportunities.\n* Demonstrates active and engaged sales coaching to sustain sales growth, effective business practices, and professional behaviors to meet and exceed member expectations and business objectives.\n* Awareness of industry trends outside CCS and potential impact of same. Demonstrates understanding and awareness of the competitive landscape, industry trends, products and activities in the trade area outside CCS and potential impact of same. Applies business and industry understanding to leadership practices by keeping the team up to date and informed.\n* Active involvement in the community to foster the image and reputation of Coast Capital Savings.\n* As required, acts as second in command to the Director, Small Business Banking in the Director’s absence.\n* Effectively manages controllable expenses.\n* Ensures adherence to all regulatory, operational and HR policies and procedures.\n* In partnership with GRM (Credit and AML), broader Commercial and Retail Partners, minimizes risk of loss through disciplined reviews of business activity at the individual portfolio level.\n* Adherence to compliance and security policies and procedures, audit review.\n* Works in partnership with GRM to ensure compliance with the established policies, practices and procedures, developed with and approved by GRM.\n* Ensures each staff member implements enterprise contact management strategy and tracks properly and effectively to ensure sufficient sales and follow up activities are in place for successful achievement of financial goals.\n* Coach staff to source new quality and profitable business with prospects and existing members. Individual performance will be assessed on performance KPI’s.\n* Coach staff to build and deepen existing member relationships by effectively onboarding a member to CCS, demonstrating understanding of the entrepreneur/business by using available tools (i.e. Business Discovery Tool, Money Chat).\n* Coach staff to build and deepen existing member relationships by expanding the business relationship through needs based business products (i.e. business credit cards and merchant services, cash management services, payroll services etc.)\n* Coach staff to build and deepen existing member relationships by making successful referrals to other business units in areas of retail banking, wealth management, equipment finance and commercial insurance.\n\n  \n\n\n**Minimum Job\\-Related Experience**  \n\n\n* Minimum 7 – 9 Years of Job Related Experience\n* Minimum of 8 years successful sales related experience in progressively senior positions within the financial services industry (preferably with small business or commercial experience).\n* Demonstrated skills in leadership and management.\n* A broad knowledge of all aspects of retail and small business banking is needed.\n* The incumbent must be results\\-oriented, flexible and have excellent communication, interpersonal and negotiation skills.\n* Bachelor’s Degree in Business/Commerce (MBA or accounting/finance designation an asset). An equivalent combination of education and experience will be considered.\n* Proficient knowledge in all relevant technology systems including windows\\-based word processing and spreadsheets\n* Proficient knowledge of accounting principles; financial statements and analytical skills\n* Proficient knowledge of commercial credit (analysis, policies, security analysis and monitoring, legal procedures)\n* Advanced ability to determine the feasibility and risk associated with existing loans and new loan proposals by analyzing and interpreting information solicited from other professionals such as appraisers, lawyers, accountants, quantity surveyors.\n* Expert aptitude and ability for marketing and business development.\n* Expert negotiating skills and demonstration of creative thinking with respect to providing business services and problem solving.\n\n  \n\n\n**Equity, Diversity \\& Inclusion at Coast Capital**  \n\n\n\nDon’t meet every single requirement? At Coast Capital, we believe everyone has potential. We are committed to building better, brighter, more inclusive futures for everyone – including our employees. We see the potential in our employees to achieve amazing things and want to invest in your future. If you’re excited about this career opportunity and your experience may not perfectly align with every qualification in this job posting, we still encourage you to apply. You may be just the right candidate for this or other opportunities at Coast Capital.  \n\n\n\nAt Coast Capital, we are committed to equity, diversity and inclusion. We strongly encourage applications from Indigenous Peoples, Black, and racialized persons, persons with disabilities, people of diverse sexual and gender identities and women. We value applicants who have demonstrated a commitment to equity, diversity and inclusion and recognize that diverse perspectives, experiences and expertise benefit of our employees, our members, and our community.  \n\n\n\nCoast Capital is committed to providing an accessible recruitment experience. If you are a candidate with a disability and require accommodation(s) during any stage of the recruitment process, please contact us at accessibility@coastcapitalsavings.com or 778\\-391\\-5836\\. This contact is intended solely for inquiries or feedback related to accessibility barriers, accommodation requests or alternate format requests. We will work with you to ensure your needs are met. You will only receive a response to inquiries related to these topics.  \n\n\nWhy join Coast Capital Savings?\n\n\n* **Purpose is our North Star.** We look at everything through our purpose. It informs the advice we provide our members, the experiences and products we create, and the programs we build to support our employees and communities.\n* **Committed to inclusion and engagement.** We have an ongoing focus on equity, diversity, and inclusion and routinely track how we’re doing, and what we need to do to keep improving. We foster a culture where everyone can feel safe to be who they really are and thrive.\n* **A career that grows with you.** We believe in developing our people and promoting from within. Many employees have spent decades, and sometimes their entire careers, with Coast Capital and have progressed from the frontlines to senior leadership.\n* **Work where you’re most effective.** In 2020 the world changed, and that includes how we work. In response to COVID\\-19 we launched myWork, which gives employees flexibility in where they work based on the nature of their role.\n* **Benefits that flex to the needs of you and your family.** We offer comprehensive, customizable benefits for you and your family, so you can choose what fits best for you and your lifestyle.\n* **Retirement options.** We also take care of our employees once they retire. That’s why we offer the choice of a defined contribution or defined benefit pension plan or RSP’s.\n* **Mortgage and auto financing benefits**. Employees save thousands on their mortgages and auto loans with best\\-in\\-category benefits.\n* **Real Recognition**. We recognize excellence throughout the year, through an online community that lets employees give kudos and thanks throughout the year. We’re human, which means we like to have fun with events, celebrations, and recognition throughout the year.\n* **An award winning culture**. We’re a Platinum member of Canada’s Best Managed Companies and are regularly recognized by Canada’s Most Admired Corporate Cultures and the BC Top Employers Awards.\n* **We reinvest 10% back into the community.** When we do well, our communities do well. That’s why since 2000 we’ve invested over $90 million into our member’s communities.\n* **Double your impact.** Through our employee volunteer program, Coast Capital donates $10 for every hour you volunteer to a Canadian charity or non\\-profit of your choice.",
    "id": "in-fb4aa4602b79793e",
    "currency": "CAD",
    "site": "indeed",
    "location": "Surrey, BC, CA",
    "company": "Coast Capital Savings",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=fb4aa4602b79793e",
    "title": "Regional Manager, Small Business Banking",
    "date_posted": "2025-12-29",
    "job_type": "fulltime",
    "max_amount": 90.0,
    "min_amount": 90.0,
    "job_url_direct": "https://careers.coastcapitalsavings.com/job/Surrey-Regional-Manager%2C-Small-Business-Banking-Brit-V3W-3P4/1352392800/",
    "company_group": "Coast Capital Savings",
    "company_search_term": "Coast Capital Savings",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": "hybrid",
    "employment_types": [
      "fulltime"
    ],
    "location_city": "Surrey",
    "location_region": "BC",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:23.391180+00:00",
    "posted_days_ago": null,
    "dedupe_key": "1e1d5756d28077d803de6bbef8931e6271ab741c"
  },
  {
    "description": "As a member\\-owned cooperative, we’re helping our members with their real goals and real challenges so they can live the real life they want. It’s what we’ve been doing for over 80 years, and it’s why today we stand almost 600,000 members strong. Plus, we invest 10% of our budgeted profits back into our community – almost $90 million since 2000 alone – because when our members do well, we believe our communities should do well too.\n\n\nMember Services Representative \\- Sunshine Hills Branch\n\n\nDec 25, 2025\n**Location(s):** Sunshine Hills Branch\n**Job Type:** Full Time Regular\n**myWork Program:** Office\n**Starting Salary Range:** $45,100\\.00 \\- $49,100\\.00\n**Background Screening Requirement:**\n* Enhanced Criminal Record Check\n* Credit Check\n* Identity Verification\n* Employment Verification\n* References\n\n  \n\n\n**Job Purpose**  \n\n\n\nOn any given shift you will be the face of Coast Capital in the branch and balance a friendly advice and service approach with demonstrated ability to proactively listen and identify opportunities to deepen member relationships. By providing our members with support and financial advice, we help them Build a Better Future, Together.  \n\n\n**Accountabilities**  \n\n\n* Be the first friendly face our members see at Coast Capital by exhibiting our Coast Capital values; We build connection. We act with courage. We re\\-imagine.\n* Build relationships with member and deliver an outstanding member experience by meeting their initial needs and proactively identifying future opportunities through money chats and so much more!\n* Educating members on our alternate channels (online banking and mobile platforms) to deliver a memorable member experience\n* Contribute to team results through listening, spotting opportunities and partnering with other Coast Capital team members to best meet our members financial needs\n* Build a strong understanding of how Coast Capital Savings assists in providing financial well\\-being to our members\n* Create a positive member experience by proactively taking ownership of resolving and preventing member banking issues.\n* Be the first line of defense by being on the lookout for any counterfeit money or illegal transactions that may occur.\n\n  \n\n\n**Skills \\& Qualifications**  \n\n\n\nTo be successful as a Member Service Representative in a Coast Capital branch, you must be positive, team\\-oriented individual with the following knowledge, skills and abilities.  \n\n\n* **Communication** – You have strong verbal English communication skills and are comfortable having sensitive conversations with members.\n* **Active Listening** – You listen to your customer and ensure you identify the challenge they may have so you can work towards a positive outcome.\n* **Empathy** – You understand a bank account is more than numbers on a screen and you can show understanding and respect for whatever situation a member might be in.\n* **Initiative** – You don’t sit and wait for something to do. You see something that needs to be done, and do it.\n* **Problem Solving** – You find job satisfaction by identifying a member problem and work towards solving it with them.\n* **Curiosity** – You are a life\\-long learner who loves to grow their understanding of the financial world.\n* **Advisory** – You are comfortable identifying opportunities and suggesting Coast Capital products to our members by referring them to other specialists within our organization.\n* **Adaptability** – You happily handle whatever situation comes your way.\n* **Motivation** – You are a self\\-motivated, positive and are looking to grow your career in customer service and/or banking.\n* **Integrity** – You follow the documented process and do the right thing, every time. Even when no one is watching.\n* **Legal Eligibility** – You are legally entitled to work for any employer. Please note for those candidates interested in applying for a Canadian Permanent residency, this position falls under a C National Occupation Code (NOC).\n  \n\n**Equity, Diversity \\& Inclusion at Coast Capital**  \n\n\n\nDon’t meet every single requirement? At Coast Capital, we believe everyone has potential. We are committed to building better, brighter, more inclusive futures for everyone – including our employees. We see the potential in our employees to achieve amazing things and want to invest in your future. If you’re excited about this career opportunity and your experience may not perfectly align with every qualification in this job posting, we still encourage you to apply. You may be just the right candidate for this or other opportunities at Coast Capital.  \n\n\n\nAt Coast Capital, we are committed to equity, diversity and inclusion. We strongly encourage applications from Indigenous Peoples, Black, and racialized persons, persons with disabilities, people of diverse sexual and gender identities and women. We value applicants who have demonstrated a commitment to equity, diversity and inclusion and recognize that diverse perspectives, experiences and expertise benefit of our employees, our members, and our community.  \n\n\n\nCoast Capital is committed to providing an accessible recruitment experience. If you are a candidate with a disability and require accommodation(s) during any stage of the recruitment process, please contact us at accessibility@coastcapitalsavings.com or 778\\-391\\-5836\\. This contact is intended solely for inquiries or feedback related to accessibility barriers, accommodation requests or alternate format requests. We will work with you to ensure your needs are met. You will only receive a response to inquiries related to these topics.  \n\n\nWhy join Coast Capital Savings?\n\n\n* **Purpose is our North Star.** We look at everything through our purpose. It informs the advice we provide our members, the experiences and products we create, and the programs we build to support our employees and communities.\n* **Committed to inclusion and engagement.** We have an ongoing focus on equity, diversity, and inclusion and routinely track how we’re doing, and what we need to do to keep improving. We foster a culture where everyone can feel safe to be who they really are and thrive.\n* **A career that grows with you.** We believe in developing our people and promoting from within. Many employees have spent decades, and sometimes their entire careers, with Coast Capital and have progressed from the frontlines to senior leadership.\n* **Work where you’re most effective.** In 2020 the world changed, and that includes how we work. In response to COVID\\-19 we launched myWork, which gives employees flexibility in where they work based on the nature of their role.\n* **Benefits that flex to the needs of you and your family.** We offer comprehensive, customizable benefits for you and your family, so you can choose what fits best for you and your lifestyle.\n* **Retirement options.** We also take care of our employees once they retire. That’s why we offer the choice of a defined contribution or defined benefit pension plan or RSP’s.\n* **Mortgage and auto financing benefits**. Employees save thousands on their mortgages and auto loans with best\\-in\\-category benefits.\n* **Real Recognition**. We recognize excellence throughout the year, through an online community that lets employees give kudos and thanks throughout the year. We’re human, which means we like to have fun with events, celebrations, and recognition throughout the year.\n* **An award winning culture**. We’re a Platinum member of Canada’s Best Managed Companies and are regularly recognized by Canada’s Most Admired Corporate Cultures and the BC Top Employers Awards.\n* **We reinvest 10% back into the community.** When we do well, our communities do well. That’s why since 2000 we’ve invested over $90 million into our member’s communities.\n* **Double your impact.** Through our employee volunteer program, Coast Capital donates $10 for every hour you volunteer to a Canadian charity or non\\-profit of your choice.",
    "id": "in-954d373cdcc295d3",
    "currency": "CAD",
    "site": "indeed",
    "location": "Surrey, BC, CA",
    "company": "Coast Capital Savings",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=954d373cdcc295d3",
    "title": "Member Services Representative",
    "date_posted": "2025-12-25",
    "job_type": "fulltime",
    "max_amount": 90.0,
    "min_amount": 90.0,
    "job_url_direct": "https://careers.coastcapitalsavings.com/job/Surrey-Member-Services-Representative-Sunshine-Hills-Branch-Brit-V3X-3K1/1352089000/",
    "company_group": "Coast Capital Savings",
    "company_search_term": "Coast Capital Savings",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": [
      "fulltime"
    ],
    "location_city": "Surrey",
    "location_region": "BC",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:23.393184+00:00",
    "posted_days_ago": null,
    "dedupe_key": "83b170e177c881134c2ece883b791741da4f50c0"
  },
  {
    "description": "As a member\\-owned cooperative, we’re helping our members with their real goals and real challenges so they can live the real life they want. It’s what we’ve been doing for over 80 years, and it’s why today we stand almost 600,000 members strong. Plus, we invest 10% of our budgeted profits back into our community – almost $90 million since 2000 alone – because when our members do well, we believe our communities should do well too.\n\n\nMobile Mortgage Specialist\n\n\nDec 23, 2025\n**Location(s):** Victoria, Admin \\- Douglas St, Aulds Road Branch, Sooke Branch\n**Job Type:** Full Time Regular\n**myWork Program:** Mobile\n**Background Screening Requirement:**\n* Enhanced Criminal Record Check\n* Credit Check\n* Identity Verification\n* Employment Verification\n* References\n\n **Job Purpose**\n\nAs a Mobile Mortgage Specialist at Coast Capital, you'll work with current and prospective members to help them in their pursuit of home ownership by providing expert mortgage advice. As someone who thrives in an environment that values autonomy and connectivity, you'll appreciate the freedom that comes with setting up your office space at home and stepping out into the community to network and engage.  \n\n\n\nYou'll benefit from a comprehensive commission structure that rewards your initiative across a spectrum of products including mortgages, investments, credit cards, commercial referrals and insurance, crafting a truly dynamic and rewarding career experience. Finally, you're a strong communicator who loves to meet new people and develop meaningful relationships to solve your client's financial needs.  \n\n\n**Accountabilities**\n* Establish and nurture ongoing relationships with prospective clients, providing customized mortgage consultation to address specific needs. Engage proactively with clients, offering support during the mortgage application process and schedule consistent follow\\-ups to guarantee their satisfaction. Coordinate with internal teams to address client inquiries and issues swiftly.\n* Keep abreast of industry regulatory changes and stay well\\-informed. Review mortgage applications to confirm they comply with underwriting standards and regulations. Accurately prepare and maintain records for regulatory audits and educate clients on the regulatory requirements affecting mortgage processes.\n* Offer expert advice on mortgage products, driving sales to surpass established targets. Employ strategic sales initiatives to attract new clients and present mortgage options during appointments. Adopt a consultative sales approach to address client needs effectively.\n* Identify and proactively reach out to potential clients using a variety of channels, including social media, to build a robust lead pipeline. Develop and implement lead sourcing strategies, attend industry events to network and uncover new opportunities, and analyze market trends to identify fresh avenues for lead generation.\n* Join local business and community groups to increase visibility and cultivate connections with prospective clients. Establish partnerships with real estate agents and builders to generate referral opportunities. Use online networking platforms to actively engage with clients and develop referral sources.\n\n  \n\n\n**Skills \\& Qualifications**\n* Bachelor's degree in Finance, Economics, Business Administration, or related field\n* 5\\+ years with strategic sales and networking\n* Extensive knowledge of the real estate and economic market in British Columbia\n* Knowledge of current residential mortgage products and services\n* Ability to analyze financial information and mortgage applications\n* Expertise in mortgage underwriting standards and regulations\n* Competency in using CRM software for client relationship management\n* Familiarity with digital marketing tools for lead generation\n* Proficiency in online networking platforms for community engagement\n* Track record of meeting or exceeding sales targets in the mortgage industry\n* History of successfully building and maintaining client relationships\n* Proven experience in developing personal networks to generate business opportunities\n* Demonstrated ability to innovate and implement successful lead generation strategies\n* Experience in creating and executing strategic sales plans in the financial sector\n* Evidence of strong community involvement with a focus on business development activities\n\n  \n\n\n**Equity, Diversity \\& Inclusion at Coast Capital**  \n\n\n\nDon’t meet every single requirement? At Coast Capital, we believe everyone has potential. We are committed to building better, brighter, more inclusive futures for everyone – including our employees. We see the potential in our employees to achieve amazing things and want to invest in your future. If you’re excited about this career opportunity and your experience may not perfectly align with every qualification in this job posting, we still encourage you to apply. You may be just the right candidate for this or other opportunities at Coast Capital.  \n\n\n\nAt Coast Capital, we are committed to equity, diversity and inclusion. We strongly encourage applications from Indigenous Peoples, Black, and racialized persons, persons with disabilities, people of diverse sexual and gender identities and women. We value applicants who have demonstrated a commitment to equity, diversity and inclusion and recognize that diverse perspectives, experiences and expertise benefit of our employees, our members, and our community.  \n\n\n\nCoast Capital is committed to providing an accessible recruitment experience. If you are a candidate with a disability and require accommodation(s) during any stage of the recruitment process, please contact us at accessibility@coastcapitalsavings.com or 778\\-391\\-5836\\. This contact is intended solely for inquiries or feedback related to accessibility barriers, accommodation requests or alternate format requests. We will work with you to ensure your needs are met. You will only receive a response to inquiries related to these topics.  \n\n\nWhy join Coast Capital Savings?\n\n\n* **Purpose is our North Star.** We look at everything through our purpose. It informs the advice we provide our members, the experiences and products we create, and the programs we build to support our employees and communities.\n* **Committed to inclusion and engagement.** We have an ongoing focus on equity, diversity, and inclusion and routinely track how we’re doing, and what we need to do to keep improving. We foster a culture where everyone can feel safe to be who they really are and thrive.\n* **A career that grows with you.** We believe in developing our people and promoting from within. Many employees have spent decades, and sometimes their entire careers, with Coast Capital and have progressed from the frontlines to senior leadership.\n* **Work where you’re most effective.** In 2020 the world changed, and that includes how we work. In response to COVID\\-19 we launched myWork, which gives employees flexibility in where they work based on the nature of their role.\n* **Benefits that flex to the needs of you and your family.** We offer comprehensive, customizable benefits for you and your family, so you can choose what fits best for you and your lifestyle.\n* **Retirement options.** We also take care of our employees once they retire. That’s why we offer the choice of a defined contribution or defined benefit pension plan or RSP’s.\n* **Mortgage and auto financing benefits**. Employees save thousands on their mortgages and auto loans with best\\-in\\-category benefits.\n* **Real Recognition**. We recognize excellence throughout the year, through an online community that lets employees give kudos and thanks throughout the year. We’re human, which means we like to have fun with events, celebrations, and recognition throughout the year.\n* **An award winning culture**. We’re a Platinum member of Canada’s Best Managed Companies and are regularly recognized by Canada’s Most Admired Corporate Cultures and the BC Top Employers Awards.\n* **We reinvest 10% back into the community.** When we do well, our communities do well. That’s why since 2000 we’ve invested over $90 million into our member’s communities.\n* **Double your impact.** Through our employee volunteer program, Coast Capital donates $10 for every hour you volunteer to a Canadian charity or non\\-profit of your choice.",
    "id": "in-aca10a93ebdd2044",
    "currency": "CAD",
    "site": "indeed",
    "location": "Sooke, BC, CA",
    "company": "Coast Capital Savings",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=aca10a93ebdd2044",
    "title": "Mobile Mortgage Specialist",
    "date_posted": "2025-12-23",
    "job_type": "fulltime",
    "max_amount": 90.0,
    "min_amount": 90.0,
    "job_url_direct": "https://careers.coastcapitalsavings.com/job/Victoria-Mobile-Mortgage-Specialist-Brit-V8W-3M6/1351885500/",
    "company_group": "Coast Capital Savings",
    "company_search_term": "Coast Capital Savings",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": [
      "fulltime"
    ],
    "location_city": "Sooke",
    "location_region": "BC",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:23.397061+00:00",
    "posted_days_ago": null,
    "dedupe_key": "d3887ca71e1274db66329122bce7e98a28e6e711"
  },
  {
    "description": "As a member\\-owned cooperative, we’re helping our members with their real goals and real challenges so they can live the real life they want. It’s what we’ve been doing for over 80 years, and it’s why today we stand almost 600,000 members strong. Plus, we invest 10% of our budgeted profits back into our community – almost $90 million since 2000 alone – because when our members do well, we believe our communities should do well too.\n\n\nMember Services Representative PT \\- Fleetwood Branch (Surrey)\n\n\nDec 23, 2025\n**Location(s):** Fleetwood Branch\n**Job Type:** Part Time Regular\n**myWork Program:** Office\n**Starting Salary Range:** $23\\.13 \\- $25\\.18 hourly\n**Background Screening Requirement:**\n* Enhanced Criminal Record Check\n* Credit Check\n* Identity Verification\n* Employment Verification\n* References\n\n **ob Purpose**  \n\n\n\nOn any given shift you will be the face of Coast Capital in the branch and balance a friendly advice and service approach with demonstrated ability to proactively listen and identify opportunities to deepen member relationships. By providing our members with support and financial advice, we help them Build a Better Future, Together. While this job is posted as a Customer Service Representative, internally, we title it a Member Service Representative, always putting members at the centre of everything we do.  \n\n\n\nThis is a part\\-time position based at the Fleetwood Branch in Surrey, requiring a minimum of 15 hours and up to 30 hours per week. The successful candidate must be available to work on Tuesdays, Fridays and Saturdays.  \n\n\n**Accountabilities**  \n\n\n* Be the first friendly face our members see at Coast Capital by exhibiting our Coast Capital values;\n* We build connection.\n* We act with courage.\n* We re\\-imagine.\n* Build relationships with member and deliver an outstanding member experience by meeting their initial needs and proactively identifying future opportunities through money chats and so much more!\n* Educating members on our alternate channels (online banking and mobile platforms) to deliver a memorable member experience\n* Contribute to team results through listening, spotting opportunities and partnering with other Coast Capital team members to best meet our members financial needs\n* Build a strong understanding of how Coast Capital Savings assists in providing financial well\\-being to our members\n* Create a positive member experience by proactively taking ownership of resolving and preventing member banking issues.\n* Be the first line of defense by being on the lookout for any counterfeit money or illegal transactions that may occur.\n\n  \n\n\n**Skills \\& Qualifications**  \n\n\n\nTo be successful as a Member Service Representative in a Coast Capital branch, you must be positive, team\\-oriented individual with the following knowledge, skills and abilities.\n* **Communication** – You have strong verbal English communication skills and are comfortable having sensitive conversations with members.\n* **Active Listening** – You listen to your customer and ensure you identify the challenge they may have so you can work towards a positive outcome.\n* **Empathy** – You understand a bank account is more than numbers on a screen and you can show understanding and respect for whatever situation a member might be in.\n* **Initiative** – You don’t sit and wait for something to do. You see something that needs to be done, and do it.\n* **Problem Solving** – You find job satisfaction by identifying a member problem and work towards solving it with them.\n* **Curiosity** – You are a life\\-long learner who loves to grow their understanding of the financial world.\n* **Advisory** – You are comfortable identifying opportunities and suggesting Coast Capital products to our members by referring them to other specialists within our organization.\n* **Adaptability** – You happily handle whatever situation comes your way.\n* **Motivation** – You are a self\\-motivated, positive and are looking to grow your career in customer service and/or banking.\n* **Integrity** – You follow the documented process and do the right thing, every time. Even when no one is watching.\n\n  \n\n\n**Equity, Diversity \\& Inclusion at Coast Capital**  \n\n\n\nDon’t meet every single requirement? At Coast Capital, we believe everyone has potential. We are committed to building better, brighter, more inclusive futures for everyone – including our employees. We see the potential in our employees to achieve amazing things and want to invest in your future. If you’re excited about this career opportunity and your experience may not perfectly align with every qualification in this job posting, we still encourage you to apply. You may be just the right candidate for this or other opportunities at Coast Capital.  \n\n\n\nAt Coast Capital, we are committed to equity, diversity and inclusion. We strongly encourage applications from Indigenous Peoples, Black, and racialized persons, persons with disabilities, people of diverse sexual and gender identities and women. We value applicants who have demonstrated a commitment to equity, diversity and inclusion and recognize that diverse perspectives, experiences and expertise benefit of our employees, our members, and our community.  \n\n\n\nCoast Capital is committed to providing an accessible recruitment experience. If you are a candidate with a disability and require accommodation(s) during any stage of the recruitment process, please contact us at accessibility@coastcapitalsavings.com or 778\\-391\\-5836\\. This contact is intended solely for inquiries or feedback related to accessibility barriers, accommodation requests or alternate format requests. We will work with you to ensure your needs are met. You will only receive a response to inquiries related to these topics.  \n\n\nWhy join Coast Capital Savings?\n\n\n* **Purpose is our North Star.** We look at everything through our purpose. It informs the advice we provide our members, the experiences and products we create, and the programs we build to support our employees and communities.\n* **Committed to inclusion and engagement.** We have an ongoing focus on equity, diversity, and inclusion and routinely track how we’re doing, and what we need to do to keep improving. We foster a culture where everyone can feel safe to be who they really are and thrive.\n* **A career that grows with you.** We believe in developing our people and promoting from within. Many employees have spent decades, and sometimes their entire careers, with Coast Capital and have progressed from the frontlines to senior leadership.\n* **Work where you’re most effective.** In 2020 the world changed, and that includes how we work. In response to COVID\\-19 we launched myWork, which gives employees flexibility in where they work based on the nature of their role.\n* **Benefits that flex to the needs of you and your family.** We offer comprehensive, customizable benefits for you and your family, so you can choose what fits best for you and your lifestyle.\n* **Retirement options.** We also take care of our employees once they retire. That’s why we offer the choice of a defined contribution or defined benefit pension plan or RSP’s.\n* **Mortgage and auto financing benefits**. Employees save thousands on their mortgages and auto loans with best\\-in\\-category benefits.\n* **Real Recognition**. We recognize excellence throughout the year, through an online community that lets employees give kudos and thanks throughout the year. We’re human, which means we like to have fun with events, celebrations, and recognition throughout the year.\n* **An award winning culture**. We’re a Platinum member of Canada’s Best Managed Companies and are regularly recognized by Canada’s Most Admired Corporate Cultures and the BC Top Employers Awards.\n* **We reinvest 10% back into the community.** When we do well, our communities do well. That’s why since 2000 we’ve invested over $90 million into our member’s communities.\n* **Double your impact.** Through our employee volunteer program, Coast Capital donates $10 for every hour you volunteer to a Canadian charity or non\\-profit of your choice.",
    "id": "in-c480f9514152bc30",
    "currency": "CAD",
    "site": "indeed",
    "location": "Surrey, BC, CA",
    "company": "Coast Capital Savings",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=c480f9514152bc30",
    "title": "Member Services Representative PT",
    "date_posted": "2025-12-23",
    "job_type": "parttime",
    "max_amount": 90.0,
    "min_amount": 90.0,
    "job_url_direct": "https://careers.coastcapitalsavings.com/job/Surrey-Member-Services-Representative-PT-Fleetwood-Branch-%28Surrey%29-Brit-V3R-4E7/1351974200/",
    "company_group": "Coast Capital Savings",
    "company_search_term": "Coast Capital Savings",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": [
      "parttime"
    ],
    "location_city": "Surrey",
    "location_region": "BC",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:23.395180+00:00",
    "posted_days_ago": null,
    "dedupe_key": "fd4a2cce9334f8e63b2b2b8081ffde7acdbb15a1"
  },
  {
    "description": "As a member\\-owned cooperative, we’re helping our members with their real goals and real challenges so they can live the real life they want. It’s what we’ve been doing for over 80 years, and it’s why today we stand almost 600,000 members strong. Plus, we invest 10% of our budgeted profits back into our community – almost $90 million since 2000 alone – because when our members do well, we believe our communities should do well too.\n\n\nAssistant Manager, Member Services \\- Ocean Park Branch (Surrey)\n\n\nDec 23, 2025\n**Location(s):** Ocean Park Branch\n**Job Type:** Full Time Regular\n**myWork Program:** Office\n**Starting Salary Range:** $72,700\\.00 \\- $90,900\\.00\n**Background Screening Requirement:**\n* Enhanced Criminal Record Check\n* Credit Check\n* Identity Verification\n* Employment Verification\n* References\n\n **What’s the job?**\n\nAre you ready to lead a team of all\\-stars? We’re looking for an outstanding leader to fulfill a diverse role in which change is the norm. As the Assistant Manager, Member Services, you’ll use your many skills to lead a team of Member Service Representatives in providing Coast Capital’s style of simple financial help to our customers.  \n\n\n**What you will do every day**:\n* Work with the Manager, Member Services, to seamlessly coordinate the needs of the branch and achieve the team’s goals.\n* Exceeding your customer’s expectations with their banking needs.\n* Coach your team of Member Service Representatives in developing their sales skills, building effective relationships and embracing our purpose, mission, values, brand and business practices.\n* Celebrate your team’s successes; whether it be achieving a sales target or helping a team member grow their career within Coast Capital.\n* Exemplify our “How can we help you?” brand while achieving sales, growth and profitability across each area of our business.\n* Using your bean\\-counting skills to ensure efficient cash management and to oversee all security related matters in keeping with Coast Capital’s standards.\n* Create a high\\-performing team by selecting, engaging, developing and retaining star performers.\n\n  \n\n\n**Who are we looking for?**\n* We are looking for leaders who understand the importance of “leading from the front” where you bring business strategy to life, shifting the words on a page to an engaging call to action.\n* You’ve proven your success in a similar position leading front\\-line employees for a minimum of four years in a bank or credit union.\n* You take pride that you survived and thrived in completing your diploma or degree in Business Administration, Economics or in a related area\n* You proudly hang your Investment Funds in Canada certificate in your office.\n* Strong ability in resolving member complaints with a smile.\n* You are passionate about coaching employees to success, growing and training individuals and rewarding and recognizing employees.\n* You have strong knowledge in all relevant technology banking systems.\n\n  \n\n\n**Equity, Diversity \\& Inclusion at Coast Capital**  \n\n\n\nDon’t meet every single requirement? At Coast Capital, we believe everyone has potential. We are committed to building better, brighter, more inclusive futures for everyone – including our employees. We see the potential in our employees to achieve amazing things and want to invest in your future. If you’re excited about this career opportunity and your experience may not perfectly align with every qualification in this job posting, we still encourage you to apply. You may be just the right candidate for this or other opportunities at Coast Capital.  \n\n\n\nAt Coast Capital, we are committed to equity, diversity and inclusion. We strongly encourage applications from Indigenous Peoples, Black, and racialized persons, persons with disabilities, people of diverse sexual and gender identities and women. We value applicants who have demonstrated a commitment to equity, diversity and inclusion and recognize that diverse perspectives, experiences and expertise benefit of our employees, our members, and our community.  \n\n\n\nCoast Capital is committed to providing an accessible recruitment experience. If you are a candidate with a disability and require accommodation(s) during any stage of the recruitment process, please contact us at accessibility@coastcapitalsavings.com or 778\\-391\\-5836\\. This contact is intended solely for inquiries or feedback related to accessibility barriers, accommodation requests or alternate format requests. We will work with you to ensure your needs are met. You will only receive a response to inquiries related to these topics.  \n\n\nWhy join Coast Capital Savings?\n\n\n* **Purpose is our North Star.** We look at everything through our purpose. It informs the advice we provide our members, the experiences and products we create, and the programs we build to support our employees and communities.\n* **Committed to inclusion and engagement.** We have an ongoing focus on equity, diversity, and inclusion and routinely track how we’re doing, and what we need to do to keep improving. We foster a culture where everyone can feel safe to be who they really are and thrive.\n* **A career that grows with you.** We believe in developing our people and promoting from within. Many employees have spent decades, and sometimes their entire careers, with Coast Capital and have progressed from the frontlines to senior leadership.\n* **Work where you’re most effective.** In 2020 the world changed, and that includes how we work. In response to COVID\\-19 we launched myWork, which gives employees flexibility in where they work based on the nature of their role.\n* **Benefits that flex to the needs of you and your family.** We offer comprehensive, customizable benefits for you and your family, so you can choose what fits best for you and your lifestyle.\n* **Retirement options.** We also take care of our employees once they retire. That’s why we offer the choice of a defined contribution or defined benefit pension plan or RSP’s.\n* **Mortgage and auto financing benefits**. Employees save thousands on their mortgages and auto loans with best\\-in\\-category benefits.\n* **Real Recognition**. We recognize excellence throughout the year, through an online community that lets employees give kudos and thanks throughout the year. We’re human, which means we like to have fun with events, celebrations, and recognition throughout the year.\n* **An award winning culture**. We’re a Platinum member of Canada’s Best Managed Companies and are regularly recognized by Canada’s Most Admired Corporate Cultures and the BC Top Employers Awards.\n* **We reinvest 10% back into the community.** When we do well, our communities do well. That’s why since 2000 we’ve invested over $90 million into our member’s communities.\n* **Double your impact.** Through our employee volunteer program, Coast Capital donates $10 for every hour you volunteer to a Canadian charity or non\\-profit of your choice.",
    "id": "in-cc95f0275f635fc1",
    "currency": "CAD",
    "site": "indeed",
    "location": "Surrey, BC, CA",
    "company": "Coast Capital Savings",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=cc95f0275f635fc1",
    "title": "Assistant Manager, Member Services",
    "date_posted": "2025-12-23",
    "job_type": "fulltime",
    "max_amount": 90.0,
    "min_amount": 90.0,
    "job_url_direct": "https://careers.coastcapitalsavings.com/job/Surrey-Assistant-Manager%2C-Member-Services-Ocean-Park-Branch-%28Surrey%29-Brit-V4A-1N7/1351703600/",
    "company_group": "Coast Capital Savings",
    "company_search_term": "Coast Capital Savings",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": [
      "fulltime"
    ],
    "location_city": "Surrey",
    "location_region": "BC",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:23.398677+00:00",
    "posted_days_ago": null,
    "dedupe_key": "237bde8d8748c629d6382b87a90d5733943a7eaa"
  },
  {
    "description": "As a member\\-owned cooperative, we’re helping our members with their real goals and real challenges so they can live the real life they want. It’s what we’ve been doing for over 80 years, and it’s why today we stand almost 600,000 members strong. Plus, we invest 10% of our budgeted profits back into our community – almost $90 million since 2000 alone – because when our members do well, we believe our communities should do well too.\n\n\nRelationship Manager \\- North Vancouver\n\n\nDec 19, 2025\n**Location(s):** North Vancouver Branch\n**Job Type:** Full Time Regular\n**myWork Program:** Office\n**Starting Salary Range:** $64,700\\.00 \\- $77,600\\.00\n**Background Screening Requirement:**\n* Enhanced Criminal Record Check\n* Credit Check\n* Identity Verification\n* Employment Verification\n* References\n\n **Job Purpose**\n\nAt most Financial Institutions this position is normally called a Senior Financial Advisor, but at Coast Capital Savings, we call this role a Relationship Manager. From identifying lending/credit and investments opportunities, to day\\-to\\-day banking needs for our members, the Relationship Manager is a Coast Capital ambassador in our branches, putting members first and finding solutions to their unique financial needs. Through championing Coast Capital’s values and purpose, the Relationship Manager will support new member acquisition while deepening relationships with existing members through providing trusted advice. Join a leader in the financial services that provides simple financial help with our innovative products and services.  \n\n\n**Accountabilities**\n* Get to know your members on a deeper level by asking the right questions so you can deliver a positive and unexpected customer experience.\n* Use your banking expertise to match your customer’s needs with our high\\-quality core banking, lending, and investment options.\n* Collaborate with other teams in the branch to uncover and refer general insurance, complex investment needs, personal insurance, and small business needs.\n* Engage your customers in the “Where You’re at Money Chat” and maximize every opportunity to help customers manage, save, grow, and protect their financial well\\-being.\n* Help Coast change the way Canadians feel about banking, forever.\n\n  \n\n\n**Skills \\& Qualifications**\n* Experience helping customers in either a bank or a credit union for a minimum five years.\n* Must hold a CFSA designation or be willing to obtain it within 18 months of their start date. Alternatively, recognized accreditations such as PFP, CFP, or QAFP may satisfy this requirement (Financial support for CFSA certification may be available).\n* Post\\-secondary education in finance, business administration or a related field.\n* Investment Funds in Canada is a requirement.\n* Solid understanding of day\\-to\\-day banking, complex investment, and lending products.\n* You are a sales pro and have an x\\-ray vision to spot sales and referral opportunities.\n* You like to build relationships with a wide variety of people and want to help them with simple financial needs.\n* You are a multi\\-tasker, able to prioritize and organize what needs to get done coupled with a high attention to detail.\n\n  \n\n\n**Equity, Diversity \\& Inclusion at Coast Capital**  \n\n\n\nDon’t meet every single requirement? At Coast Capital, we believe everyone has potential. We are committed to building better, brighter, more inclusive futures for everyone – including our employees. We see the potential in our employees to achieve amazing things and want to invest in your future. If you’re excited about this career opportunity and your experience may not perfectly align with every qualification in this job posting, we still encourage you to apply. You may be just the right candidate for this or other opportunities at Coast Capital.  \n\n\n\nAt Coast Capital, we are committed to equity, diversity and inclusion. We strongly encourage applications from Indigenous Peoples, Black, and racialized persons, persons with disabilities, people of diverse sexual and gender identities and women. We value applicants who have demonstrated a commitment to equity, diversity and inclusion and recognize that diverse perspectives, experiences and expertise benefit of our employees, our members, and our community.  \n\n\n\nCoast Capital is committed to providing an accessible recruitment experience. If you are a candidate with a disability and require accommodation(s) during any stage of the recruitment process, please contact us at accessibility@coastcapitalsavings.com or 778\\-391\\-5836\\. This contact is intended solely for inquiries or feedback related to accessibility barriers, accommodation requests or alternate format requests. We will work with you to ensure your needs are met. You will only receive a response to inquiries related to these topics.  \n\n\nWhy join Coast Capital Savings?\n\n\n* **Purpose is our North Star.** We look at everything through our purpose. It informs the advice we provide our members, the experiences and products we create, and the programs we build to support our employees and communities.\n* **Committed to inclusion and engagement.** We have an ongoing focus on equity, diversity, and inclusion and routinely track how we’re doing, and what we need to do to keep improving. We foster a culture where everyone can feel safe to be who they really are and thrive.\n* **A career that grows with you.** We believe in developing our people and promoting from within. Many employees have spent decades, and sometimes their entire careers, with Coast Capital and have progressed from the frontlines to senior leadership.\n* **Work where you’re most effective.** In 2020 the world changed, and that includes how we work. In response to COVID\\-19 we launched myWork, which gives employees flexibility in where they work based on the nature of their role.\n* **Benefits that flex to the needs of you and your family.** We offer comprehensive, customizable benefits for you and your family, so you can choose what fits best for you and your lifestyle.\n* **Retirement options.** We also take care of our employees once they retire. That’s why we offer the choice of a defined contribution or defined benefit pension plan or RSP’s.\n* **Mortgage and auto financing benefits**. Employees save thousands on their mortgages and auto loans with best\\-in\\-category benefits.\n* **Real Recognition**. We recognize excellence throughout the year, through an online community that lets employees give kudos and thanks throughout the year. We’re human, which means we like to have fun with events, celebrations, and recognition throughout the year.\n* **An award winning culture**. We’re a Platinum member of Canada’s Best Managed Companies and are regularly recognized by Canada’s Most Admired Corporate Cultures and the BC Top Employers Awards.\n* **We reinvest 10% back into the community.** When we do well, our communities do well. That’s why since 2000 we’ve invested over $90 million into our member’s communities.\n* **Double your impact.** Through our employee volunteer program, Coast Capital donates $10 for every hour you volunteer to a Canadian charity or non\\-profit of your choice.",
    "id": "in-e96d5d1bb08664c0",
    "currency": "CAD",
    "site": "indeed",
    "location": "Vancouver, BC, CA",
    "company": "Coast Capital Savings",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=e96d5d1bb08664c0",
    "title": "Relationship Manager",
    "date_posted": "2025-12-19",
    "job_type": "fulltime",
    "max_amount": 90.0,
    "min_amount": 90.0,
    "job_url_direct": "https://careers.coastcapitalsavings.com/job/North-Vancouver-Relationship-Manager-North-Vancouver-Brit-V9A-6X5/1351324000/",
    "company_group": "Coast Capital Savings",
    "company_search_term": "Coast Capital Savings",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": [
      "fulltime"
    ],
    "location_city": "Vancouver",
    "location_region": "BC",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:23.400373+00:00",
    "posted_days_ago": null,
    "dedupe_key": "9aadf908833b441cc9d83501590521b0183832ac"
  },
  {
    "description": "As a member\\-owned cooperative, we’re helping our members with their real goals and real challenges so they can live the real life they want. It’s what we’ve been doing for over 80 years, and it’s why today we stand almost 600,000 members strong. Plus, we invest 10% of our budgeted profits back into our community – almost $90 million since 2000 alone – because when our members do well, we believe our communities should do well too.\n\n\nMember Advice Specialist \\- Brookswood Branch (Langley)\n\n\nDec 12, 2025\n**Location(s):** Brookswood Branch\n**Job Type:** Full Time Regular\n**myWork Program:** Office\n**Starting Salary Range:** $55,600\\.00 \\- $66,700\\.00\n**Background Screening Requirement:**\n* Enhanced Criminal Record Check\n* Credit Check\n* Identity Verification\n* Employment Verification\n* References\n\n  \n\n\n**Job Purpose**  \n\n\nWhen you visit a Coast branch, you’re greeted with a line of smiling faces ready to help you with your everyday banking needs. Our friendly Member Advice Specialists are sales and customer service superstars who bring our “How can we help you?” brand to life with every member they interact with. Imagine helping our members with Fulfilling basic personal credit needs, selling and handling Low Fee More for Me Mutual Funds, Term deposits, RRSPs, Setting up electronic services like our internet banking, opening free Chequing accounts, adding overdraft protection to help avoid those nasty NSF charges. But it doesn’t end there, Member Advice Specialists do two other very importing things. First, they are sales pros. They uncover opportunities where we can better help our members with our fantastic line\\-up of products and services. Next, they figure out who in the company can best help that member, be it themselves or another teammate.  \n\n\n**Accountabilities**  \n\n\n* Getting a natural high from delivering positive and unexpected customer experience through general retail banking\n* Having fun engaging customers in the “Where You Are At Money Chat” to help your customer to save, grow, protect and improve their financial well\\-being\n* Working as a high\\-performing team member within the branch to ensure all checks and balances are completed around policies and regulatory requirements\n* Proactively and creatively offer helpful solutions and alternatives to customer inquiries\n* Earning high\\-fives from your managers and peers for achieving sales and referrals targets in a needs based sales environment\n\n  \n\n\n**Skills \\& Qualifications**  \n\n\n* We don’t need mathematical geniuses here, though ability to add and subtract would be useful. Mostly we just need people who are comfortable helping customers with simple financial help and promoting our products and services.\n* Experience helping members in either a bank or credit union for a minimum three years, preferably where you mastered lending and investments, and you used your x\\-ray vision to spot sales and referral opportunities.\n* You are excited to share with the world what you learned during your post\\-secondary education in finance, business administration or a related field. And you aren’t done learning; you have a desire to know more.\n* **Certificate in Investment Funds in Canada is a requirement.**\n* You really like building relationships with a wide variety of people and want to help them with simple financial help.\n* You are a big fan of teamwork and demonstrate your team spirit every day.\n* You are a multi\\-tasking prodigy, able to efficiently and effectively prioritize and organize what needs to get done coupled with a high attention to detail\n  \n\n\n  \n\n**Equity, Diversity \\& Inclusion at Coast Capital**  \n\n\n\nDon’t meet every single requirement? At Coast Capital, we believe everyone has potential. We are committed to building better, brighter, more inclusive futures for everyone – including our employees. We see the potential in our employees to achieve amazing things and want to invest in your future. If you’re excited about this career opportunity and your experience may not perfectly align with every qualification in this job posting, we still encourage you to apply. You may be just the right candidate for this or other opportunities at Coast Capital.  \n\n\n\nAt Coast Capital, we are committed to equity, diversity and inclusion. We strongly encourage applications from Indigenous Peoples, Black, and racialized persons, persons with disabilities, people of diverse sexual and gender identities and women. We value applicants who have demonstrated a commitment to equity, diversity and inclusion and recognize that diverse perspectives, experiences and expertise benefit of our employees, our members, and our community.  \n\n\n\nCoast Capital is committed to providing an accessible recruitment experience. If you are a candidate with a disability and require accommodation(s) during any stage of the recruitment process, please contact us at accessibility@coastcapitalsavings.com or 778\\-391\\-5836\\. This contact is intended solely for inquiries or feedback related to accessibility barriers, accommodation requests or alternate format requests. We will work with you to ensure your needs are met. You will only receive a response to inquiries related to these topics.  \n\n\nWhy join Coast Capital Savings?\n\n\n* **Purpose is our North Star.** We look at everything through our purpose. It informs the advice we provide our members, the experiences and products we create, and the programs we build to support our employees and communities.\n* **Committed to inclusion and engagement.** We have an ongoing focus on equity, diversity, and inclusion and routinely track how we’re doing, and what we need to do to keep improving. We foster a culture where everyone can feel safe to be who they really are and thrive.\n* **A career that grows with you.** We believe in developing our people and promoting from within. Many employees have spent decades, and sometimes their entire careers, with Coast Capital and have progressed from the frontlines to senior leadership.\n* **Work where you’re most effective.** In 2020 the world changed, and that includes how we work. In response to COVID\\-19 we launched myWork, which gives employees flexibility in where they work based on the nature of their role.\n* **Benefits that flex to the needs of you and your family.** We offer comprehensive, customizable benefits for you and your family, so you can choose what fits best for you and your lifestyle.\n* **Retirement options.** We also take care of our employees once they retire. That’s why we offer the choice of a defined contribution or defined benefit pension plan or RSP’s.\n* **Mortgage and auto financing benefits**. Employees save thousands on their mortgages and auto loans with best\\-in\\-category benefits.\n* **Real Recognition**. We recognize excellence throughout the year, through an online community that lets employees give kudos and thanks throughout the year. We’re human, which means we like to have fun with events, celebrations, and recognition throughout the year.\n* **An award winning culture**. We’re a Platinum member of Canada’s Best Managed Companies and are regularly recognized by Canada’s Most Admired Corporate Cultures and the BC Top Employers Awards.\n* **We reinvest 10% back into the community.** When we do well, our communities do well. That’s why since 2000 we’ve invested over $90 million into our member’s communities.\n* **Double your impact.** Through our employee volunteer program, Coast Capital donates $10 for every hour you volunteer to a Canadian charity or non\\-profit of your choice.",
    "id": "in-d06298555f6b60c6",
    "currency": "CAD",
    "site": "indeed",
    "location": "Langley, BC, CA",
    "company": "Coast Capital Savings",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=d06298555f6b60c6",
    "title": "Member Advice Specialist",
    "date_posted": "2025-12-11",
    "job_type": "fulltime",
    "max_amount": 90.0,
    "min_amount": 90.0,
    "job_url_direct": "https://careers.coastcapitalsavings.com/job/Langley-Member-Advice-Specialist-Brookswood-Branch-%28Langley%29-Brit-V3A-1K8/1349326700/",
    "company_group": "Coast Capital Savings",
    "company_search_term": "Coast Capital Savings",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": [
      "fulltime"
    ],
    "location_city": "Langley",
    "location_region": "BC",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:23.402110+00:00",
    "posted_days_ago": null,
    "dedupe_key": "1f2ea70bfeffca5e67b9ccf534bb1efa5bcb7cd3"
  },
  {
    "description": "As a member\\-owned cooperative, we’re helping our members with their real goals and real challenges so they can live the real life they want. It’s what we’ve been doing for over 80 years, and it’s why today we stand almost 600,000 members strong. Plus, we invest 10% of our budgeted profits back into our community – almost $90 million since 2000 alone – because when our members do well, we believe our communities should do well too.\n\n\nSenior Data Management Analyst\n\n\nJan 9, 2026\n**Location(s):** Greater Vancouver Area; Greater Toronto Area\n**Job Type:** Full Time Regular\n**myWork Program:** Hybrid\n**Starting Salary Range:** $95,900\\.00 \\- $124,700\\.00\n**Background Screening Requirement:**\n* Enhanced Criminal Record Check\n* Credit Check\n* Identity Verification\n* Employment Verification\n* References\n\n  \n\n\n**Role Purpose**  \n\n\n\nThe Senior Data Management Analyst bridges business and technical teams, enabling trusted, governed data for analytics and regulatory reporting. You will partner with Data Engineering, Data Governance, and business stakeholders to analyze processes, capture requirements, and deliver knowledge artifacts that support our cloud\\-first data strategy on AWS. This role defines and maintains standards for documentation, data dictionaries, and lineage, and mentors other analysts in best practices. You will help ensure all solutions meet Coast Capital’s security, privacy, and regulatory expectations.  \n\n\n**Accountabilities**  \n\n\nBusiness Analysis \\& Requirements\n\n* Engage stakeholders to understand business needs, regulatory drivers, and analytics requirements.\n* Translate business process flows into clear, actionable requirements for data engineering and modeling.\n* Capture and document requirements, technical specifications, and business rules using standardized templates.\n* Curate robust knowledge repository to ensure all data products and processes are well documented.\nData Management \\& Governance\n\n* Define and maintain data dictionaries, mapping documents, and lineage artifacts using Informatica Cloud Data Governance \\& Catalog.\n* Establish and promote standards for documentation and metadata management.\n* Support data stewardship and quality initiatives, ensuring compliance with all regulatory bodies.\nTechnical Enablement\n\n* Analyze and profile data using SQL and Informatica IDMC tools.\n* Collaborate with Data Engineering to design and validate ETL/ELT pipelines on AWS and Informatica.\n* Support the implementation of data quality rules and monitoring using Informatica Cloud Data Quality.\nReporting \\& Analytics Support\n\n* Partner with business teams to deliver knowledge artifacts that enable self\\-serve analytics and regulatory reporting.\n* Support the development and maintenance of dashboards and reports using Tableau.\nLeadership \\& Collaboration\n\n* Mentor and guide other analysts on standards, templates, and best practices.\n* Foster a culture of continuous improvement, collaboration, and knowledge sharing across teams.\n* Use JIRA to manage work items, groom requirements, and track bug fixes, ensuring transparency and timely delivery across multiple workstreams.\n\n  \n\n\n**Skills \\& Qualifications**  \n\n\n\n* 7\\+ years in data management, business analysis, or data warehousing roles, ideally in financial services or regulated environments.\n* Experience with AWS cloud data management and analytics toolsets.\n* Hands\\-on experience with Informatica IDMC (Cloud Data Integration \\- IICS, Data Quality, Data Governance \\& Catalog) preferred.\n* Strong SQL skills for data profiling and analysis.\n* Experience with data engineering, ETL/ELT pipeline design, and data visualization tools (Tableau, Power BI, QlikView).\nMinimum Formal Education\n\n* Bachelor’s degree or diploma (3–4 years) in Computer Science, Engineering, Information Technology, or related field.\nTechnical Skills\n\n* Understanding of data warehouse design methodologies.\n* Experience establishing documentation standards and templates.\n* Familiarity with wiki\\-style knowledge repositories (e.g., Confluence).\n* Experience with diagramming tools (e.g., Lucidchart, Visio).\n* Experience using JIRA for backlog management, requirement grooming, and tracking issues/bug fixes.\nNon\\-Technical Skills\n\n* Excellent interpersonal and communication skills.\n* Ability to manage and prioritize workload across multiple workstreams with minimal supervision.\n* Strong analytical and problem\\-solving skills.\n* Willingness to learn new tools, technologies, and methodologies.\n* Ability to work effectively across technical teams and business functions.\n  \n\n\n**Equity, Diversity \\& Inclusion at Coast Capital**  \n\n\n\nDon’t meet every single requirement? At Coast Capital, we believe everyone has potential. We are committed to building better, brighter, more inclusive futures for everyone – including our employees. We see the potential in our employees to achieve amazing things and want to invest in your future. If you’re excited about this career opportunity and your experience may not perfectly align with every qualification in this job posting, we still encourage you to apply. You may be just the right candidate for this or other opportunities at Coast Capital.  \n\n\n\nAt Coast Capital, we are committed to equity, diversity and inclusion. We strongly encourage applications from Indigenous Peoples, Black, and racialized persons, persons with disabilities, people of diverse sexual and gender identities and women. We value applicants who have demonstrated a commitment to equity, diversity and inclusion and recognize that diverse perspectives, experiences and expertise benefit of our employees, our members, and our community.  \n\n\n\nCoast Capital is committed to providing an accessible recruitment experience. If you are a candidate with a disability and require accommodation(s) during any stage of the recruitment process, please contact us at accessibility@coastcapitalsavings.com or 778\\-391\\-5836\\. This contact is intended solely for inquiries or feedback related to accessibility barriers, accommodation requests or alternate format requests. We will work with you to ensure your needs are met. You will only receive a response to inquiries related to these topics.  \n\n\nWhy join Coast Capital Savings?\n\n\n* **Purpose is our North Star.** We look at everything through our purpose. It informs the advice we provide our members, the experiences and products we create, and the programs we build to support our employees and communities.\n* **Committed to inclusion and engagement.** We have an ongoing focus on equity, diversity, and inclusion and routinely track how we’re doing, and what we need to do to keep improving. We foster a culture where everyone can feel safe to be who they really are and thrive.\n* **A career that grows with you.** We believe in developing our people and promoting from within. Many employees have spent decades, and sometimes their entire careers, with Coast Capital and have progressed from the frontlines to senior leadership.\n* **Work where you’re most effective.** In 2020 the world changed, and that includes how we work. In response to COVID\\-19 we launched myWork, which gives employees flexibility in where they work based on the nature of their role.\n* **Benefits that flex to the needs of you and your family.** We offer comprehensive, customizable benefits for you and your family, so you can choose what fits best for you and your lifestyle.\n* **Retirement options.** We also take care of our employees once they retire. That’s why we offer the choice of a defined contribution or defined benefit pension plan or RSP’s.\n* **Mortgage and auto financing benefits**. Employees save thousands on their mortgages and auto loans with best\\-in\\-category benefits.\n* **Real Recognition**. We recognize excellence throughout the year, through an online community that lets employees give kudos and thanks throughout the year. We’re human, which means we like to have fun with events, celebrations, and recognition throughout the year.\n* **An award winning culture**. We’re a Platinum member of Canada’s Best Managed Companies and are regularly recognized by Canada’s Most Admired Corporate Cultures and the BC Top Employers Awards.\n* **We reinvest 10% back into the community.** When we do well, our communities do well. That’s why since 2000 we’ve invested over $90 million into our member’s communities.\n* **Double your impact.** Through our employee volunteer program, Coast Capital donates $10 for every hour you volunteer to a Canadian charity or non\\-profit of your choice.",
    "id": "in-fa9e7395b7976fd5",
    "currency": "CAD",
    "site": "indeed",
    "location": "Surrey, BC, CA",
    "company": "Coast Capital Savings",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=fa9e7395b7976fd5",
    "title": "Senior Data Management Analyst",
    "date_posted": "2025-12-10",
    "job_type": "fulltime",
    "max_amount": 90.0,
    "min_amount": 90.0,
    "job_url_direct": "https://careers.coastcapitalsavings.com/job/Surrey-Senior-Data-Management-Analyst-Brit-V3T-0K7/1348995700/",
    "company_group": "Coast Capital Savings",
    "company_search_term": "Coast Capital Savings",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": "hybrid",
    "employment_types": [
      "fulltime"
    ],
    "location_city": "Surrey",
    "location_region": "BC",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:23.403468+00:00",
    "posted_days_ago": null,
    "dedupe_key": "4c4af3f1757b1245612e5357dde9b472a439e3ad"
  },
  {
    "description": "As a member\\-owned cooperative, we’re helping our members with their real goals and real challenges so they can live the real life they want. It’s what we’ve been doing for over 80 years, and it’s why today we stand almost 600,000 members strong. Plus, we invest 10% of our budgeted profits back into our community – almost $90 million since 2000 alone – because when our members do well, we believe our communities should do well too.\n\n\nFinancial Advisor \\- North Vancouver\n\n\nJan 8, 2026\n**Location(s):** North Vancouver Branch\n**Job Type:** Full Time Regular\n**myWork Program:** Office\n**Starting Salary Range:** $55,600\\.00 \\- $66,700\\.00\n**Background Screening Requirement:**\n* Enhanced Criminal Record Check\n* Credit Check\n* Identity Verification\n* Employment Verification\n* References\n\n **Job Purpose**  \n\n\nWhen you visit a Coast branch, you’re greeted with a line of smiling faces ready to help you with your everyday banking needs. Our friendly Financial Advisors (Internally called Member Advice Specialists) are sales and customer service superstars who bring our “How can we help you?” brand to life with every member they interact with. Imagine helping our members with Fulfilling basic personal credit needs, selling and handling Low Fee More for Me Mutual Funds, Term deposits, RRSPs, Setting up electronic services like our internet banking, opening free Chequing accounts, adding overdraft protection to help avoid those nasty NSF charges. But it doesn’t end there, Member Advice Specialists do two other very importing things. First, they are sales pros. They uncover opportunities where we can better help our members with our fantastic line\\-up of products and services. Next, they figure out who in the company can best help that member, be it themselves or another teammate.  \n\n\n**Accountabilities**  \n\n\n* Getting a natural high from delivering positive and unexpected customer experience through general retail banking\n* Having fun engaging customers in the “Where You Are At Money Chat” to help your customer to save, grow, protect and improve their financial well\\-being\n* Working as a high\\-performing team member within the branch to ensure all checks and balances are completed around policies and regulatory requirements\n* Proactively and creatively offer helpful solutions and alternatives to customer inquiries\n* Earning high\\-fives from your managers and peers for achieving sales and referrals targets in a needs based sales environment\n\n  \n\n\n**Skills \\& Qualifications**  \n\n\n* We don’t need mathematical geniuses here, though ability to add and subtract would be useful. Mostly we just need people who are comfortable helping customers with simple financial help and promoting our products and services.\n* Experience helping members in either a bank or credit union for a minimum three years, preferably where you mastered lending and investments, and you used your x\\-ray vision to spot sales and referral opportunities.\n* You are excited to share with the world what you learned during your post\\-secondary education in finance, business administration or a related field. And you aren’t done learning; you have a desire to know more.\n* **Certificate in Investment Funds in Canada is a requirement.**\n* You really like building relationships with a wide variety of people and want to help them with simple financial help.\n* You are a big fan of teamwork and demonstrate your team spirit every day.\n* You are a multi\\-tasking prodigy, able to efficiently and effectively prioritize and organize what needs to get done coupled with a high attention to detail\n\n  \n\n\n**Equity, Diversity \\& Inclusion at Coast Capital**  \n\n\n\nDon’t meet every single requirement? At Coast Capital, we believe everyone has potential. We are committed to building better, brighter, more inclusive futures for everyone – including our employees. We see the potential in our employees to achieve amazing things and want to invest in your future. If you’re excited about this career opportunity and your experience may not perfectly align with every qualification in this job posting, we still encourage you to apply. You may be just the right candidate for this or other opportunities at Coast Capital.  \n\n\n\nAt Coast Capital, we are committed to equity, diversity and inclusion. We strongly encourage applications from Indigenous Peoples, Black, and racialized persons, persons with disabilities, people of diverse sexual and gender identities and women. We value applicants who have demonstrated a commitment to equity, diversity and inclusion and recognize that diverse perspectives, experiences and expertise benefit of our employees, our members, and our community.  \n\n\n\nCoast Capital is committed to providing an accessible recruitment experience. If you are a candidate with a disability and require accommodation(s) during any stage of the recruitment process, please contact us at accessibility@coastcapitalsavings.com or 778\\-391\\-5836\\. This contact is intended solely for inquiries or feedback related to accessibility barriers, accommodation requests or alternate format requests. We will work with you to ensure your needs are met. You will only receive a response to inquiries related to these topics.  \n\n\nWhy join Coast Capital Savings?\n\n\n* **Purpose is our North Star.** We look at everything through our purpose. It informs the advice we provide our members, the experiences and products we create, and the programs we build to support our employees and communities.\n* **Committed to inclusion and engagement.** We have an ongoing focus on equity, diversity, and inclusion and routinely track how we’re doing, and what we need to do to keep improving. We foster a culture where everyone can feel safe to be who they really are and thrive.\n* **A career that grows with you.** We believe in developing our people and promoting from within. Many employees have spent decades, and sometimes their entire careers, with Coast Capital and have progressed from the frontlines to senior leadership.\n* **Work where you’re most effective.** In 2020 the world changed, and that includes how we work. In response to COVID\\-19 we launched myWork, which gives employees flexibility in where they work based on the nature of their role.\n* **Benefits that flex to the needs of you and your family.** We offer comprehensive, customizable benefits for you and your family, so you can choose what fits best for you and your lifestyle.\n* **Retirement options.** We also take care of our employees once they retire. That’s why we offer the choice of a defined contribution or defined benefit pension plan or RSP’s.\n* **Mortgage and auto financing benefits**. Employees save thousands on their mortgages and auto loans with best\\-in\\-category benefits.\n* **Real Recognition**. We recognize excellence throughout the year, through an online community that lets employees give kudos and thanks throughout the year. We’re human, which means we like to have fun with events, celebrations, and recognition throughout the year.\n* **An award winning culture**. We’re a Platinum member of Canada’s Best Managed Companies and are regularly recognized by Canada’s Most Admired Corporate Cultures and the BC Top Employers Awards.\n* **We reinvest 10% back into the community.** When we do well, our communities do well. That’s why since 2000 we’ve invested over $90 million into our member’s communities.\n* **Double your impact.** Through our employee volunteer program, Coast Capital donates $10 for every hour you volunteer to a Canadian charity or non\\-profit of your choice.",
    "id": "in-2908c63075720149",
    "currency": "CAD",
    "site": "indeed",
    "location": "Vancouver, BC, CA",
    "company": "Coast Capital Savings",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=2908c63075720149",
    "title": "Financial Advisor",
    "date_posted": "2025-12-10",
    "job_type": "fulltime",
    "max_amount": 90.0,
    "min_amount": 90.0,
    "job_url_direct": "https://careers.coastcapitalsavings.com/job/North-Vancouver-Financial-Advisor-North-Vancouver-Brit-V9A-6X5/1348899500/",
    "company_group": "Coast Capital Savings",
    "company_search_term": "Coast Capital Savings",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": [
      "fulltime"
    ],
    "location_city": "Vancouver",
    "location_region": "BC",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:23.405203+00:00",
    "posted_days_ago": null,
    "dedupe_key": "95dc4249e00cbc6cfda5539de768d3222a77e55c"
  },
  {
    "description": "As a member\\-owned cooperative, we’re helping our members with their real goals and real challenges so they can live the real life they want. It’s what we’ve been doing for over 80 years, and it’s why today we stand almost 600,000 members strong. Plus, we invest 10% of our budgeted profits back into our community – almost $90 million since 2000 alone – because when our members do well, we believe our communities should do well too.\n\n\nRelationship Manager \\- Sunshine Hills Branch\n\n\nJan 7, 2026\n**Location(s):** Sunshine Hills Branch\n**Job Type:** Full Time Regular\n**myWork Program:** Office\n**Starting Salary Range:** $64,700\\.00 \\- $77,600\\.00\n**Background Screening Requirement:**\n* Enhanced Criminal Record Check\n* Credit Check\n* Identity Verification\n* Employment Verification\n* References\n\n  \n\n\n**Job Purpose**\n\nAt most Financial Institutions this position is normally called a Senior Financial Advisor, but at Coast Capital Savings, we call this role a Relationship Manager. From identifying lending/credit and investments opportunities, to day\\-to\\-day banking needs for our members, the Relationship Manager is a Coast Capital ambassador in our branches, putting members first and finding solutions to their unique financial needs. Through championing Coast Capital’s values and purpose, the Relationship Manager will support new member acquisition while deepening relationships with existing members through providing trusted advice. Join a leader in the financial services that provides simple financial help with our innovative products and services.  \n\n\n**Accountabilities**\n* Get to know your members on a deeper level by asking the right questions so you can deliver a positive and unexpected customer experience.\n* Use your banking expertise to match your customer’s needs with our high\\-quality core banking, lending, and investment options.\n* Collaborate with other teams in the branch to uncover and refer general insurance, complex investment needs, personal insurance, and small business needs.\n* Engage your customers in the “Where You’re at Money Chat” and maximize every opportunity to help customers manage, save, grow, and protect their financial well\\-being.\n* Help Coast change the way Canadians feel about banking, forever.\n\n  \n\n\n**Skills \\& Qualifications**\n* Experience helping customers in either a bank or a credit union for a minimum five years.\n* Post\\-secondary education in finance, business administration or a related field.\n* Investment Funds in Canada is a requirement.\n* Solid understanding of day\\-to\\-day banking, complex investment, and lending products.\n* You are a sales pro and have an x\\-ray vision to spot sales and referral opportunities.\n* You like to build relationships with a wide variety of people and want to help them with simple financial needs.\n* You are a multi\\-tasker, able to prioritize and organize what needs to get done coupled with a high attention to detail.\n  \n\n\n**Equity, Diversity \\& Inclusion at Coast Capital**  \n\n\n\nDon’t meet every single requirement? At Coast Capital, we believe everyone has potential. We are committed to building better, brighter, more inclusive futures for everyone – including our employees. We see the potential in our employees to achieve amazing things and want to invest in your future. If you’re excited about this career opportunity and your experience may not perfectly align with every qualification in this job posting, we still encourage you to apply. You may be just the right candidate for this or other opportunities at Coast Capital.  \n\n\n\nAt Coast Capital, we are committed to equity, diversity and inclusion. We strongly encourage applications from Indigenous Peoples, Black, and racialized persons, persons with disabilities, people of diverse sexual and gender identities and women. We value applicants who have demonstrated a commitment to equity, diversity and inclusion and recognize that diverse perspectives, experiences and expertise benefit of our employees, our members, and our community.  \n\n\n\nCoast Capital is committed to providing an accessible recruitment experience. If you are a candidate with a disability and require accommodation(s) during any stage of the recruitment process, please contact us at accessibility@coastcapitalsavings.com or 778\\-391\\-5836\\. This contact is intended solely for inquiries or feedback related to accessibility barriers, accommodation requests or alternate format requests. We will work with you to ensure your needs are met. You will only receive a response to inquiries related to these topics.  \n\n\nWhy join Coast Capital Savings?\n\n\n* **Purpose is our North Star.** We look at everything through our purpose. It informs the advice we provide our members, the experiences and products we create, and the programs we build to support our employees and communities.\n* **Committed to inclusion and engagement.** We have an ongoing focus on equity, diversity, and inclusion and routinely track how we’re doing, and what we need to do to keep improving. We foster a culture where everyone can feel safe to be who they really are and thrive.\n* **A career that grows with you.** We believe in developing our people and promoting from within. Many employees have spent decades, and sometimes their entire careers, with Coast Capital and have progressed from the frontlines to senior leadership.\n* **Work where you’re most effective.** In 2020 the world changed, and that includes how we work. In response to COVID\\-19 we launched myWork, which gives employees flexibility in where they work based on the nature of their role.\n* **Benefits that flex to the needs of you and your family.** We offer comprehensive, customizable benefits for you and your family, so you can choose what fits best for you and your lifestyle.\n* **Retirement options.** We also take care of our employees once they retire. That’s why we offer the choice of a defined contribution or defined benefit pension plan or RSP’s.\n* **Mortgage and auto financing benefits**. Employees save thousands on their mortgages and auto loans with best\\-in\\-category benefits.\n* **Real Recognition**. We recognize excellence throughout the year, through an online community that lets employees give kudos and thanks throughout the year. We’re human, which means we like to have fun with events, celebrations, and recognition throughout the year.\n* **An award winning culture**. We’re a Platinum member of Canada’s Best Managed Companies and are regularly recognized by Canada’s Most Admired Corporate Cultures and the BC Top Employers Awards.\n* **We reinvest 10% back into the community.** When we do well, our communities do well. That’s why since 2000 we’ve invested over $90 million into our member’s communities.\n* **Double your impact.** Through our employee volunteer program, Coast Capital donates $10 for every hour you volunteer to a Canadian charity or non\\-profit of your choice.",
    "id": "in-bcb9dc44191d01c6",
    "currency": "CAD",
    "site": "indeed",
    "location": "Surrey, BC, CA",
    "company": "Coast Capital Savings",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=bcb9dc44191d01c6",
    "title": "Relationship Manager",
    "date_posted": "2025-12-09",
    "job_type": "fulltime",
    "max_amount": 90.0,
    "min_amount": 90.0,
    "job_url_direct": "https://careers.coastcapitalsavings.com/job/Surrey-Relationship-Manager-Sunshine-Hills-Branch-Brit-V3X-3K1/1348641900/",
    "company_group": "Coast Capital Savings",
    "company_search_term": "Coast Capital Savings",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": [
      "fulltime"
    ],
    "location_city": "Surrey",
    "location_region": "BC",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:23.406801+00:00",
    "posted_days_ago": null,
    "dedupe_key": "816c03e998767aee038e64a2f545410f43b63bed"
  },
  {
    "description": "As a member\\-owned cooperative, we’re helping our members with their real goals and real challenges so they can live the real life they want. It’s what we’ve been doing for over 80 years, and it’s why today we stand almost 600,000 members strong. Plus, we invest 10% of our budgeted profits back into our community – almost $90 million since 2000 alone – because when our members do well, we believe our communities should do well too.\n\n\nFinancial Associate \\- MFDA\n\n\nDec 31, 2025\n**Location(s):** Newton Branch, Sunshine Hills Branch\n**Job Type:** Full Time Regular\n**myWork Program:** Hybrid\n**Starting Salary Range:** $55,600\\.00 \\- $66,700\\.00\n**Background Screening Requirement:**\n* Enhanced Criminal Record Check\n* Credit Check\n* Identity Verification\n* Employment Verification\n* References\n\n **What’s the job?**\n\nThe Financial Associate is accountable to assist and support the Financial Planners (FP) in supporting new business development, and maximizing productivity by providing Administrative support through the fulfillment of the Financial Planners day to day activities. (Calendar management, outbound calls connecting with all members for a consistent touch point) This role focuses on delivering a positive member experience through strong relationships and good service. This position will partner with the FP to successfully maximize every opportunity to \"help\" our members manage, save, grow, protect and improve their financial well\\-being thus contributing to the overall profitability of Coast Capital. This role will provide high quality service while liaising effectively with other teams within the branch network to better serve our members delivering against sales, growth and retention objectives and assume responsibility for portfolio maintenance and member experience in the Financial Planners absence. Uncovering and referring complex investment needs, personal insurance, small business needs or mobile needs to the respective specialized respective channels. Sound industry knowledge and business judgment to meet all areas of accountability including Insurance and Investment referrals that help our members is required.  \n\n\n**What you’ll get to do:**\n* Maintaining and building positive member relationships including greeting and servicing the incoming needs of our investments members.\n* Resolve customer issues, concerns and/or problems promptly as required, taking ownership of member experience by ensuring timely and accurate responses to client requests (in person, by phone, via e\\-mail)\n* Processing day to day administrative operations including, but not limited to: assuming lead liaison role in all member estate and marital dissolution administration; managing FP messages and email; ordering supplies and business cards etc.\n* Support FP in ensuring contact management requirements are scheduled and executed on behalf of FP. Books and confirms appointments on behalf of the FP ensuring members have the necessary information in preparation for meetings etc.\n* Assist in the development and maintenance of member files and proactively noting any opportunities for follow up and recommendation to the FP.\n* Proactively prepare account opening, trade, financial planning, and maintenance documentation as required by FP. (including collecting required documentation from members) as required by FP\n* In collaboration with the FP and Branch leadership will support a variety of processes and initiatives. May work on special projects, as required including assisting with technology service / maintenance of systems, will order supplies and business cards.\n* As directed by the FP, process transactions to direct assets into suitable financial products based on the client’s risk/reward tolerances and demographic profile and documented planning/next steps\n* Ensures compliance standards are adhered to in all dealings as required. Adhere to all operational, risk and compliance processes.\n* Proactively provide Superior member service by demonstrating professionalism and demonstrating helpfulness at all times\n* Actively engaged in partnership with the FP and branch team and supports the FP in achieving business plans to meet goals. Support and sponsor local and organizational initiatives.\n* Within area of accountability, in the Financial Planner's absence ensures continuity of member experience.\n* Proactively build pipeline opportunities for FP to optimize during member meetings.\n* Responsible to build share of wallet by identifying and/or acting on non\\-investment products and services, insurance and referring to partners where applicable.\n* Builds relationships to ensure contribution to the team as well as able to work independently if required.\n* Understand and support Coast’s vision, values and mission and how this position contributes to being the leader in member relationships. Leads by example and shares knowledge with peers. Participates in team and community activities to support local and corporate initiatives.\n\n  \n\n\n**Who are we looking for?**\n* 2\\+ Years of Related Experience in an investments capacity working with portfolios and associated requirements.\n* IFIC/CSC \\- MFDA/IIROC license is Requird.\n* Should have working knowledge of various quotation equipment and industry specific computer software\n* Basic investment knowledge and a commitment to continuous learning\n* Decision\\-maker and ability to prioritize multiple tasks and manage interruptions, to assess situations to determine the importance, urgency and risks, and make clear decisions which are timely and in the best interests of the organization.\n* Organized and able to work independently when given overall goals and expectations\n* Demonstrated ability to positively and productively engage and deal effectively with colleagues at all levels; builds constructive, mutually beneficial relationships, appropriate rapport and relates well to others\n* Demonstrated experience and effectiveness in both oral and written communication including F2F oral presentations to groups, focused and concise written and verbal summaries, effective questioning and listening skills.\n* Makes good decisions, in a timely manner, based on analysis, experience, and judgment; sought out by others for advice; capable of analyzing complex problems, leveraging multiple sources to create effective solutions\n* Consistently meets/exceeds goals, typically by being organized, setting priorities, accurately estimating timeframes, overcoming resistance \\& barriers; steadfastly pushes self \\& others\n* Dedicated to meeting the expectations and needs of internal and external clients; establishes effective relationships with members, earning trust/respect; acts with a conscious intent to fulfill our CCS purpose\n\n  \n\n\n**Equity, Diversity \\& Inclusion at Coast Capital**  \n\n\n\nDon’t meet every single requirement? At Coast Capital, we believe everyone has potential. We are committed to building better, brighter, more inclusive futures for everyone – including our employees. We see the potential in our employees to achieve amazing things and want to invest in your future. If you’re excited about this career opportunity and your experience may not perfectly align with every qualification in this job posting, we still encourage you to apply. You may be just the right candidate for this or other opportunities at Coast Capital.  \n\n\n\nAt Coast Capital, we are committed to equity, diversity and inclusion. We strongly encourage applications from Indigenous Peoples, Black, and racialized persons, persons with disabilities, people of diverse sexual and gender identities and women. We value applicants who have demonstrated a commitment to equity, diversity and inclusion and recognize that diverse perspectives, experiences and expertise benefit of our employees, our members, and our community.  \n\n\n\nCoast Capital is committed to providing an accessible recruitment experience. If you are a candidate with a disability and require accommodation(s) during any stage of the recruitment process, please contact us at accessibility@coastcapitalsavings.com or 778\\-391\\-5836\\. This contact is intended solely for inquiries or feedback related to accessibility barriers, accommodation requests or alternate format requests. We will work with you to ensure your needs are met. You will only receive a response to inquiries related to these topics.  \n\n\nWhy join Coast Capital Savings?\n\n\n* **Purpose is our North Star.** We look at everything through our purpose. It informs the advice we provide our members, the experiences and products we create, and the programs we build to support our employees and communities.\n* **Committed to inclusion and engagement.** We have an ongoing focus on equity, diversity, and inclusion and routinely track how we’re doing, and what we need to do to keep improving. We foster a culture where everyone can feel safe to be who they really are and thrive.\n* **A career that grows with you.** We believe in developing our people and promoting from within. Many employees have spent decades, and sometimes their entire careers, with Coast Capital and have progressed from the frontlines to senior leadership.\n* **Work where you’re most effective.** In 2020 the world changed, and that includes how we work. In response to COVID\\-19 we launched myWork, which gives employees flexibility in where they work based on the nature of their role.\n* **Benefits that flex to the needs of you and your family.** We offer comprehensive, customizable benefits for you and your family, so you can choose what fits best for you and your lifestyle.\n* **Retirement options.** We also take care of our employees once they retire. That’s why we offer the choice of a defined contribution or defined benefit pension plan or RSP’s.\n* **Mortgage and auto financing benefits**. Employees save thousands on their mortgages and auto loans with best\\-in\\-category benefits.\n* **Real Recognition**. We recognize excellence throughout the year, through an online community that lets employees give kudos and thanks throughout the year. We’re human, which means we like to have fun with events, celebrations, and recognition throughout the year.\n* **An award winning culture**. We’re a Platinum member of Canada’s Best Managed Companies and are regularly recognized by Canada’s Most Admired Corporate Cultures and the BC Top Employers Awards.\n* **We reinvest 10% back into the community.** When we do well, our communities do well. That’s why since 2000 we’ve invested over $90 million into our member’s communities.\n* **Double your impact.** Through our employee volunteer program, Coast Capital donates $10 for every hour you volunteer to a Canadian charity or non\\-profit of your choice.",
    "id": "in-7a6029ef603a0047",
    "currency": "CAD",
    "site": "indeed",
    "location": "Surrey, BC, CA",
    "company": "Coast Capital Savings",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=7a6029ef603a0047",
    "title": "Financial Associate",
    "date_posted": "2025-11-27",
    "job_type": "fulltime",
    "max_amount": 90.0,
    "min_amount": 90.0,
    "job_url_direct": "https://careers.coastcapitalsavings.com/job/Surrey-Financial-Associate-MFDA-Brit-V3W-3P4/1346063500/",
    "company_group": "Coast Capital Savings",
    "company_search_term": "Coast Capital Savings",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": "hybrid",
    "employment_types": [
      "fulltime"
    ],
    "location_city": "Surrey",
    "location_region": "BC",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:23.408498+00:00",
    "posted_days_ago": null,
    "dedupe_key": "e0af527f56a0d44c0a6c32d5d72002e0c20be0f8"
  },
  {
    "description": "As a member\\-owned cooperative, we’re helping our members with their real goals and real challenges so they can live the real life they want. It’s what we’ve been doing for over 80 years, and it’s why today we stand almost 600,000 members strong. Plus, we invest 10% of our budgeted profits back into our community – almost $90 million since 2000 alone – because when our members do well, we believe our communities should do well too.\n\n\nIntegration Developer (MuleSoft)\n\n\nJan 8, 2026\n**Location(s):** Help Headquarters\n**Job Type:** Full Time Regular\n**myWork Program:** Hybrid\n**Starting Salary Range:** $95,900\\.00 \\- $124,700\\.00\n**Background Screening Requirement:**\n* Enhanced Criminal Record Check\n* Credit Check\n* Identity Verification\n* Employment Verification\n* References\n\n  \n\n\n**Job Purpose**\n\nIf you like to roll up your sleeves and play an active role in building a better future for our members and our communities, you will enjoy working at Coast Capital Savings (CCS). As part of our Digital Channels team, the Integration Developer designs and develops application integrations, interfaces, data flows, APIs, and integration middleware. The Integration developer leads the development and innovation of API's and micro services using best in class integration patterns.  \n\n\n\n**Accountabilities**\n\n* Develop and support a best\\-in\\-class external\\-facing API layer for application integration.\n* Using an Enterprise Service Bus architectural model, define systems integrations, including integration, APIs, and dataflow designs.\n* API development using a combination of Java, JSON, XML, and RAML and messaging.\n* Implement CI/CD best practices in using Jenkins, GitHub, Maven, Jenkins, Nexus, and AWS to promote build/testing automation and continuous deployment/delivery.\n* Create API Functional specifications and technical detailed design. As well, as perform API design and code reviews.\n* Create build artifacts using GitHub, Maven, and unit test, i.e., Munit.\n* Develop API\\-testing artifacts using Postman and SoapUI.\n* Provide technical guidance in API/integration design and implementation.\n* Jointly responsible with the Quality Assurance team to ensure systems are appropriately tested and meet the delivery requirements.\n* Provide subject matter expertise to support decision making on implementation scope based on priority, impact and dependency analysis, reusability and value added.\n\n  \n\n\n**Skills \\& Qualifications:**\n\n* 5\\-7 years of relevant working experience\n* Bachelor’s degree in computer science or equivalent technology discipline.\n* 3\\-5 years of experience in API/ integration development or related experience in a multi\\-application enterprise environment with mission\\-critical systems.\n* Experience with API SDLC, including API design, development, testing, and monitoring with industry best practices alignment.\n* Excellent understanding of Service Oriented Architecture, Enterprise Application Integration using an ESB (MuleSoft), and ETL processes.\n* Demonstrate competency in API development with MuleSoft and deep knowledge of integration design patterns. Also, other ESB will be considered.\n* Experience working with external vendors for service implementation to meet delivery timeline for the deliverable with quality.\n* Experience in using CI/CD tools such as Jenkins, GitHub, Maven, Nexus, and AWS.\n* Experience with Cloud technology such as AWS is an asset.\n* MuleSoft certification is an asset.\n* Advanced ability to map complex business issues to elegant technology solutions.\n* Advanced experience with MuleSoft ESB, Maven, Postman, unit testing, JMeter, Java, OAS/RAML, JSON, XML, and Messaging.\n* Proficient in database development using MS SQL Server and Oracle.\n* Experience in integrating with AWS\\-managed services such as Lambda, S3, DynamoDB, Kinesis, and OpenSearch/ElasticSearch is an asset.\n* Experience in developing and managing high transaction volume API and integration. Deep knowledge of application profiling, performance tuning up, and scaling up.\n* Ability to manage and prioritize a complex workload with minimal supervision while adhering to Software Development Life Cycle methodology.\n* Demonstrated ability to communicate and work effectively with management, clients, and peers, especially in stressful situations. Including the ability to write comprehensive technical documentation and coach or influence others.\n\n  \n\n\n**Equity, Diversity \\& Inclusion at Coast Capital**  \n\n\n\nDon’t meet every single requirement? At Coast Capital, we believe everyone has potential. We are committed to building better, brighter, more inclusive futures for everyone – including our employees. We see the potential in our employees to achieve amazing things and want to invest in your future. If you’re excited about this career opportunity and your experience may not perfectly align with every qualification in this job posting, we still encourage you to apply. You may be just the right candidate for this or other opportunities at Coast Capital.  \n\n\n\nAt Coast Capital, we are committed to equity, diversity and inclusion. We strongly encourage applications from Indigenous Peoples, Black, and racialized persons, persons with disabilities, people of diverse sexual and gender identities and women. We value applicants who have demonstrated a commitment to equity, diversity and inclusion and recognize that diverse perspectives, experiences and expertise benefit of our employees, our members, and our community.  \n\n\n\nCoast Capital is committed to providing an accessible recruitment experience. If you are a candidate with a disability and require accommodation(s) during any stage of the recruitment process, please contact us at accessibility@coastcapitalsavings.com or 778\\-391\\-5836\\. This contact is intended solely for inquiries or feedback related to accessibility barriers, accommodation requests or alternate format requests. We will work with you to ensure your needs are met. You will only receive a response to inquiries related to these topics.  \n\n\nWhy join Coast Capital Savings?\n\n\n* **Purpose is our North Star.** We look at everything through our purpose. It informs the advice we provide our members, the experiences and products we create, and the programs we build to support our employees and communities.\n* **Committed to inclusion and engagement.** We have an ongoing focus on equity, diversity, and inclusion and routinely track how we’re doing, and what we need to do to keep improving. We foster a culture where everyone can feel safe to be who they really are and thrive.\n* **A career that grows with you.** We believe in developing our people and promoting from within. Many employees have spent decades, and sometimes their entire careers, with Coast Capital and have progressed from the frontlines to senior leadership.\n* **Work where you’re most effective.** In 2020 the world changed, and that includes how we work. In response to COVID\\-19 we launched myWork, which gives employees flexibility in where they work based on the nature of their role.\n* **Benefits that flex to the needs of you and your family.** We offer comprehensive, customizable benefits for you and your family, so you can choose what fits best for you and your lifestyle.\n* **Retirement options.** We also take care of our employees once they retire. That’s why we offer the choice of a defined contribution or defined benefit pension plan or RSP’s.\n* **Mortgage and auto financing benefits**. Employees save thousands on their mortgages and auto loans with best\\-in\\-category benefits.\n* **Real Recognition**. We recognize excellence throughout the year, through an online community that lets employees give kudos and thanks throughout the year. We’re human, which means we like to have fun with events, celebrations, and recognition throughout the year.\n* **An award winning culture**. We’re a Platinum member of Canada’s Best Managed Companies and are regularly recognized by Canada’s Most Admired Corporate Cultures and the BC Top Employers Awards.\n* **We reinvest 10% back into the community.** When we do well, our communities do well. That’s why since 2000 we’ve invested over $90 million into our member’s communities.\n* **Double your impact.** Through our employee volunteer program, Coast Capital donates $10 for every hour you volunteer to a Canadian charity or non\\-profit of your choice.",
    "id": "in-4523a2ef7eddde5f",
    "currency": "CAD",
    "site": "indeed",
    "location": "Surrey, BC, CA",
    "company": "Coast Capital Savings",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=4523a2ef7eddde5f",
    "title": "Integration Developer (MuleSoft)",
    "date_posted": "2025-11-26",
    "job_type": "fulltime",
    "max_amount": 90.0,
    "min_amount": 90.0,
    "job_url_direct": "https://careers.coastcapitalsavings.com/job/Surrey-Integration-Developer-%28MuleSoft%29-Brit-V3T-0K7/1345978600/",
    "company_group": "Coast Capital Savings",
    "company_search_term": "Coast Capital Savings",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": "hybrid",
    "employment_types": [
      "fulltime"
    ],
    "location_city": "Surrey",
    "location_region": "BC",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:23.409874+00:00",
    "posted_days_ago": null,
    "dedupe_key": "2321bf870187aa55817de5d58378cc2f00791ee4"
  },
  {
    "description": "As a member\\-owned cooperative, we’re helping our members with their real goals and real challenges so they can live the real life they want. It’s what we’ve been doing for over 80 years, and it’s why today we stand almost 600,000 members strong. Plus, we invest 10% of our budgeted profits back into our community – almost $90 million since 2000 alone – because when our members do well, we believe our communities should do well too.\n\n\nMobile Mortgage Specialist\n\n\nDec 18, 2025\n**Location(s):** Langley Branch, Brookswood Branch, Clearbrook Branch, Cottonwood Branch, Kelowna, Walnut Grove Branch\n**Job Type:** Full Time Regular\n**myWork Program:** Mobile\n**Starting Salary Range: Commission Plan**\n**Background Screening Requirement:**\n* Enhanced Criminal Record Check\n* Credit Check\n* Identity Verification\n* Employment Verification\n* References\n\n **Job Purpose**\n\nAs a Mobile Mortgage Specialist at Coast Capital, you'll work with current and prospective members to help them in their pursuit of home ownership by providing expert mortgage advice. As someone who thrives in an environment that values autonomy and connectivity, you'll appreciate the freedom that comes with setting up your office space at home and stepping out into the community to network and engage.  \n\n\n\nYou'll benefit from a comprehensive commission structure that rewards your initiative across a spectrum of products including mortgages, investments, credit cards, commercial referrals and insurance, crafting a truly dynamic and rewarding career experience. Finally, you're a strong communicator who loves to meet new people and develop meaningful relationships to solve your client's financial needs.  \n\n\n**Accountabilities**\n* Establish and nurture ongoing relationships with prospective clients, providing customized mortgage consultation to address specific needs. Engage proactively with clients, offering support during the mortgage application process and schedule consistent follow\\-ups to guarantee their satisfaction. Coordinate with internal teams to address client inquiries and issues swiftly.\n* Keep abreast of industry regulatory changes and stay well\\-informed. Review mortgage applications to confirm they comply with underwriting standards and regulations. Accurately prepare and maintain records for regulatory audits and educate clients on the regulatory requirements affecting mortgage processes.\n* Offer expert advice on mortgage products, driving sales to surpass established targets. Employ strategic sales initiatives to attract new clients and present mortgage options during appointments. Adopt a consultative sales approach to address client needs effectively.\n* Identify and proactively reach out to potential clients using a variety of channels, including social media, to build a robust lead pipeline. Develop and implement lead sourcing strategies, attend industry events to network and uncover new opportunities, and analyze market trends to identify fresh avenues for lead generation.\n* Join local business and community groups to increase visibility and cultivate connections with prospective clients. Establish partnerships with real estate agents and builders to generate referral opportunities. Use online networking platforms to actively engage with clients and develop referral sources.\n\n  \n\n\n**Skills \\& Qualifications**\n* Bachelor's degree in Finance, Economics, Business Administration, or related field\n* 5\\+ years with strategic sales and networking\n* Extensive knowledge of the real estate and economic market in British Columbia\n* Knowledge of current residential mortgage products and services\n* Ability to analyze financial information and mortgage applications\n* Expertise in mortgage underwriting standards and regulations\n* Competency in using CRM software for client relationship management\n* Familiarity with digital marketing tools for lead generation\n* Proficiency in online networking platforms for community engagement\n* Track record of meeting or exceeding sales targets in the mortgage industry\n* History of successfully building and maintaining client relationships\n* Proven experience in developing personal networks to generate business opportunities\n* Demonstrated ability to innovate and implement successful lead generation strategies\n* Experience in creating and executing strategic sales plans in the financial sector\n* Evidence of strong community involvement with a focus on business development activities\n\n  \n\n\n**Equity, Diversity \\& Inclusion at Coast Capital**  \n\n\n\nDon’t meet every single requirement? At Coast Capital, we believe everyone has potential. We are committed to building better, brighter, more inclusive futures for everyone – including our employees. We see the potential in our employees to achieve amazing things and want to invest in your future. If you’re excited about this career opportunity and your experience may not perfectly align with every qualification in this job posting, we still encourage you to apply. You may be just the right candidate for this or other opportunities at Coast Capital.  \n\n\n\nAt Coast Capital, we are committed to equity, diversity and inclusion. We strongly encourage applications from Indigenous Peoples, Black, and racialized persons, persons with disabilities, people of diverse sexual and gender identities and women. We value applicants who have demonstrated a commitment to equity, diversity and inclusion and recognize that diverse perspectives, experiences and expertise benefit of our employees, our members, and our community.  \n\n\n\nCoast Capital is committed to providing an accessible recruitment experience. If you are a candidate with a disability and require accommodation(s) during any stage of the recruitment process, please contact us at accessibility@coastcapitalsavings.com or 778\\-391\\-5836\\. This contact is intended solely for inquiries or feedback related to accessibility barriers, accommodation requests or alternate format requests. We will work with you to ensure your needs are met. You will only receive a response to inquiries related to these topics.  \n\n\nWhy join Coast Capital Savings?\n\n\n* **Purpose is our North Star.** We look at everything through our purpose. It informs the advice we provide our members, the experiences and products we create, and the programs we build to support our employees and communities.\n* **Committed to inclusion and engagement.** We have an ongoing focus on equity, diversity, and inclusion and routinely track how we’re doing, and what we need to do to keep improving. We foster a culture where everyone can feel safe to be who they really are and thrive.\n* **A career that grows with you.** We believe in developing our people and promoting from within. Many employees have spent decades, and sometimes their entire careers, with Coast Capital and have progressed from the frontlines to senior leadership.\n* **Work where you’re most effective.** In 2020 the world changed, and that includes how we work. In response to COVID\\-19 we launched myWork, which gives employees flexibility in where they work based on the nature of their role.\n* **Benefits that flex to the needs of you and your family.** We offer comprehensive, customizable benefits for you and your family, so you can choose what fits best for you and your lifestyle.\n* **Retirement options.** We also take care of our employees once they retire. That’s why we offer the choice of a defined contribution or defined benefit pension plan or RSP’s.\n* **Mortgage and auto financing benefits**. Employees save thousands on their mortgages and auto loans with best\\-in\\-category benefits.\n* **Real Recognition**. We recognize excellence throughout the year, through an online community that lets employees give kudos and thanks throughout the year. We’re human, which means we like to have fun with events, celebrations, and recognition throughout the year.\n* **An award winning culture**. We’re a Platinum member of Canada’s Best Managed Companies and are regularly recognized by Canada’s Most Admired Corporate Cultures and the BC Top Employers Awards.\n* **We reinvest 10% back into the community.** When we do well, our communities do well. That’s why since 2000 we’ve invested over $90 million into our member’s communities.\n* **Double your impact.** Through our employee volunteer program, Coast Capital donates $10 for every hour you volunteer to a Canadian charity or non\\-profit of your choice.",
    "id": "in-a180963ee7b5e773",
    "currency": "CAD",
    "site": "indeed",
    "location": "Chilliwack, BC, CA",
    "company": "Coast Capital Savings",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=a180963ee7b5e773",
    "title": "Mobile Mortgage Specialist",
    "date_posted": "2025-10-20",
    "job_type": "fulltime",
    "max_amount": 90.0,
    "min_amount": 90.0,
    "job_url_direct": "https://careers.coastcapitalsavings.com/job/Langley-Mobile-Mortgage-Specialist-Brit-V2Y-1A2/1336243900/",
    "company_group": "Coast Capital Savings",
    "company_search_term": "Coast Capital Savings",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": [
      "fulltime"
    ],
    "location_city": "Chilliwack",
    "location_region": "BC",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:23.411749+00:00",
    "posted_days_ago": null,
    "dedupe_key": "b8db9bf66d1a3853951c49861eeaeabf248d6c90"
  },
  {
    "description": "As a member\\-owned cooperative, we’re helping our members with their real goals and real challenges so they can live the real life they want. It’s what we’ve been doing for over 80 years, and it’s why today we stand almost 600,000 members strong. Plus, we invest 10% of our budgeted profits back into our community – almost $90 million since 2000 alone – because when our members do well, we believe our communities should do well too.\n\n\nMobile Mortgage Specialist\n\n\nDec 18, 2025\n**Location(s):** Help Headquarters, Clayton Crossing Branch, Cloverdale Branch, Coquitlam Branch, Delta Branch, Fleetwood Branch, Newton Branch, North Road, Ocean Park Branch, Queensborough Branch, Semiahmoo Branch, Strawberry Hill Branch, Sunshine Hills Branch, Tsawwassen Branch\n**Job Type:** Full Time Regular\n**myWork Program:** Mobile\n**Starting Salary Range: Commission Plan**\n**Background Screening Requirement:**\n* Enhanced Criminal Record Check\n* Credit Check\n* Identity Verification\n* Employment Verification\n* References\n\n **Job Purpose**\n\nAs a Mobile Mortgage Specialist at Coast Capital, you'll work with current and prospective members to help them in their pursuit of home ownership by providing expert mortgage advice. As someone who thrives in an environment that values autonomy and connectivity, you'll appreciate the freedom that comes with setting up your office space at home and stepping out into the community to network and engage.  \n\n\n\nYou'll benefit from a comprehensive commission structure that rewards your initiative across a spectrum of products including mortgages, investments, credit cards, commercial referrals and insurance, crafting a truly dynamic and rewarding career experience. Finally, you're a strong communicator who loves to meet new people and develop meaningful relationships to solve your client's financial needs.  \n\n\n**Accountabilities**\n* Establish and nurture ongoing relationships with prospective clients, providing customized mortgage consultation to address specific needs. Engage proactively with clients, offering support during the mortgage application process and schedule consistent follow\\-ups to guarantee their satisfaction. Coordinate with internal teams to address client inquiries and issues swiftly.\n* Keep abreast of industry regulatory changes and stay well\\-informed. Review mortgage applications to confirm they comply with underwriting standards and regulations. Accurately prepare and maintain records for regulatory audits and educate clients on the regulatory requirements affecting mortgage processes.\n* Offer expert advice on mortgage products, driving sales to surpass established targets. Employ strategic sales initiatives to attract new clients and present mortgage options during appointments. Adopt a consultative sales approach to address client needs effectively.\n* Identify and proactively reach out to potential clients using a variety of channels, including social media, to build a robust lead pipeline. Develop and implement lead sourcing strategies, attend industry events to network and uncover new opportunities, and analyze market trends to identify fresh avenues for lead generation.\n* Join local business and community groups to increase visibility and cultivate connections with prospective clients. Establish partnerships with real estate agents and builders to generate referral opportunities. Use online networking platforms to actively engage with clients and develop referral sources.\n\n  \n\n\n**Skills \\& Qualifications**\n* Bachelor's degree in Finance, Economics, Business Administration, or related field\n* 5\\+ years with strategic sales and networking\n* Extensive knowledge of the real estate and economic market in British Columbia\n* Knowledge of current residential mortgage products and services\n* Ability to analyze financial information and mortgage applications\n* Expertise in mortgage underwriting standards and regulations\n* Competency in using CRM software for client relationship management\n* Familiarity with digital marketing tools for lead generation\n* Proficiency in online networking platforms for community engagement\n* Track record of meeting or exceeding sales targets in the mortgage industry\n* History of successfully building and maintaining client relationships\n* Proven experience in developing personal networks to generate business opportunities\n* Demonstrated ability to innovate and implement successful lead generation strategies\n* Experience in creating and executing strategic sales plans in the financial sector\n* Evidence of strong community involvement with a focus on business development activities\n\n  \n\n\n**Equity, Diversity \\& Inclusion at Coast Capital**  \n\n\n\nDon’t meet every single requirement? At Coast Capital, we believe everyone has potential. We are committed to building better, brighter, more inclusive futures for everyone – including our employees. We see the potential in our employees to achieve amazing things and want to invest in your future. If you’re excited about this career opportunity and your experience may not perfectly align with every qualification in this job posting, we still encourage you to apply. You may be just the right candidate for this or other opportunities at Coast Capital.  \n\n\n\nAt Coast Capital, we are committed to equity, diversity and inclusion. We strongly encourage applications from Indigenous Peoples, Black, and racialized persons, persons with disabilities, people of diverse sexual and gender identities and women. We value applicants who have demonstrated a commitment to equity, diversity and inclusion and recognize that diverse perspectives, experiences and expertise benefit of our employees, our members, and our community.  \n\n\n\nCoast Capital is committed to providing an accessible recruitment experience. If you are a candidate with a disability and require accommodation(s) during any stage of the recruitment process, please contact us at accessibility@coastcapitalsavings.com or 778\\-391\\-5836\\. This contact is intended solely for inquiries or feedback related to accessibility barriers, accommodation requests or alternate format requests. We will work with you to ensure your needs are met. You will only receive a response to inquiries related to these topics.  \n\n\nWhy join Coast Capital Savings?\n\n\n* **Purpose is our North Star.** We look at everything through our purpose. It informs the advice we provide our members, the experiences and products we create, and the programs we build to support our employees and communities.\n* **Committed to inclusion and engagement.** We have an ongoing focus on equity, diversity, and inclusion and routinely track how we’re doing, and what we need to do to keep improving. We foster a culture where everyone can feel safe to be who they really are and thrive.\n* **A career that grows with you.** We believe in developing our people and promoting from within. Many employees have spent decades, and sometimes their entire careers, with Coast Capital and have progressed from the frontlines to senior leadership.\n* **Work where you’re most effective.** In 2020 the world changed, and that includes how we work. In response to COVID\\-19 we launched myWork, which gives employees flexibility in where they work based on the nature of their role.\n* **Benefits that flex to the needs of you and your family.** We offer comprehensive, customizable benefits for you and your family, so you can choose what fits best for you and your lifestyle.\n* **Retirement options.** We also take care of our employees once they retire. That’s why we offer the choice of a defined contribution or defined benefit pension plan or RSP’s.\n* **Mortgage and auto financing benefits**. Employees save thousands on their mortgages and auto loans with best\\-in\\-category benefits.\n* **Real Recognition**. We recognize excellence throughout the year, through an online community that lets employees give kudos and thanks throughout the year. We’re human, which means we like to have fun with events, celebrations, and recognition throughout the year.\n* **An award winning culture**. We’re a Platinum member of Canada’s Best Managed Companies and are regularly recognized by Canada’s Most Admired Corporate Cultures and the BC Top Employers Awards.\n* **We reinvest 10% back into the community.** When we do well, our communities do well. That’s why since 2000 we’ve invested over $90 million into our member’s communities.\n* **Double your impact.** Through our employee volunteer program, Coast Capital donates $10 for every hour you volunteer to a Canadian charity or non\\-profit of your choice.",
    "id": "in-571d2a374f2e1e4b",
    "currency": "CAD",
    "site": "indeed",
    "location": "Surrey, BC, CA",
    "company": "Coast Capital Savings",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=571d2a374f2e1e4b",
    "title": "Mobile Mortgage Specialist",
    "date_posted": "2025-10-20",
    "job_type": "fulltime",
    "max_amount": 90.0,
    "min_amount": 90.0,
    "job_url_direct": "https://careers.coastcapitalsavings.com/job/Surrey-Mobile-Mortgage-Specialist-Brit-V3T-0K7/1336243500/",
    "company_group": "Coast Capital Savings",
    "company_search_term": "Coast Capital Savings",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": [
      "fulltime"
    ],
    "location_city": "Surrey",
    "location_region": "BC",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:23.413698+00:00",
    "posted_days_ago": null,
    "dedupe_key": "fff39d460636acb16a41cedb929ec87cd2c200c2"
  },
  {
    "description": "As a member\\-owned cooperative, we’re helping our members with their real goals and real challenges so they can live the real life they want. It’s what we’ve been doing for over 80 years, and it’s why today we stand almost 600,000 members strong. Plus, we invest 10% of our budgeted profits back into our community – almost $90 million since 2000 alone – because when our members do well, we believe our communities should do well too.\n\n\nFinancial Advisor (Member Advice Specialist) \\- Courtenay Branch\n\n\nJan 8, 2026\n**Location(s):** Courtenay Branch\n**Job Type:** Full Time\n**myWork Options:** In\\-person\n**Starting Salary Range:** $55,600\\.00 \\-$66,700\n**Background Screening Requirement:**\n* Enhanced Criminal Record Check (every 5 years)\n* Credit Check (every 5 years)\n* Identity Verification\n* Employment Verification\n* References\n\n  \n\n\n***Our Courtnenay Branch is located within 30 min commute of Campbell River and Comox***  \n\n\n**Job Purpose**  \n\n\nWhen you visit a Coast branch, you’re greeted with a line of smiling faces ready to help you with your everyday banking needs. Our friendly Member Advice Specialists are sales and customer service superstars who bring our “How can we help you?” brand to life with every member they interact with. Imagine helping our members with Fulfilling basic personal credit needs, selling and handling Low Fee More for Me Mutual Funds, Term deposits, RRSPs, Setting up electronic services like our internet banking, opening free Chequing accounts, adding overdraft protection to help avoid those nasty NSF charges. But it doesn’t end there, Member Advice Specialists do two other very importing things. First, they are sales pros. They uncover opportunities where we can better help our members with our fantastic line\\-up of products and services. Next, they figure out who in the company can best help that member, be it themselves or another teammate.  \n\n\n**Accountabilities**  \n\n\n* Getting a natural high from delivering positive and unexpected customer experience through general retail banking\n* Having fun engaging customers in the “Where You Are At Money Chat” to help your customer to save, grow, protect and improve their financial well\\-being\n* Working as a high\\-performing team member within the branch to ensure all checks and balances are completed around policies and regulatory requirements\n* Proactively and creatively offer helpful solutions and alternatives to customer inquiries\n* Earning high\\-fives from your managers and peers for achieving sales and referrals targets in a needs based sales environment\n\n  \n\n\n**Skills \\& Qualifications**  \n\n\n* We don’t need mathematical geniuses here, though ability to add and subtract would be useful. Mostly we just need people who are comfortable helping customers with simple financial help and promoting our products and services.\n* Experience helping members in either a bank or credit union, preferably where you mastered lending and investments, and you used your x\\-ray vision to spot sales and referral opportunities.\n* You are excited to share with the world what you learned during your post\\-secondary education in finance, business administration or a related field. And you aren’t done learning; you have a desire to know more.\n* **Certificate in Investment Funds in Canada is a requirement.**\n* You really like building relationships with a wide variety of people and want to help them with simple financial help.\n* You are a big fan of teamwork and demonstrate your team spirit every day.\n* You are a multi\\-tasking prodigy, able to efficiently and effectively prioritize and organize what needs to get done coupled with a high attention to detail.\n\n  \n\n\n**Equity, Diversity \\& Inclusion at Coast Capital**\nDon’t meet every single requirement? At Coast Capital, we believe everyone has potential. We are committed to building better, brighter, more inclusive futures for everyone – including our employees. We see the potential in our employees to achieve amazing things and want to invest in your future. If you’re excited about this career opportunity and your experience may not perfectly align with every qualification in this job posting, we still encourage you to apply. You may be just the right candidate for this or other opportunities at Coast Capital.  \n\n\nAt Coast Capital, we are committed to equity, diversity and inclusion. We strongly encourage applications from Indigenous Peoples, Black, and racialized persons, persons with disabilities, people of diverse sexual and gender identities and women. We value applicants who have demonstrated a commitment to equity, diversity and inclusion and recognize that diverse perspectives, experiences and expertise benefit of our employees, our members, and our community.  \n\n\nWe strive to provide an accessible candidate experience for our candidates with different abilities. If you require any accommodations, please contact accessibility@coastcapitalsavings.com or call 778\\-391\\-5836\\. We will work with you to meet your needs.  \n\n\nWhy join Coast Capital Savings?\n\n\n* **Purpose is our North Star.** We look at everything through our purpose. It informs the advice we provide our members, the experiences and products we create, and the programs we build to support our employees and communities.\n* **Committed to inclusion and engagement.** We have an ongoing focus on equity, diversity, and inclusion and routinely track how we’re doing, and what we need to do to keep improving. We foster a culture where everyone can feel safe to be who they really are and thrive.\n* **A career that grows with you.** We believe in developing our people and promoting from within. Many employees have spent decades, and sometimes their entire careers, with Coast Capital and have progressed from the frontlines to senior leadership.\n* **Work where you’re most effective.** In 2020 the world changed, and that includes how we work. In response to COVID\\-19 we launched myWork, which gives employees flexibility in where they work based on the nature of their role.\n* **Benefits that flex to the needs of you and your family.** We offer comprehensive, customizable benefits for you and your family, so you can choose what fits best for you and your lifestyle.\n* **Retirement options.** We also take care of our employees once they retire. That’s why we offer the choice of a defined contribution or defined benefit pension plan or RSP’s.\n* **Mortgage and auto financing benefits**. Employees save thousands on their mortgages and auto loans with best\\-in\\-category benefits.\n* **Real Recognition**. We recognize excellence throughout the year, through an online community that lets employees give kudos and thanks throughout the year. We’re human, which means we like to have fun with events, celebrations, and recognition throughout the year.\n* **An award winning culture**. We’re a Platinum member of Canada’s Best Managed Companies and are regularly recognized by Canada’s Most Admired Corporate Cultures and the BC Top Employers Awards.\n* **We reinvest 10% back into the community.** When we do well, our communities do well. That’s why since 2000 we’ve invested over $90 million into our member’s communities.\n* **Double your impact.** Through our employee volunteer program, Coast Capital donates $10 for every hour you volunteer to a Canadian charity or non\\-profit of your choice.",
    "id": "in-abe63a38bcebe8e2",
    "currency": "CAD",
    "site": "indeed",
    "location": "Courtenay, BC, CA",
    "company": "Coast Capital Savings",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=abe63a38bcebe8e2",
    "title": "Financial Advisor (Member Advice Specialist)",
    "date_posted": "2025-03-24",
    "job_type": "fulltime",
    "max_amount": 90.0,
    "min_amount": 90.0,
    "job_url_direct": "https://careers.coastcapitalsavings.com/job/Courtenay-Financial-Advisor-%28Member-Advice-Specialist%29-Courtenay-Branch-Brit-V9N-9G4/1275827800/",
    "company_group": "Coast Capital Savings",
    "company_search_term": "Coast Capital Savings",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": [
      "fulltime"
    ],
    "location_city": "Courtenay",
    "location_region": "BC",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:23.415391+00:00",
    "posted_days_ago": null,
    "dedupe_key": "7270d977ae67845d0f46d8d1ef19b4ef426b75d2"
  }
]