[
  {
    "description": "About Lendesk:\n\n\n\nWe’re a financial technology company on a mission to make the mortgage experience easy, accessible, and transparent. Our flagship product is an advanced digital mortgage origination platform that connects borrowers, brokers and lenders together. We’re a fast\\-growing team of 50\\+ employees, composed of innovative and engaged individuals working collaboratively to deliver a unique digital home buying experience. We’re also a remote\\-first company with team members across Canada and a larger concentration in Vancouver, BC and Calgary, AB.\n\n  \n\n\nAt Lendesk, diversity is our strength. What makes us different, makes us stronger. We believe that a variety of backgrounds, cultures, beliefs, experiences, identities, and voices make for a better and inclusive workplace.\n\n  \n\n\nThe Role:\n\n\n\nAs a **Senior Product Designer** at Lendesk, you will report to the VP of Product and collaborate closely with fellow design team members to craft exceptional web products. You will lead end\\-to\\-end design work—from early discovery to polished production—using a mix of traditional design methods and emerging AI\\-assisted workflows. You’ll manage every aspect of the user journey for each project you work on. This includes design execution from research and ideation to copywriting, prototyping, user testing, and final production.\n\n  \n\nWhat You'll Be Doing:\n\n\n* Support early\\-stage discovery and accelerate clarity.\n* Lead problem framing, and outcome alignment with user and business goals.\n* Use AI tools to rapidly generate early concepts, workflows, and prototypes that help teams visualize possibilities and uncover constraints earlier in the process.\n* Plan and conduct user research (discovery, validation) ; synthesize into actionable insights.\n* Create AI\\-powered exploration assets such as interactive prototypes, sample UI variations, or user\\-scenario simulations to help product and business stakeholders align on direction.\n* Experiment with new AI\\-driven approaches to speed up insight gathering, support design workshops, and enable more effective problem framing.\n* Influence product direction through evidence\\-based narratives and structured decision artifacts.\n\n\n**In your broader role:**\n\n\n* You’ll tackle complex, abstract problems in close collaboration with partners across business, sales and marketing, customer success, development, and product management.\n* You’ll drive large scopes of work with a high degree of autonomy and translate ambiguous problem spaces into clear product assumptions from ambiguity, using both human\\-centered and AI\\-accelerated design methods.\n* As part of a highly collaborative team, you’ll clarify requirements, adapt to new information, and communicate your thinking effectively while supporting others in doing the same.\n* You’ll facilitate and participate in design workshops, brainstorms, and reviews, exploring new tools and processes—including evolving AI workflows—and sharing learnings with the team.\n* You’ll mentor other team members, helping evolve the design team’s culture of curiosity, craft, and continuous improvement.\n* You’ll actively contribute to our company culture, including opportunities to engage with the social committee and showcase your creativity—perhaps even creating digital caricatures of your coworkers for Friday all\\-hands.\n* You’re excited about shaping how AI fits into Lendesk’s product design practice and enjoy finding ways to prototype faster and explore more broadly using AI\\-assisted workflows.\n\n  \n\n\n\nWhat You Bring:\n\n\n* 5\\+ years of product design experience designing complex, web\\-based products. **Fintech experience is a plus.**\n* A strong background in UX design with a proven track record of shipping successful products in cross\\-functional teams.\n* A portfolio demonstrating real\\-world product design work, showcasing both process and outcomes.\n* Excellent communication skills and experience collaborating in fast\\-paced, cross\\-functional environments.\n* Experience managing stakeholders and working with business teams on requirements gathering and business analysis.\n* The ability to confidently provide direction on product features, design strategy, and roadmaps.\n* A solution\\-oriented, product\\-thinking mindset, with the ability to work independently and align design outcomes with business goals.\n* A sharp eye for detail and the ability to reinforce team standards for quality, process, and craft.\n* Experience with design systems and proficiency in tools such as **Figma and Miro.**\n* Experience using—or a strong willingness to adopt—AI\\-assisted design tools (e.g., generative ideation, AI\\-enhanced prototyping, workflow automation) to accelerate discovery, exploration, and iteration.\n\n  \n\n\n\nWhat We Offer\n\n\n\nIn addition to the exciting work, great people and a fun, supportive culture, we offer an extensive\n\n\n\nbenefits and perks package:\n\n\n* Competitive salaries\n* Comprehensive benefit plan including dental, medical and vision. Along with additional lifestyle and health spending accounts\n* Remote first, work from where you are in Canada\n* Flexible work hours\n* The latest in hardware and software tools\n* Budget to improve your home office set\\-up\n* Budget for continuous development and training\n* Stock purchase program in our parent company (“*NYSE:RKT”)*\n  \n\n\nLendesk is committed to offering competitive salaries to all our team members. This role has a salary range of $83,000 \\- $134,500 which accounts for the skills you’ll bring to the team, the impact you’ll have on the business, and the growth you’ll experience in the role. Throughout your time at Lendesk we’ll continue to have conversations about your career development and you’ll have the opportunity to build an amazing career with us.",
    "id": "in-ab5479556087fba3",
    "currency": "CAD",
    "site": "indeed",
    "location": "Vancouver, BC, CA",
    "company": "Lendesk",
    "interval": null,
    "is_remote": true,
    "job_url": "https://ca.indeed.com/viewjob?jk=ab5479556087fba3",
    "title": "Sr. Product Designer",
    "date_posted": "2026-01-02",
    "job_type": "fulltime",
    "max_amount": 83000.0,
    "min_amount": 83000.0,
    "job_url_direct": "https://lendesk.bamboohr.com/careers/119?source=indeed&src=indeed&postedDate=2026-01-02",
    "company_group": "Lendesk",
    "company_search_term": "Lendesk",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": "remote",
    "employment_types": [
      "fulltime"
    ],
    "location_city": "Vancouver",
    "location_region": "BC",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:58.085875+00:00",
    "posted_days_ago": null,
    "dedupe_key": "c69f0ea74f33bff48d74c9edcb392d3fff96ac80"
  },
  {
    "description": "About Lendesk\n\n\n\nWe’re a financial technology company on a mission to make the mortgage experience easy, accessible and transparent. Our flagship product is an advanced digital mortgage origination platform that connects borrowers, brokers and lenders. We’re a fast\\-growing team of 50\\+ employees, composed of innovative and engaged individuals working collaboratively to deliver a unique digital home buying experience. We are a remote\\-first company with team members across Canada .\n\n  \n\nThe Role\n\n\n\nWe are looking for an experienced **Product Manager** to work with a team responsible for one of our business critical products. In addition to driving adoption and retention through a high quality user experience for our customers, you’ll assess a wide range of feedback and recommend problem spaces or focus areas for the team to work on that are impactful for both our customers and our business. You may also lead new product or feature initiatives from the ground up.\n\n  \n\nAs a PM at Lendesk, you’ll contribute to product roadmaps, from creation, prioritization to execution while ensuring you have buy\\-in from senior stakeholders. You will have an end to end mindset. We are looking for someone who has strong product intuition, is data\\-savvy and can deliver exceptional user experiences and business results. You thrive on cross\\-functional collaboration and are excited to partner with engineering, design, marketing, sales, customer success, and the rest of our amazing Product team.\n\n  \n\nYou'll be responsible for:\n\n\n* Define roadmap and backlog for the product to deliver on new initiatives and communicate this to stakeholders\n* Analyze data and research\\-driven insights to discover, assess and recommend opportunities\n* Lead a cross\\-functional product development team to ship products and features that are valuable and usable to customers, feasible for engineering and viable for the business\n* Collaborate cross\\-functionally with sales, marketing, finance and operations to lead go\\-to\\-market strategy\n* Develop and maintain deep expertise of the Canadian mortgage industry, industry trends, and the competitive landscape as it pertains to the product\n\n  \n\n\n\nWhat we expect from you:\n\n\n* 3\\+ years experience in software product management\n* You’re a strategic thinker, analytical, detail, and results\\-oriented with excellent problem\\-solving skills and a strong work ethic. You’re passionate about solving problems for customers and have the ability to define compelling products and roadmaps that address those needs.\n* You’re a motivated self\\-starter, able to translate uncertainty and ambiguity into clear, crisp plans. You have the ability to develop a strong point of view, and collaborate to drive your vision forward.\n* You have a proven ability to work across multiple teams including engineering, design, marketing, sales, and customer success to ensure a world\\-class customer experience.\n* You have strong communication and collaboration. You co\\-create with teammates to deliver high\\-quality results. You speak and write with clarity.\n* Experience working with AI tools and contributing to the development of AI\\-powered features for users and prompt development are considered a strong asset\n* You’re experienced in working effectively with stakeholders and balancing inputs and needs from the organization, while showing a high degree of accountability.\n* You’re experienced in working effectively with stakeholders and balancing inputs and needs from the organization, while showing a high degree of accountability.\n* You have the business acumen required to evaluate business opportunities and own go\\-to\\-market strategy. A BA or MBA degree is a nice\\-to\\-have.\n\nExperience working with SaaS products would be a bonus. Along with any experience in FinTech or the mortgage industry.  \n* \n\n  \n\nWhat We Offer\n\n\n\nIn addition to the exciting work, great people and a fun and supportive culture, we offer an extensive benefits and perks package:\n\n\n* Competitive salaries\n* Comprehensive benefit plan including dental, medical and vision\n* Remote first, work from where you are in Canada\n* Budget to improve your home office set\\-up\n* Flexible work hours\n* The latest in hardware and software tools\n* Budget for continuous development and training\n* Stock purchase program in our parent company (“*NYSE:RKT”)*\n  \n\n\nLendesk is committed to offering competitive salaries to all our team members. This role has a salary range of $83,000\\-$134,500 CAD. which accounts for the skills you’ll bring to the team, the impact you’ll have on the business, and the growth you’ll experience in the role. Throughout your time at Lendesk we’ll continue to have conversations about your career development and you’ll have the opportunity to build an amazing career with us.",
    "id": "in-c0438aa33901dc86",
    "currency": "CAD",
    "site": "indeed",
    "location": "Vancouver, BC, CA",
    "company": "Lendesk",
    "interval": null,
    "is_remote": true,
    "job_url": "https://ca.indeed.com/viewjob?jk=c0438aa33901dc86",
    "title": "Product Manager",
    "date_posted": "2025-12-06",
    "job_type": "fulltime",
    "max_amount": 83000.0,
    "min_amount": 83000.0,
    "job_url_direct": "https://lendesk.bamboohr.com/careers/115?source=indeed&src=indeed&postedDate=2025-12-06",
    "company_group": "Lendesk",
    "company_search_term": "Lendesk",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": "remote",
    "employment_types": [
      "fulltime"
    ],
    "location_city": "Vancouver",
    "location_region": "BC",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:58.087557+00:00",
    "posted_days_ago": null,
    "dedupe_key": "ff1b5de1bcf31ab423ba02c79318bc504cbabc41"
  },
  {
    "description": "About Lendesk  \n\nWe’re a financial technology company on a mission to help people feel confident in their mortgage decision and deliver a seamless experience. Our flagship product is an advanced digital mortgage origination platform that connects borrowers, brokers, and lenders. We’re a fast\\-growing team of 60\\+ employees, composed of innovative and engaged individuals working collaboratively to deliver a unique digital home buying experience. We’re also a remote\\-first company with team members across Canada.\n\n  \n\n\nAt Lendesk, diversity is our strength. What makes us different, makes us stronger. We believe that a variety of backgrounds, cultures, beliefs, experiences, identities, and voices make for a better and inclusive workplace.\n\n  \n\nThe Role:  \n\nWe are hiring a **Customer Success Manager for our U.S. expansion,** reporting to our Director of Customer Success. The Customer Success Manager will play a key part in helping brokers and partners successfully use our SaaS Solution. When an issue arises the job requires coordination with our developers, product managers, and lender partners to uncover problems and solutions. This role is at the centre of important discoveries, communicating across different teams at Lendesk, and with clients and lenders.\n\n  \n\nResponsibilities\n\n\n* Responsible for supporting the onboarding of new clients in conjunction with Account Managers and creating a highly engaged client base who are submitting directly to Rocket (our parent company).\n* Evaluate and drive client engagement by designing, executing and testing onboarding strategies\n* Management of inbound user chat requests, calls and email inquiries.\n* Provide daily support to our users of Finmo US including answering questions, analyzing problems, and quickly forming solutions to remove customer impediments.\n* Communicate clearly and effectively with end users, colleagues, and management to quickly resolve issues and ensure customer satisfaction.\n* Maintain detailed records of interactions with customers, problem\\-solving activities, and completed solutions along with any further actions required of management or development and product teams.\n* Collaborate with development and product teams to establish goals and objectives for product improvements and upgrades.\n* Host onboarding and training sessions\n* Maintain documentation and troubleshooting procedures to help both support personnel and end users of Fuse.\n* Maintain internal team member education resources and conduct training of new hires\n* Create and implement new processes to improve efficiency and customer satisfaction while reducing costs.\n* Communicate client\\-specific features and enhancements to our customers\n* Identifying and/or collaborating on Special Projects as approved by Director of CS.\n\n  \n\n  \n\nSkills \\& Experience\n\n\n* 4\\-6 years Customer Success Management experience with minimum 2 years experience as a team lead or people management\n* Experience in the mortgage industry (preferably in the USA) considered an asset\n* Degree in Business, Communications or similar\n* A passion for helping clients succeed\n* Exceptional verbal and written communication skills\n* Highly refined time management skills\n\n  \n\n\n\nWhat We Offer:\n\n\n\nIn addition to the exciting work, great people and a fun and supporting culture, we offer extensive benefits and perks package:\n\n\n* Competitive salaries: base \\+ bonus upside\n* Comprehensive benefit plan including dental, medical, as well as health and wellness and vacation stipends\n* Lendesk is remote first \\- your office is where you choose it to be across Canada!\n* The latest in hardware and software tools\n* Budget for continuous development and training\n  \n\n\n**You must be a current Canadian resident to be considered for this role. A candidate selected for this position must pass a criminal background check.**\n\n  \n\nLendesk is committed to offering competitive salaries to all our team members. This role has a salary range base of $60,000\\- $90,000 CAD which accounts for the skills you’ll bring to the team, the impact you’ll have on the business, and the growth you’ll experience in the role. Throughout your time at Lendesk we’ll continue to have conversations about your career development and you’ll have the opportunity to build an amazing career with us.",
    "id": "in-7fe457c8bbb04ea4",
    "currency": "CAD",
    "site": "indeed",
    "location": "Vancouver, BC, CA",
    "company": "Lendesk",
    "interval": null,
    "is_remote": true,
    "job_url": "https://ca.indeed.com/viewjob?jk=7fe457c8bbb04ea4",
    "title": "Customer Success Manager- US Expansion",
    "date_posted": "2025-12-01",
    "job_type": "fulltime",
    "max_amount": 60000.0,
    "min_amount": 60000.0,
    "job_url_direct": "https://lendesk.bamboohr.com/careers/118?source=indeed&src=indeed&postedDate=2025-12-01",
    "company_group": "Lendesk",
    "company_search_term": "Lendesk",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": "remote",
    "employment_types": [
      "fulltime"
    ],
    "location_city": "Vancouver",
    "location_region": "BC",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:58.089039+00:00",
    "posted_days_ago": null,
    "dedupe_key": "ca7f881f91d6044dc0af36a0f9f1eb9743e8f740"
  },
  {
    "description": "The Role\n\n\n\nWe’re looking for a **Se****nior Security Developer (aka Security Engineer)** to join our Platform team and help safeguard the integrity of our applications, infrastructure, and data. This role is central to designing and implementing technical solutions that proactively prevent, detect, and respond to security threats. The ideal candidate brings a strong technical foundation, a collaborative mindset, and a passion for making security an enabler of great software. You’ll work closely with developers to identify risks, promote best practices, and implement secure solutions. We’re looking for someone who believes in building strong, repeatable processes—leveraging cloud\\-native security tools, partnering with external experts, and helping teams build secure systems by design.\n\n **Primary responsibilities:**\n\n\n* Lead the evaluation and mitigation of emerging security threats and news\n* Proactively identify security weaknesses in our applications and seek improvements\n* Promote security best practices\n\n  \n\n\n**Additional responsibilities:**\n\n\n* Recommend effective strategies and provide guidance to developers on secure solutions\n* Collaborate with developers to review designs and implementations for potential security issues\n* When appropriate, implement solutions aligned with recommended strategies\n* Write infrastructure\\-as\\-code (Terraform), with a focus on security\\-related solutions\n* Configure and manage cloud security tools, including Datadog’s security suite\n* Oversee vulnerability scanning and assessment, including Dependabot and Amazon ECR\n* Organize and evaluate penetration tests, including managing external assessments\n* Lead or actively participate in security exercises and audits\n* Support responses to compliance and security questionnaires\n* Meet with vendors and partners on security\\-related matters\n* Provide input on internal security guidance related to staff practices and device configuration\n\n  \n\n\n**What we expect from you:**\n\n\n* 5\\+ years of professional experience in a security engineering, AppSec, or infrastructure security role\n* Bachelor’s degree in Software Engineering, Computer Science or related field, or equivalent practical experience\n* Proficiency in at least one programming language\n* Experience in utilizing a variety of tools for vulnerability and penetration testing\n* Experience writing clear, actionable security reports tailored for engineering, leadership and compliance teams\n* Hands\\-on experience with secure software development lifecycle practices, including threat modeling, static/dynamic code analysis, and security\\-focused code reviews\n* Demonstrated ability to build relationships across engineering teams, encouraging secure development practices through education, support, and partnership\n\n  \n\n\n**Additional experience that would be beneficial:**\n\n\n* Experience provisioning and configuring AWS infrastructure using Terraform\n* Experience integrating security checks into CI/CD pipelines using GitHub Actions\n* Experience leading tabletop exercises to simulate incident response scenarios\n* Experience working in regulated industries, such as finance or healthcare\n* Familiarity with compliance frameworks such as SOC 2\n\n  \n\n\n\nAbout Lendesk\n\n\n\nWe’re a financial technology company on a mission to make the mortgage experience easy, accessible, and transparent. Our flagship product is an advanced digital mortgage origination platform that connects borrowers, brokers, and lenders. We’re a fast\\-growing team of 60\\+ employees, composed of innovative and engaged individuals working collaboratively to deliver a unique digital home buying experience.\n\n  \n\nWhat We Offer\n\n\n\nIn addition to the exciting work, great people and a fun and supportive culture, we offer an extensive benefits and perks package:\n\n  \n\n* Competitive salaries\n* Comprehensive benefit plan including dental, medical and vision\n* Remote first, work from where you are in Canada\n* Budget to improve your home office set\\-up\n* Flexible work hours\n* The latest in hardware and software tools\n* Budget for continuous development and training\n* Stock purchase program in our parent company (“NYSE:RKT”)\n\n  \n\n\n**You must be a current Canadian resident to be considered for this role. A candidate selected for this position must pass a criminal background check.**\n\n  \n\nLendesk is committed to offering competitive salaries to all our team members. This role has a salary range of $130,000 \\- $160,000 CAD which accounts for the skills you’ll bring to the team, the impact you’ll have on the business, and the growth you’ll experience in the role. Throughout your time at Lendesk we’ll continue to have conversations about your career development and you’ll have the opportunity to build an amazing career with us.",
    "id": "in-8f067435e018d7f5",
    "currency": "CAD",
    "site": "indeed",
    "location": "Vancouver, BC, CA",
    "company": "Lendesk",
    "interval": null,
    "is_remote": true,
    "job_url": "https://ca.indeed.com/viewjob?jk=8f067435e018d7f5",
    "title": "Security Engineer",
    "date_posted": "2025-07-18",
    "job_type": "fulltime",
    "max_amount": 130000.0,
    "min_amount": 130000.0,
    "job_url_direct": "https://lendesk.bamboohr.com/careers/107?source=indeed&src=indeed&postedDate=2025-07-18",
    "company_group": "Lendesk",
    "company_search_term": "Lendesk",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": "remote",
    "employment_types": [
      "fulltime"
    ],
    "location_city": "Vancouver",
    "location_region": "BC",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:58.090693+00:00",
    "posted_days_ago": null,
    "dedupe_key": "9efe107e58129725ba81d463a7ad1498f6aad5cd"
  }
]