[
  {
    "description": "**Who we are:**  \n\nAt MCAN, our greatest pride is the incredible team we’ve built and the experience we create for every team member. Our people aren’t just professionals; they’re innovators, influencers, and bold thinkers who challenge the status quo. We don’t operate like traditional lenders because our focus isn’t on selling mortgages; it’s on building lasting relationships.\n  \n\\#MCANLIFE is more than a hashtag; it’s our culture. It’s rooted in customer\\-centricity and fueled by genuine collaboration. Here, talented professionals find a workplace that feels connected, empowering, and full of opportunity to use their skills to the fullest. At MCAN, you’ll discover a career where you can connect, grow, and truly make an impact.\n  \nWe are proud to be recognized as one of Canada’s Best Workplaces™ year after year. Building on our Great Place to Work® certification since 2021, we’ve continued to earn national recognition for creating an exceptional employee experience. In 2024 and 2025, we were celebrated as one of Canada’s Best Workplaces™, including being named among the Best Workplaces™ for Women and Best Workplaces™ in Financial Services \\& Insurance. Most recently, we were honored as one of Canada’s Top Small and Medium Employers and recognized for having one of Canada’s Most Admired™ Corporate Cultures, a testament to our commitment to fostering a culture where people feel valued, connected, and empowered to grow.\n  \nWe’re looking for our next Manager, Business Development to join the Residential Lending team. This role is based out of the Greater Vancouver Area, British Columbia.\n  \nThis position represents a newly established role within our organization, created to support our evolving business needs and strategic direction. We are seeking candidates who can bring fresh perspectives and contribute to the growth of our business.\n  \n  \n\n**Job Summary:**  \n\nReporting to the Regional Director of Sales, the Business Development Manager (BDM) has a unique opportunity to make a real and measurable contribution to the development of a growth\\-focused brand with extensive resources and experienced leadership. The BDM is the face of MCAN and is accountable for developing, maintaining and strengthening Mortgage Broker relationships in their assigned region.\n  \nThis is a remote position based out of the Greater Vancouver Area (GVA); a dedicated home office space is required. Must have a valid drivers license \\& access to a dependable vehicle as there will be considerable local travel.\n  \n  \n\n**What you will be responsible for:**  \n\n* Building a business plan to manage and grow the GVA portfolio.\n* Setting aggressive regional targets.\n* Identifying opportunities and cultivating strategic partnerships that contribute to target and growth objectives.\n* Delivering training and coaching to partner Brokers regarding MCAN programs, pricing and policies.\n* Sourcing intel on market trends and competitors, MCAN initiatives and potential growth strategies in line with business objectives.\n* Supporting all aspects of lead generation programs from pre\\-program planning to data entry and post program follow\\-up and tracking.\n* Mediating and supporting relationships between partner Brokers channel and your operations team.\n* Identifying and attending key events. Some travel may be required.\n* Following corporate policies as they relate to behavior, communication, risk, relationships and personal conduct.\n\n\n**The work experience, skills, education that you bring:**  \n\n* Bachelor’s degree in, Business Administration, or a related field.\n* Minimum five years of experience in the mortgage industry.\n* Business development experience preferred.\n* A proven track record of success surpassing targets and supporting long\\-term growth.\n* Leadership mentality. You’re a self\\-starter, have a positive attitude and lead by example.\n* Effective presentation, communication and listening skills.\n* Ability to adapt quickly with grace and grit.\n* Understanding of issues relating to the Canadian mortgage industry, including but not limited to risk management, alternative lending, traditional lending, commercial and residential mortgages, default management etc.\n\n\nWe are dedicated to building an organization that reflects the diversity of our clients and the communities we serve across Canada. Do you possess and value the same attributes? Are you interested in your own development? Then come join our team!\n  \nWe confirm that our recruitment process incorporates Artificial Intelligence (AI) in a variety of ways. While technology helps us enhance efficiency and support our hiring efforts, every stage continues to be guided by our recruitment team to ensure thoughtful and fair decision making. The human element remains central throughout our process.\n  \n  \n\nMCAN is committed to providing accommodation to applicants throughout the job application and interview process to the point of undue hardship. If you require any accommodations, please contact our Human Resources team at hr@mcanfinancial.com. Requests for accommodation can be made at any stage in the recruitment process.\n  \nWe thank all applicants for their interest but only those selected for further consideration will be contacted.",
    "id": "in-69a212836a86e52d",
    "currency": null,
    "site": "indeed",
    "location": "Vancouver, BC, CA",
    "company": "MCAN Mortgage",
    "interval": null,
    "is_remote": true,
    "job_url": "https://ca.indeed.com/viewjob?jk=69a212836a86e52d",
    "title": "Manager, Business Development",
    "date_posted": "2026-01-05",
    "job_type": "fulltime",
    "max_amount": null,
    "min_amount": null,
    "job_url_direct": "https://jobs.dayforcehcm.com/en-US/mcan/CANDIDATEPORTAL/jobs/1215",
    "company_group": "MCAN Home Mortgage Corporation",
    "company_search_term": "MCAN Mortgage",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": "remote",
    "employment_types": [
      "fulltime"
    ],
    "location_city": "Vancouver",
    "location_region": "BC",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:16:25.202890+00:00",
    "posted_days_ago": null,
    "dedupe_key": "2931f1d6d8dba7c5aef5b998de5b31ebe2b6dd0d"
  }
]