[
  {
    "description": "**Renewal Account Manager**\n\n**MCAP at a Glance**\n\n\nJoining MCAP means you will be a part of our diverse workforce of highly talented individuals who are recognized for their expertise and success! At MCAP, your professional expertise, commitment to teamwork and passion for service excellence are recognized and rewarded with competitive total rewards offering, a career with continuous learning and development (formal \\& informal training), and exciting opportunities in a dynamic, entrepreneurial environment.\n\n**The Role**\n\n\nThis position is responsible for borrower retention and sales programs. Proactively contacting our borrowers with respect to their pending loan maturity and to sell them ancillary products is imperative to the continued growth of MCAP.\n\n\nThis position is assigned a segment of upcoming maturities each month. These loans are the exclusive responsibility of the Renewal Account Manager. Contacting borrowers potentially in advance of, and throughout the 90\\-days prior to their maturity date. The Account Manager is empowered to make rate offerings, discount terms, and offer incentives to retain business.\n\n\nThis position involves working a wide range of hours deemed to be the best fit for reaching the assigned portfolio of customers. The typical workday ranges from 8:00AM\\-8:00PM local time.\n\n\nBeing on the frontline, this role will have the opportunity to hear what customers are saying about MCAP products and services, as well as about policies and procedures at renewal / payout.\n\n\n**Sell**\n\n* Prioritize maturities assigned, determining the best contact strategy to reach borrowers\n* Make outbound contact (phone/email) with the assigned list and entice the customer to stay with MCAP for their upcoming mortgage renewal\n* Send personalized offers to borrowers based on conversations\n* Handle enhanced rate negotiations with borrowers during renewal period\n\n**Increase Mortgage Profitability**\n\n* Focus on profitability – gear customers into terms desired by MCAP\n* Promote MCAP products/services, discussing conversion, refinance and HMP opportunities\n\n**Report Consumer Opinion**\n\n* Provide feedback and insight to management through different methods of rate intelligence information gathering.\n\n**What You Bring To The Team**\n\n* Sales experience\n* Experience in the finance/mortgage industry\n* Contact Centre/Retention\n* Exceptional oral and written communication skills\n* Excellent organizational and time\\-management skills\n* Ability to multi\\-task in a fast\\-paced environment\n* Strong analytical and problem solving skills\n* Proven ability to foster relationships\n* Strong customer service skills\n* Self\\-driven, motivated with the ability to work independently and in a team environment\n* Carries out duties with integrity and takes responsibility for actions.\n* Flexible work hours\n* High School degree (or equivalent)\n* Mortgage Agent Course (preferred)\n\n\nIf this sounds like you and you are looking to be a part of one of Canada’s largest independent mortgage finance companies, then we want to hear from you!\n\n**Be A Part Of Something Great**  \n\n  \n\nMCAP is Canada’s largest independent Mortgage Finance company with over $150 billion in assets under management providing mortgage solutions for residential and commercial properties. For over 35 years, MCAP originates, trades, securitizes and services mortgages in offices across Canada. MCAP originates residential mortgages exclusively through the mortgage broker channel as we believe that a professional mortgage broker is a consumer's best option and MCAP actively promotes the services of mortgage brokers across the country. MCAP is also a leader in the Canadian residential construction lending market with over 25 years in the business. Our teams of dedicated professionals serve a variety of developer, construction and lender clients across Canada.\n\n**Position \\#:** req2129\n\n**Employment Status:** Permanent Full Time\n\n**Location:** Multiple Locations Available \\- Toronto, Waterloo, Calgary and Vancouver\n\n**Number Of Openings:** 6\n\n**Department:** Residential\n\n**Internal Job Title:** Renewal Account Manager\n\n**Salary Range:** $65,000 \\- $80,000\n\n  \n\nThe above information in this description has been designed to indicate the general nature and level of work performed by employees in the position. It is not designated to contain a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to this job.\n\n  \n\nMCAP provides equal opportunities for all applicants and is committed to fostering an inclusive, accessible environment, where all employees feel valued, respected and supported throughout the recruitment and employment process. If you require accommodation, we will work with you to meet your needs.",
    "id": "in-15d4607421b1b091",
    "currency": "CAD",
    "site": "indeed",
    "location": "Calgary, AB, CA",
    "company": "MCAP",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=15d4607421b1b091",
    "title": "Renewal Account Manager",
    "date_posted": "2026-01-08",
    "job_type": "fulltime",
    "max_amount": 150.0,
    "min_amount": 150.0,
    "job_url_direct": "https://mcap.csod.com/ux/ats/careersite/1/home/requisition/2129?c=mcap",
    "company_group": "MCAP",
    "company_search_term": "MCAP",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": [
      "fulltime"
    ],
    "location_city": "Calgary",
    "location_region": "AB",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:31.145234+00:00",
    "posted_days_ago": null,
    "dedupe_key": "d9256bb6c3f8c3c969b1fe8df457e8d0e86ee278"
  },
  {
    "description": "**Mortgage Solutions Associate**\n\n**MCAP at a Glance**\n\n\nJoining MCAP means you will be a part of our diverse workforce of highly talented individuals who are recognized for their expertise and success! At MCAP, your professional expertise, commitment to teamwork and passion for service excellence are recognized and rewarded with competitive total rewards offering, a career with continuous learning and development (formal \\& informal training), and exciting opportunities in a dynamic, entrepreneurial environment.\n\n**The Role**\n\n\nThis position is responsible for the success of borrower retention and facilitation of the borrower financing experience. A Mortgage Solutions Associate promotes financing and renewal options for files across multiple brands to achieve borrower financing needs in a timely manner, along with preventing early payout and promoting ancillary services.\n\n\nThis position is empowered to understand homeowners needs and requirements in order to suggest and recommend the best solutions and finance options, while utilizing underwriting policies to make preliminary decisions regarding borrower qualifications, interest rate discounting, blended rate calculations, and penalty amounts related to refinancing, porting.\n\n\nThis position involves flexibility with hours to ensure the best borrower experience across Canada. The Internal Broker department currently manages an inbound queue during the hours of 8:00AM – 7:00PM EST in conjunction with managing outbound call efforts as needed across Canada. It is expected that an Mortgage Solutions Associate be able to work any time during the available hours within the current hours of operation.\n\n**Provide Financing Solutions**\n\n* Review financial situation of borrowers (includes preliminary analyzing of income, assets, liabilities and credit bureau details while assessing the borrower’s ability to qualify for the requested solution)\n* Utilize product options and borrower goals to suggest products and terms that are mutually beneficial to borrowers, MCAP, and investors\n* Offer interest rates and Penalty quotes\n* Complete an application and pull Credit Bureau to hand off warm lead to Internal Broker\n\n**Promote Options (Ancillary \\& Retention)**\n\n* Promote applicable lender product options and services such Mortgage Life Insurance, Disability Insurance, and Home Warranty options\n* Promote and educate on features and benefits of existing mortgage product to retain borrowers when financing unavailable or unwarranted and offer advice on how the client may qualify in the future\n* Provide renewal rates and produce renewal offers to hand off to Renewal Account Manager\n\n**Report Consumer Opinion**\n\n* Assist with respect to enhancing the overall borrower experience, both mid\\-term and at maturity. Provide feedback and insight to management\n\n**What You Bring To The Team**\n\n* Solid understanding of MARS, MARSweb, SharePoint, CIC, Investor and Insurer guidelines\n* Mortgage Servicing or Origination Industry experience (minimum 2 years)\n* Customer Service and/or Retention experience\n* Strong negotiation and retention skills\n* Ability to foster and maintain relationships\n* Exceptional oral and written communication skills with emphasis on educating\n* Attention to detail\n* Flexible working hours\n* Strong analytical and problem solving skills\n* Exceptional oral and written communication skills\n* Excellent organizational and time\\-management skills\n* Ability to multi\\-task in a fast\\-paced environment\n* Ability to remain calm in stressful situations\n* Carries out duties with integrity and takes responsibility for actions\n* Self\\-driven and motivated with the ability to work independently and in a team environment\n* University Degree/College Diploma\n* Completion or ability to complete Mortgage agent license course to satisfy provincial regulatory requirements within 6 months of start date\n\nIf this sounds like you and you are looking to be a part of one of Canada’s largest independent mortgage finance companies, then we want to hear from you!\n\n**Be A Part Of Something Great**  \n\n  \n\nMCAP is Canada’s largest independent Mortgage Finance company with over $150 billion in assets under management providing mortgage solutions for residential and commercial properties. For over 35 years, MCAP originates, trades, securitizes and services mortgages in offices across Canada. MCAP originates residential mortgages exclusively through the mortgage broker channel as we believe that a professional mortgage broker is a consumer's best option and MCAP actively promotes the services of mortgage brokers across the country. MCAP is also a leader in the Canadian residential construction lending market with over 25 years in the business. Our teams of dedicated professionals serve a variety of developer, construction and lender clients across Canada.\n\n**Position \\#:** req2128\n\n**Employment Status:** Permanent Full Time\n\n**Location:** Multiple Locations Available \\- Toronto, Calgary, Vancouver and Waterloo\n\n**Number Of Openings:** 4\n\n**Department:** Residential\n\n**Internal Job Title:** Mortgage Solutions Associate\n\n**Salary Range:** $55,000 \\- $60,000\n\n  \n\nThe above information in this description has been designed to indicate the general nature and level of work performed by employees in the position. It is not designated to contain a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to this job.\n\n  \n\nMCAP provides equal opportunities for all applicants and is committed to fostering an inclusive, accessible environment, where all employees feel valued, respected and supported throughout the recruitment and employment process. If you require accommodation, we will work with you to meet your needs.",
    "id": "in-672dacef4462e97f",
    "currency": "CAD",
    "site": "indeed",
    "location": "Calgary, AB, CA",
    "company": "MCAP",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=672dacef4462e97f",
    "title": "Mortgage Solutions Associate",
    "date_posted": "2026-01-08",
    "job_type": "fulltime",
    "max_amount": 150.0,
    "min_amount": 150.0,
    "job_url_direct": "https://mcap.csod.com/ux/ats/careersite/1/home/requisition/2128?c=mcap",
    "company_group": "MCAP",
    "company_search_term": "MCAP",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": [
      "fulltime"
    ],
    "location_city": "Calgary",
    "location_region": "AB",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:31.146937+00:00",
    "posted_days_ago": null,
    "dedupe_key": "4a22572ccc01c87c9fc51dce4fbc2e9dafed136b"
  },
  {
    "description": "**Director, Finance**\n\n**MCAP at a Glance**\n\n\nJoining MCAP means you will be a part of our diverse workforce of highly talented individuals who are recognized for their expertise and success! At MCAP, your professional expertise, commitment to teamwork and passion for service excellence are recognized and rewarded with competitive total rewards offering, a career with continuous learning and development (formal \\& informal training), and exciting opportunities in a dynamic, entrepreneurial environment.\n\n**The Role**\n\n\nThis position will be responsible for working closely with Finance and leadership teams to provide financial reporting and analytics as it relates to monthly financial results, quarterly financial statements and MD\\&A, strategic projects, budgeting, and various ad\\-hoc materials for the management and the board.\n\n\n**Strategic Planning \\& Analysis**\n\n\n* Assist the Sr. Director in developing a long\\-term vision and strategy by providing relevant and requested analyses, developing processes and/or models.\n* Assist in the development of Key Performance Indicators to be monitored by management.\n* Assist in developing strategically relevant financial plan and forecast processes for the line of business that will identify the needs of the business and opportunities that will result in meeting or exceeding targets.\n* Provide financial input to the development of business strategies and in the review of performance.\n* Oversee the assessment, and evaluation of all proposed new projects to optimize the delivery of target outcomes for the right level of investment.\n* Oversee the financial modeling for strategic projects which accords with best practice and identifies risks, issues and assumptions which enables the senior management team to make and implement effective decisions and mitigation strategies.\n\n**Financial Reporting**\n\n\n* Responsible for producing the monthly enterprise\\-wide financial results, incl. analytics, commentary and ad\\-hoc analysis as required.\n* Responsible for accuracy of data extraction and interpretation of data from various information sources and systems\n* Perform analysis and generate insights of financial statements line items, business units and specific areas of focus\n* Responsible to review and approve high risk journal entries and B/S reconciliations\n* Coach the team and enhance underlying reporting processes to improve the financial reporting speed and quality of the data and insights.\n* Prepare and/or review quarterly consolidated Financial Statements and MD\\&A, incl. underlying working papers as required; Review legal entity stand\\-alone annual Financial statements\n* Ensure accurate and timely submission of routine and ad\\-hoc financial information to regulatory bodies and other stakeholders such as STATSCAN, Broker Reporting, DBRS, etc.\n\n**Management Reporting**\n\n\n* Own segmented reporting and business\\-level P\\&L, for both management purposes and preparing for additional disclosure to segments externally.\n* Ensure financial management reporting and processes are in place to support the ongoing and future needs of the line of business.\n* Develop and enhance the monthly business unit reporting and analysis, including key metrics reports, conduct ad\\-hoc financial analysis as required.\n\n**Budgeting**\n\n\n* Participate in the annual budgeting and planning process; administer and review financial plans and budgets, laisse with businesses partners and stakeholder across the organization to develop adequate assumptions; monitor progress and changes and keep senior leadership team abreast of the line of business’s financial status.\n* Provide ongoing financial modeling and analysis expertise to business partners.\n* Conduct the financial modeling and analysis to support the development of long\\-term strategic initiatives and business plans.\n\n**Enhance Financial Analysis and Other**\n\n\n* Work closely with the Senior Director to define, scope and implement enhancements to working practices, processes, Financial Models, Financial Analysis and Reporting.\n* Identify and implement opportunities to improve the accuracy, validation, and organization of financial analysis, while streamlining processes and reporting to reduce redundancy, automate tasks, and minimize manual effort, time and risk of error.\n* Structure key processes and develop relevant background documentation with a view to enhance efficiencies and manage risk.\n* Effectively prepares detailed analysis and memos on accounting treatment of transactions.\n\n**Lead and Manage Staff**\n\n\n* Foster a positive and productive work environment, encouraging open communication and collaboration among team members; Resolve conflicts that may arise, addressing issues promptly and fairly\n* Demonstrate strong performance management skills, effectively setting and communicating expectations, identifying development opportunities, and coaching team members to achieve their full potential.\n* Establish, monitor and communicate performance standards to direct reports reinforcing individual results, work quality, continuous improvement, teamwork and achievement of MCAP’s objectives.\n* Ensure that accountability is shared across the team, empowering members to take responsibility for their work and encouraging open communication about success.\n* Ensure a continuous improvement culture is established and encouraged.\n\n**What You Bring To The Team**\n\n* Minimum 8 years of progressive and relevant work experience in accounting and FP\\&A\n* Knowledge of financial statements and management reporting\n* Knowledge in mortgages, securitization, derivatives or other financial products would be an advantage\n* Experience overseeing/reviewing junior Team members’ work\n* Highly skilled in using MS Office (Excel, Access, PowerPoint and Word)\n* Advanced Microsoft Excel skills, such as Pivot Tables, Nestled “IF” Statements, VLOOKUP, OFFSET, SUMIFS, MATCH\\-INDEX, etc. to build efficient and accurate financial models\n* Ability to analyze financial and investment analyses and understand how to use this information to drive projects that will impact the business.\n* Ability to interpret and question data inputs to financial models and support alternative recommendations as necessary.\n* Ability to think strategically, anticipate future consequences and trends while incorporating this into the financial plan.\n* Strong business acumen\n* Ability to manage complex projects through to an end point\n* Ensure key information is provided to team regarding business issues, changes in account status, etc.\n* Construct and deliver accurate, honest and timely performance management documents\n* Relationship building and rapport skills\n* Influencing and networking skills\n* Ability to communicate effectively at all levels\n* Ability to demonstrate credibility, confidentiality and responsibility in all member/client interactions\n* Ability to write reports, business correspondence, and procedure manuals.\n* Ability to effectively present information and respond to questions from Line of Business Leaders.\n* Ability to gain trust of high\\-level management and leverage relationships to provide best possible financial plans and drive impactful analytical projects.\n* Excellent organizational and time\\-management skills\n* Ability to multi\\-task in a fast paced environment\n* Strong analytical and problem solving skills\n* Proven ability to foster relationships\n* Strong customer service skills.\n* Self\\-driven, motivated with the ability to work independently and in a team environment\n* Carries out duties with integrity and takes responsibility for actions\n* University degree\n* CPA Designation (must have)\n\nIf this sounds like you and you are looking to be a part of one of Canada’s largest independent mortgage finance companies, then we want to hear from you!\n\n**Be A Part Of Something Great**  \n\n  \n\nMCAP is Canada’s largest independent Mortgage Finance company with over $150 billion in assets under management providing mortgage solutions for residential and commercial properties. For over 35 years, MCAP originates, trades, securitizes and services mortgages in offices across Canada. MCAP originates residential mortgages exclusively through the mortgage broker channel as we believe that a professional mortgage broker is a consumer's best option and MCAP actively promotes the services of mortgage brokers across the country. MCAP is also a leader in the Canadian residential construction lending market with over 25 years in the business. Our teams of dedicated professionals serve a variety of developer, construction and lender clients across Canada.\n\n**Position \\#:** req2130\n\n**Employment Status:** Permanent Full Time\n\n**Location:** Toronto; Ontario\n\n**Number Of Openings:** 1\n\n**Department:** Finance\n\n**Internal Job Title:** Director, Finance\n\n**Salary Range:** $115,000 \\- $130,000\n\n  \n\nThe above information in this description has been designed to indicate the general nature and level of work performed by employees in the position. It is not designated to contain a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to this job.\n\n  \n\nMCAP provides equal opportunities for all applicants and is committed to fostering an inclusive, accessible environment, where all employees feel valued, respected and supported throughout the recruitment and employment process. If you require accommodation, we will work with you to meet your needs.",
    "id": "in-46c84374f83c7170",
    "currency": "CAD",
    "site": "indeed",
    "location": "Toronto, ON, CA",
    "company": "MCAP",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=46c84374f83c7170",
    "title": "Director, Finance",
    "date_posted": "2026-01-08",
    "job_type": "fulltime",
    "max_amount": 150.0,
    "min_amount": 150.0,
    "job_url_direct": "https://mcap.csod.com/ux/ats/careersite/1/home/requisition/2130?c=mcap",
    "company_group": "MCAP",
    "company_search_term": "MCAP",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": [
      "fulltime"
    ],
    "location_city": "Toronto",
    "location_region": "ON",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:31.143713+00:00",
    "posted_days_ago": null,
    "dedupe_key": "5c97df2582d5d6dd837ed1932ef47da30804787f"
  },
  {
    "description": "**Broker Relationship Manager**\n\n**MCAP at a Glance**\n\n\nJoining MCAP means you will be a part of our diverse workforce of highly talented individuals who are recognized for their expertise and success! At MCAP, your professional expertise, commitment to teamwork and passion for service excellence are recognized and rewarded with competitive total rewards offering, a career with continuous learning and development (formal \\& informal training), and exciting opportunities in a dynamic, entrepreneurial environment.\n\n**The Role**\n\n\nThis position is responsible for acting as the primary relationship contact for MCAP’s strategic Broker partners. The Broker Relationship Manager will focus their attention on assembling and growing a portfolio of brokers, developing relationships with and providing them with high levels of service including underwriting activities.\n\n\nThe Broker Relationship Manager will be accountable for the annual achievement of specific targets set at the beginning of each fiscal year.\n\n\n**Relationship Management**\n\n\n* Within a defined geographic territory, promote the growth of profitable residential mortgages through effective business development by:\n* Creating awareness through :\n\t+ Providing product, program, and policy training to brokers;\n\t+ Maintaining an appropriate level of regular contact with the established broker portfolio based on projected achievement levels, through various mediums;\n\t+ Developing Broker knowledge of our products, policies and processes to improve the efficiency of each broker relationship.\n* Increase results with existing MCAP Strategic Brokers by:\n\t+ Identifying unforeseen needs and opportunities and construct a plan to address these opportunities;\n\t+ Utilizing sales and marketing to add additional value to the broker;\n\t+ Negotiating with brokers to gain a commitment on volume;\n* Identify new/potential Brokers/Brokerages by:\n\t+ Working with underwriting team to identify and add new brokers to the strategic partner list.\n* Perform relationship building activities in a professional manner and encouraging an open communication with respect to market trends and competitive intelligence.\n* Hold brokers accountable to committed volumes, funding ratios, and any other metrics as determined by MCAP.\n* Respond to questions or concerns from all clients with the intent to build/maintain relationships.\n* Provide all clients with mortgage options to assist in making an informed decision.\n* Maintain agreed upon turnaround time on applications and respond to questions and concerns received from clients via email, fax, phone calls or portal discussion within agreed upon time of receipt to ensure timely and accurate completion of each mortgage transaction.\n* Track and monitor broker performance for improvement of efficiency or managing appropriate action in the event that all efforts to improve fail.\n\n\n**Marketing and Communication**\n\n\n* Plan, schedule and conduct sales presentations and regular follow\\-up meetings with key brokers to establish relationships and further our success in meeting the company’s goals for growth of the mortgage portfolio.\n* Develop a thorough knowledge of mortgage products, policies and procedures, to facilitate promotion of our offerings with mortgage brokers and their customers.\n* Represent MCAP at industry related meetings and events.\n* Develop and tailor sales / campaign promotional materials, to be specific to meeting the needs of the targeted market.\n* Provide support tools to assist brokers with their client interactions (product information, pricing and ways to counter objections and solidify deal).\n* Communicate on a timely and regular basis the following:\n\t+ Rate updates\n\t+ Incentive programs\n\t+ Program and policy updates\n\t+ Education\n\t+ Other\n\n\n**Planning**\n\n\n* Develop an annual strategic and account plan for each broker.\n* Create a touch\\-point strategy to organize work week with calls and underwriting files.\n* Update and maintain all broker information for strategic partners.\n\n\n**Reporting**\n\n\n* Create and assemble weekly/monthly reporting to management team regarding funded and commitment volumes and closing ratios.\n* Create and distribute monthly reporting to brokers on funded volumes\n\n\n**Underwriting**\n\n\n* Contribute to the effective processing and approval of mortgage applications by:\n\t+ Effectively communicating company’s lending policy and procedures to brokers; so that Brokers have a thorough knowledge of our lending requirements, and qualifying parameters;\n\t+ Determining and obtaining all pertinent credit information such as proof of income, down payment confirmation and etc., and conducting appropriate due diligence thereon in order to meet credit and quality standards, including anti\\-money laundering and anti\\-terrorist financing standards and maintain desired reputation;\n\t+ Issuing and following\\-up on commitments;\n\t+ Obtaining Mortgage Insurer approval for insured loans;\n\t+ Ordering and reviewing appraisals for all conventional mortgages.\n* Monitor mortgage broker activities and bring any activities which appear worthy of further investigation to the attention of appropriate officers.\n* Adjudicate information presented and address any discrepancies or inconsistencies.\n* Document the deal and write up rationale to support recommendation for approval.\n* Condition the deal in accordance with the recommendation for approval.\n* Delivers quick and creative mortgage solutions in order to structure files in order to meet company guidelines.\n\n**What You Bring To The Team**\n\n* Minimum 5 years underwriting experience\n\n\nOR\n\n* Minimum 5 years sales experience – Financial Services preferred but not mandatory Thorough knowledge of the pertinent Real Estate market, competitor innovations, trends and developments\n* Results oriented\n* Creative and innovative\n* Exceptional verbal and written communication skills\n* Excellent organizational and time\\-management skills\n* Excellent presentation skills\n* Ability to build meaningful and trusting relationships\n* Ability to multi\\-task in a fast paced environment\n* Effective negotiation and influence skills\n* Strong analytical and problem solving skills\n* Strong customer service skills.\n* Self\\-driven, motivated with the ability to work independently and in a team environment\n* Carries out duties with integrity and takes responsibility for actions.\n* University Degree / Post\\-Secondary education\n* Accredited Mortgage Professional (AMP, preferred) or courses to satisfy provincial regulatory requirements\n\n\nIf this sounds like you and you are looking to be a part of one of Canada’s largest independent mortgage finance companies, then we want to hear from you!\n\n**Be A Part Of Something Great**  \n\n  \n\nMCAP is Canada’s largest independent Mortgage Finance company with over $150 billion in assets under management providing mortgage solutions for residential and commercial properties. For over 35 years, MCAP originates, trades, securitizes and services mortgages in offices across Canada. MCAP originates residential mortgages exclusively through the mortgage broker channel as we believe that a professional mortgage broker is a consumer's best option and MCAP actively promotes the services of mortgage brokers across the country. MCAP is also a leader in the Canadian residential construction lending market with over 25 years in the business. Our teams of dedicated professionals serve a variety of developer, construction and lender clients across Canada.\n\n**Position \\#:** req2125\n\n**Employment Status:** Permanent Full Time\n\n**Location:** Atlantic Canada\n\n**Number Of Openings:** 1\n\n**Department:** Residential\n\n**Internal Job Title:** Broker Relationship Manager\n\n  \n\nThe above information in this description has been designed to indicate the general nature and level of work performed by employees in the position. It is not designated to contain a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to this job.\n\n  \n\nMCAP provides equal opportunities for all applicants and is committed to fostering an inclusive, accessible environment, where all employees feel valued, respected and supported throughout the recruitment and employment process. If you require accommodation, we will work with you to meet your needs.",
    "id": "in-bb0bfee6610b3f55",
    "currency": "CAD",
    "site": "indeed",
    "location": "Halifax, NS, CA",
    "company": "MCAP",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=bb0bfee6610b3f55",
    "title": "Broker Relationship Manager",
    "date_posted": "2025-12-19",
    "job_type": "fulltime",
    "max_amount": 150.0,
    "min_amount": 150.0,
    "job_url_direct": "https://mcap.csod.com/ux/ats/careersite/1/home/requisition/2125?c=mcap",
    "company_group": "MCAP",
    "company_search_term": "MCAP",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": [
      "fulltime"
    ],
    "location_city": "Halifax",
    "location_region": "NS",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:31.149352+00:00",
    "posted_days_ago": null,
    "dedupe_key": "24f6db826bd3af4cce6f965b7c29253b5678e5b6"
  },
  {
    "description": "**Business Development Manager**\n\n**MCAP at a Glance**\n\n\nJoining MCAP means you will be a part of our diverse workforce of highly talented individuals who are recognized for their expertise and success! At MCAP, your professional expertise, commitment to teamwork and passion for service excellence are recognized and rewarded with competitive total rewards offering, a career with continuous learning and development (formal \\& informal training), and exciting opportunities in a dynamic, entrepreneurial environment.\n\n**The Role**\n\n\nAs a Business Development Manager at MCAP, you will be responsible for identifying, developing, and securing new business opportunities to drive revenue growth and expand market presence. You will leverage tools like Microsoft 365 and Salesforce to manage client relationships, track performance, and collaborate across departments. This role requires a strategic thinker with a strong sales acumen, excellent communication skills, and a passion for building long\\-term partnerships. The Business Development Manager will be accountable for annual achievement of specific targets set at the beginning of each fiscal year. The primary focus is on funded volume with additional secondary targets based on other business unit priorities as set by the VP, Sales (i.e. Funding Ratios).\n\n\n**This role will work primarily out of a remote home office with travel required to broker offices and industry events. The territory for this position is the Atlantic Canada region. BDMs must possess a valid driver’s license at all times.**\n\n\n**Relationship Management – Retain, Grow, \\& Acquire**\n\n\n* Cultivate meaningful broker relationships through proactive support and communication\n* Cross\\-functional Collaboration: Work closely with marketing, product, and operations teams to align business development efforts with company objectives\n* Create awareness of MCAP products with Mortgage Brokers by:\n\t+ Presenting to small or large groups selling value proposition\n\t+ Position products and services\n* Increase results with existing MCAP Mortgage Brokers\n\t+ Apply Know Your Client (KYC) principles to uncover broker needs and develop tailored strategic plans\n\t+ Utilize sales and marketing programs to add additional value to the broker relationship (i.e. Mpoints loyalty program)\n\t+ Negotiate with brokers to gain a commitment on volume, funding ratios, and other metrics and follow\\-up for accountability\n* Identify new/potential Brokers/Brokerages\n\t+ On a frequent basis, contact potential new brokers and set up appointments to present MCAP’s value proposition\n\t+ Inform and educate new brokers on products and programs\n* Engage brokers with professionalism and strategic dialogue focused on market trends and business opportunities\n* The use of agendas for scheduled meetings, accompanied with broker score card and co\\-agent reporting\n* 10 – 12 meetings per week are required in this role with a mix of face\\-to\\-face and virtual\n\n\n**Marketing**\n\n\n* Design and execute territory\\-specific marketing initiatives tailored to local broker needs, market dynamics, and MCAP priorities\n* Share relevant insights such as local housing trends, rate movement impacts, and “MCAP Did You Know?” updates to position MCAP as a strategic partner\n* Leverage Salesforce to track broker engagement, log outreach activities, and share timely, personalized updates.\n* Represent MCAP at local industry events, networking sessions, and broker\\-hosted functions to build visibility and trust\n* Support brand presence at tradeshows by engaging attendees\n\n\n**Planning**\n\n\n* Develop an annual strategic territory and account plan\n* Create a touch\\-point strategy to organize work week, meetings and presentations\n* Identify the Broker’s business style and personal attributes in order to foster a strong working relationship with MCAP\n* Follow up on leads in a timely manner in order to capitalize on the opportunity to increase our customer base\n\n\n**Reporting and Administration**\n\n\n* Update and maintain all broker information within Saleforce\n* Complete full Know Your Client (KYC) profiles for all Submission Agents within Salesforce\n* Assist in registration and changes of MCAP Broker/Brokerage profiles\n* Log all daily activity in Salesforce \\- maintaining minimum levels\n* Manage monthly expenses prudently to assist in growth of the business\n\n**What You Bring To The Team**\n\n* Minimum 5 years sales experience – Financial Services preferred\n\n\nOR\n\n\n* Minimum 2 years mortgage underwriting experience\n* Results oriented\n* Creative and innovative\n* Exceptional verbal and written communication skills\n* Excellent organizational and time\\-management skills\n* Excellent presentation skills – including virtual\n* Ability to build meaningful and trusting relationships internally and externally\n* Ability to multi\\-task in a fast\\-paced environment\n* Effective negotiation and conflict resolution skills\n* Strong analytical and problem\\-solving skills\n* Proficient with Microsoft 365 including Outlook and Teams\n* Tech savvy, including use of video for communication\n* Strong customer service skills\n* Self\\-driven, motivated with the ability to work independently and in a team environment\n* Carries out duties with integrity and takes responsibility for actions.\n* Thorough knowledge of mortgage broker network and emerging industry trends\n* Deep understanding of mortgage lending principles, including high\\-ratio, conventional, refinance, and purchase transactions\n* Ability to interpret and communicate policy changes to brokers clearly and accurately\n* Experience navigating underwriting guidelines and documentation requirements\n* University Degree\n* Accredited Mortgage Professional (AMP, preferred) or courses to satisfy provincial regulatory requirements\n* For the province of British Columbia, BCFSA mortgage broker license required\n\n\nIf this sounds like you and you are looking to be a part of one of Canada’s largest independent mortgage finance companies, then we want to hear from you!\n\n**Be A Part Of Something Great**  \n\n  \n\nMCAP is Canada’s largest independent Mortgage Finance company with over $150 billion in assets under management providing mortgage solutions for residential and commercial properties. For over 35 years, MCAP originates, trades, securitizes and services mortgages in offices across Canada. MCAP originates residential mortgages exclusively through the mortgage broker channel as we believe that a professional mortgage broker is a consumer's best option and MCAP actively promotes the services of mortgage brokers across the country. MCAP is also a leader in the Canadian residential construction lending market with over 25 years in the business. Our teams of dedicated professionals serve a variety of developer, construction and lender clients across Canada.\n\n**Position \\#:** req2123\n\n**Employment Status:** Permanent Full Time\n\n**Location:** Halifax; Nova Scotia\n\n**Number Of Openings:** 1\n\n**Department:** Residential\n\n**Internal Job Title:** Business Development Manager\n\n**Territory:** Atlantic Canada\n\n  \n\nThe above information in this description has been designed to indicate the general nature and level of work performed by employees in the position. It is not designated to contain a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to this job.\n\n  \n\nMCAP provides equal opportunities for all applicants and is committed to fostering an inclusive, accessible environment, where all employees feel valued, respected and supported throughout the recruitment and employment process. If you require accommodation, we will work with you to meet your needs.",
    "id": "in-6cfe23b6554df3f0",
    "currency": "CAD",
    "site": "indeed",
    "location": "Halifax, NS, CA",
    "company": "MCAP",
    "interval": null,
    "is_remote": true,
    "job_url": "https://ca.indeed.com/viewjob?jk=6cfe23b6554df3f0",
    "title": "Business Development Manager",
    "date_posted": "2025-12-15",
    "job_type": "fulltime",
    "max_amount": 150.0,
    "min_amount": 150.0,
    "job_url_direct": "https://mcap.csod.com/ux/ats/careersite/1/home/requisition/2123?c=mcap",
    "company_group": "MCAP",
    "company_search_term": "MCAP",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": "remote",
    "employment_types": [
      "fulltime"
    ],
    "location_city": "Halifax",
    "location_region": "NS",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:31.151236+00:00",
    "posted_days_ago": null,
    "dedupe_key": "eb9fe15553a1a46dd283a5be796ae2a0b96531d5"
  },
  {
    "description": "**Bilingual HR Generalist \\- Contract**\n\n**MCAP at a Glance**\n\n\nJoining MCAP means you will be a part of our diverse workforce of highly talented individuals who are recognized for their expertise and success! At MCAP, your professional expertise, commitment to teamwork and passion for service excellence are recognized and rewarded with competitive total rewards offering, a career with continuous learning and development (formal \\& informal training), and exciting opportunities in a dynamic, entrepreneurial environment.\n\n**The Role**\n\n\nThe Human Resources Advisor is responsible for working closely with members of the HR Team and the HR Leadership team to deliver HR solutions in order to build and sustain a high performance culture and engaged workforce. This position builds strong relationships with client groups and drives business results by championing people programs and executing on a variety of HR initiatives and programs to support business objectives and results.\n\n\nThis role will work in collaboration with the HR management team to successfully implement the HR strategy and deliver customer service within the organization.\n\n\nThe overall scope of this role includes: Business partnership, workforce \\& talent planning, change management, employee relations, performance management, and HR governance.\n\n\n**Business Partnership**\n\n\n* Develop effective, collaborative relationships and networking with all internal and external clients.\n* In collaboration with the HRBP leader, actively reach out to business leaders and managers and work with them to identify opportunities and provide solutions for HR program and practice improvement.\n* Coach business leaders and managers on HR and people management practices.\n* Promote and educate business leaders on Talent Management tools and solutions (i.e. learning, performance management, IDP’s, succession)\n* Assist managers in all areas of Human Resources as required (e.g. talent acquisition, employee relations, disability management, employee exits etc.)\n* Promote and maintain the utmost integrity and highest caliber of customer service to all employees, managers and clients to ensure needs are being met.\n* Respond to general questions on policies, procedures and programs to ensure correct interpretation and understanding.\n* In collaboration with the HRBP leader, assist managers to lead and facilitate change. Evaluate and support the impact of any proposed changes on employees, and manage change to minimize disruption to the business.\n* Deliver manager specific orientation i.e. compensation plans, performance management and processes.\n\n\n**Talent Acquisition**\n\n\n* Collaborate with Talent Acquisition to ensure high Hiring Manager and Candidate satisfaction\n* Collaborate with Talent Acquisition to promote talent processes and procedures, ensuring managers and employees are receiving information and support required (e.g., offer letters, onboarding processes)\n* When required, assist the Hiring Manager in onsite interviews to effectively identify skills, experience and potential, and make recommendations\n\n\n**Employee Relations**\n\n\n* Advise and investigate (when applicable) appropriate resolutions to employee relations issues to ensure appropriate MCAP policies and processes are being followed (e.g. Performance management, performance improvement plans, conflict resolution, terminations).\n* Coach and train managers on policies and processes to ensure that appropriate steps are taken in accordance with legislative requirements.\n* In collaboration with the HRBP leader, conduct workplace investigations (including Workplace Violence, Harassment \\& Discrimination, and Health \\& Safety) and report findings to HR Management team.\n* Coach and advise business units on staff engagement and team effectiveness.\n* Assist with post termination legal claims.\n* Conduct exit interviews with all departing employees.\n* Escalation point of contact for HR Associates/Specialists for complex employee relations, performance management and termination matters.\n* Support junior HR staff with complex disability management claims.\n\n\n**Performance Management**\n\n\n* Work as part of the team, ensuring that managers and employees receive support with all aspects of performance management.\n* Support the annual Performance Management and Individual Development process within the guidelines of the program.\n* Coach and advise managers and employees on individual development plans.\n* Mentor and counsel staff/managers to ensure that best practice is observed both in terms of appropriate legislation and the company’s policies.\n* Coach managers and provide resources to assist employees with career management discussions.\n\n\n**HR Governance**\n\n\n* Support the development, and maintenance of human resources policies, procedures and manuals to ensure compliance to all relevant HR legislation.\n* Support the development and maintenance of employee awareness training (i.e. AODA, Workplace Harassment) and annual Workplace Violence Risk Assessment.\n* In collaboration with the HRBP leader, support the annual review of the Code of Business Conduct training and record keeping.\n* In collaboration with the HRBP leader, support and maintain HR Audit framework; ensuring all controls are being adhered to; audit HR operations to ensure compliance with appropriate recording, record keeping and processes.\n* Support and maintain HR’s Business Continuity and Pandemic response plans.\n* Partner with Facilities to ensure Health and Safety program is compliant.\n\n\n**Business Unit Initiatives and Assigned Projects**\n\n\n* Collaborate and support the HRBP Leader on projects and strategic HR initiatives as required.\n* Lead projects and initiatives as assigned.\n* Collaborate and support HRBP Leader in implementing workforce changes.\n* Other duties as assigned, including assistance with HR team projects.\n\n\n**HR Reporting and Analysis**\n\n\n* Prepare standard reports from HRIS to support the needs of various business units.\n* Document HR processes and procedures for audit and compliance purposes (as required).\n\n\n**Compensation \\& Benefits**\n\n\n* Supports compensation and benefit related initiatives, such as coordination of the annual salary and incentive review (e.g. employee information review, distribution of Total Rewards Statement) and employee education on benefits.\n* Assist with creating and maintaining role profiles and applicable job evaluations for positions in the Lines of Business,\n* Support managers in setting objectives for their staff.\n\n\n**Mentor/Coach Junior HR Staff**\n\n\n* Mentor/coach HR Associates and/or HR Specialist on day to day HR work (processes, employee relations, legislation, business partnership, etc.)\n* Establish and maintain an effective system of communication throughout the business unit.\n* Ensure a continuous improvement culture is established and encouraged.\n\n***Occasional travel to our Waterloo office is required to support in\\-person collaboration and key business needs.***\n\n**What You Bring To The Team**\n\n* Minimum 3\\-4 years of progressive human resources experience.\n* French is required for this role.\n* Demonstrated strong knowledge of relevant legislation (i.e. Employment Standards Act, Human Rights Act, Health and Safety regulations, etc.)\n* Demonstrated experience with employee relations – proven ability to work independently on employee related concerns such as performance management, disciplinary action and conflict resolution\n* Relevant experience working with Line of Business leaders and Senior Managers.\n* Demonstrated HR experience in a multi\\-business unit environment.\n* Strong interpersonal skills and the ability to interface with all levels within the organization and external parties.\n* Excellent skills in MS Office and an understanding of HRIS systems.\n* Excellent verbal and written communication skills with all levels of the organization.\n* Proven diplomacy, tact, decision making and negotiation skills.\n* Ability to multi\\-task in a fast paced environment\n* Strong interpersonal skills and the ability to interface with all levels within the organization.\n* Build and foster relationships\n* Ability to pull resources together to meet deadlines.\n* Ability to work effectively in a diverse work group.\n* Confidence in influencing and interacting with line of business leaders.\n* Excellent problem\\-solving and conflict resolution skills\n* Excellent planning and project management skills\n* Carries out duties with integrity and takes responsibility for actions\n* University Degree\n* Working towards / obtained CHRL designation is an asset\n\n\nIf this sounds like you and you are looking to be a part of one of Canada’s largest independent mortgage finance companies, then we want to hear from you!\n\n**Be A Part Of Something Great**  \n\n  \n\nMCAP is Canada’s largest independent Mortgage Finance company with over $150 billion in assets under management providing mortgage solutions for residential and commercial properties. For over 35 years, MCAP originates, trades, securitizes and services mortgages in offices across Canada. MCAP originates residential mortgages exclusively through the mortgage broker channel as we believe that a professional mortgage broker is a consumer's best option and MCAP actively promotes the services of mortgage brokers across the country. MCAP is also a leader in the Canadian residential construction lending market with over 25 years in the business. Our teams of dedicated professionals serve a variety of developer, construction and lender clients across Canada.\n\n**Position \\#:** req2122\n\n**Employment Status:** Contract Full Time\n\n**Location:** Toronto; Ontario\n\n**Number Of Openings:** 1\n\n**Department:** Human Resources\n\n**Internal Job Title:** HR Advisor\n\n**Salary Range:** $70,000 \\- $75,000\n\n**Bilingual Premium:** $5,000\n\n  \n\nThe above information in this description has been designed to indicate the general nature and level of work performed by employees in the position. It is not designated to contain a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to this job.\n\n  \n\nMCAP provides equal opportunities for all applicants and is committed to fostering an inclusive, accessible environment, where all employees feel valued, respected and supported throughout the recruitment and employment process. If you require accommodation, we will work with you to meet your needs.",
    "id": "in-9677a6e4fd8d6c4e",
    "currency": "CAD",
    "site": "indeed",
    "location": "Toronto, ON, CA",
    "company": "MCAP",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=9677a6e4fd8d6c4e",
    "title": "Bilingual HR Generalist - Contract",
    "date_posted": "2025-12-12",
    "job_type": "fulltime, contract",
    "max_amount": 150.0,
    "min_amount": 150.0,
    "job_url_direct": "https://mcap.csod.com/ux/ats/careersite/1/home/requisition/2122?c=mcap",
    "company_group": "MCAP",
    "company_search_term": "MCAP",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": "onsite",
    "employment_types": [
      "contract",
      "fulltime"
    ],
    "location_city": "Toronto",
    "location_region": "ON",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:31.153888+00:00",
    "posted_days_ago": null,
    "dedupe_key": "454203185729c5b08aa560db4153fcb58f1ed3f4"
  },
  {
    "description": "**Property Tax and Document Specialist \\- Commercial Mortgages**\n\n**MCAP at a Glance**\n\n\nJoining MCAP means you will be a part of our diverse workforce of highly talented individuals who are recognized for their expertise and success! At MCAP, your professional expertise, commitment to teamwork and passion for service excellence are recognized and rewarded with competitive total rewards offering, a career with continuous learning and development (formal \\& informal training), and exciting opportunities in a dynamic, entrepreneurial environment.\n\n**The Role**\n\n\nAs one of the MCAP Group of Companies, MCAP Financial Corporation (“MCAP”) originates and services commercial mortgages and construction loans on behalf of its investors. Reporting to the Manager, Loan Servicing this role is responsible for post\\-funding activities on our commercial CMHC\\-insured and Conventional mortgages per the terms of our loan agreements, investor servicing agreements and established policies and procedures. This is a functional role across the portfolio with a key focus and understanding of municipal tax processing and commercial mortgage legal documentation. Additional responsibilities include payment processing, PPSA renewals, mortgage amendment processing and other functions as assigned while providing exceptional customer service to our Investors, Borrowers and internal contacts.\n\n\n**Tax Escrow Management**\n\n\n* Assume responsibility for the commercial mortgage portfolio’s tax escrow accounts by understanding tax installment due dates and processes for each municipality across Canada on the underlying mortgaged properties\n* Collect tax bills and prepare the backup to ensure the timely payment of tax disbursements to the municipality\n* Process tax disbursements to the mortgage system and reconcile the cash disbursements to the amount processed on the system\n* Prepare tax escrow analysis on mortgage accounts to ensure that sufficient funds are on hand to make the tax payments to the municipality and communicate any shortfalls or monthly payment changes to the borrower\n* Explore, test and pursue automation opportunities on the mortgage system as it relates to tax escrow functionality\n* Review and update procedures and policies as related to tax escrow management\n\n\n**Solicitor Final Reports**\n\n\n* Follow up for solicitor final reports within 45 days of funding to ensure that final, signed mortgage documents are received from solicitors and stored to the individual mortgage files to ensure that MCAP has a perfected security interest in the mortgaged property\n* Review solicitor final reports per the established procedures and document and follow up for any shortfalls or clarifications\n* Manage the solicitor final reports event on the system by knowing which events are coming due and which are past due. Maintain status notes on the system for any outstanding items and escalate past due events\n* Ensure that previous charges on title are discharged\n\n\n**PPSA Administration**\n\n\n* Maintain Personal Property Security Action (PPSA) renewals and amendments on the system\n* Liaise with borrowers and the third\\-party vendor on PPSA renewals and amendments\n* Review PPSA renewals and amendments received for accuracy and ensure evidence is saved to the mortgage file\n\n\n**Payment Processing and Daily Deposit Reconciliation**\n\n\n* Post payments and the payment of invoices to the mortgage system, daily, as required.\n* Prepare daily reconciliations, deposit slips and ensure cheques are deposited at the bank\n* Higher payment processing volumes occur on the first and fifth of the month with primary servicer payments coming in on the fifth\n* Pursue payment processing automation efficiencies on system\n\n\n**Mortgage Discharge Processing**\n\n\n* Handle all mortgage discharge legal documentation in a timely and professional manner to support the borrower in their satisfaction of the mortgage obligation\n* Liaise with solicitors on the execution of mortgage discharge documentation and ensure backup is maintained in the mortgage file.\n\n\n**Other Post\\-funding Activities**\n\n\n* Obtain and review quarterly CMBS reports from the primary servicer and follow up and escalate shortfalls\n* Participate in external and internal audits\n* Effectively liaise with other Commercial and Corporate teams such as Origination, Funding, Portfolio Management, Investor Operations, Finance and Treasury\n* Other activities as required to meet objectives of the Commercial Servicing unit\n\n**What You Bring To The Team**\n\n* 2\\+ years’ experience in mortgage administration with a focus on tax escrow administration and knowledge of commercial mortgage legal documentation\n* Experience working in a loan servicing system\n* CMB and CMBS commercial mortgage servicing knowledge is considered an asset\n* Proven track record of being a self\\-starter and taking initiative\n* Excellent time management skills with an ability to handle multiple tasks in a proactive manner\n* Excellent customer service skills\n* Proficient with Microsoft Outlook, MS Word, MS Excel, MS PowerPoint\n* Demonstrated ability to communicate and pursue automation and process efficiencies\n* Self\\-driven and motivated by desire to work in a dynamic environment where independent and teamwork is required\n* Proficient with numerical analysis and review of loan agreements\n* Strong analytical and organization skills\n* Effective verbal and written communication skills\n* French language skills are considered an asset\n* Post\\-secondary degree or diploma\n\n\nIf this sounds like you and you are looking to be a part of one of Canada’s largest independent mortgage finance companies, then we want to hear from you!\n\n**Be A Part Of Something Great**  \n\n  \n\nMCAP is Canada’s largest independent Mortgage Finance company with over $150 billion in assets under management providing mortgage solutions for residential and commercial properties. For over 35 years, MCAP originates, trades, securitizes and services mortgages in offices across Canada. MCAP originates residential mortgages exclusively through the mortgage broker channel as we believe that a professional mortgage broker is a consumer's best option and MCAP actively promotes the services of mortgage brokers across the country. MCAP is also a leader in the Canadian residential construction lending market with over 25 years in the business. Our teams of dedicated professionals serve a variety of developer, construction and lender clients across Canada.\n\n**Position \\#:** req2121\n\n**Employment Status:** Permanent Full Time\n\n**Location:** Toronto; Ontario\n\n**Number Of Openings:** 1\n\n**Department:** Commercial Mortgage\n\n**Internal Job Title:** Mortgage Specialist\n\n**Salary Range:** $48,500 \\- $54,000\n\n  \n\nThe above information in this description has been designed to indicate the general nature and level of work performed by employees in the position. It is not designated to contain a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to this job.\n\n  \n\nMCAP provides equal opportunities for all applicants and is committed to fostering an inclusive, accessible environment, where all employees feel valued, respected and supported throughout the recruitment and employment process. If you require accommodation, we will work with you to meet your needs.",
    "id": "in-cc97a73e51ead280",
    "currency": "CAD",
    "site": "indeed",
    "location": "Toronto, ON, CA",
    "company": "MCAP",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=cc97a73e51ead280",
    "title": "Property Tax and Document Specialist - Commercial Mortgages",
    "date_posted": "2025-12-11",
    "job_type": "fulltime",
    "max_amount": 150.0,
    "min_amount": 150.0,
    "job_url_direct": "https://mcap.csod.com/ux/ats/careersite/1/home/requisition/2121?c=mcap",
    "company_group": "MCAP",
    "company_search_term": "MCAP",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": [
      "fulltime"
    ],
    "location_city": "Toronto",
    "location_region": "ON",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:31.155947+00:00",
    "posted_days_ago": null,
    "dedupe_key": "60c858c921db00faa7824ab8b0f5f6322970cead"
  },
  {
    "description": "**Agile Team Lead (Infrastructure Enablement)**\n\n**MCAP at a Glance**\n\n\nJoining MCAP means you will be a part of our diverse workforce of highly talented individuals who are recognized for their expertise and success! At MCAP, your professional expertise, commitment to teamwork and passion for service excellence are recognized and rewarded with competitive total rewards offering, a career with continuous learning and development (formal \\& informal training), and exciting opportunities in a dynamic, entrepreneurial environment.\n\n**The Role**\n\n\nThis position is responsible for guiding an Agile Team to deliver work items based on goals and commitments the team has made to the Product Owner. The Team Lead inspires and empowers the agile team to self\\-organize and to optimize their processes, by acting as the servant\\-leader, and creating and maintaining the conditions that the team needs to be successful. The Team Lead coaches team members in agile practices to achieve higher levels of agile maturity. The Team Lead champions proper agile governance and provides financial and status reporting. The Team Lead works with other Team Leads to evolve agile practices and acts as a true disciplined Agile Leader.\n\n**Strategy and Planning**\n\n\n* Create a Vision document or business case.\n* Meet story readiness criteria.\n* Educate and coach story writers on proper content and format.\n* Populate, refine and prioritize the backlog.\n* Align backlog with Product Vision.\n* Obtain stakeholder feedback for evaluation of projects in progress, aligned to Business Unit objectives.\n* Identify issues and risks raised by team so Stakeholders can provide direction and decision\\-making.\n* Monitor Financial progress and validate for accuracy.\n* Monitor resourcing and progress toward commitments and ensure Stakeholders are informed of progress.\n* Forecast resourcing and ongoing requirements, and ensure Stakeholders are informed of progress.\n* Track progress and forecast budget expenditures.\n* Provide regular status reporting to Stakeholders.\n* Host Steering Committee Meetings\n* Research and pilot agile strategies and practices to find the right tools to deliver on MCAP’s goals.\n* Research and pilot performance measurements and reporting for governing agile teams.\n* Establish and recommend agile policies and best practices to improve overall end user experiences and reduce waste leading to increased ROI and improved outcome.\n* Collaborate with other Team Leads to ensure consistency across teams, and to facilitate movement of work or resources from team to team.\n* Partner with Team Leads to encourage a culture of continuous improvement.\n\n\n**Operational Management**\n\n\n* Facilitate Stand\\-ups where team members briefly state commitments and coordinate efforts\n* Participate and support Planning Sessions and Backlog Refinement, to ensure backlog items are ready for detailed planning\n* Host Stakeholder demos, providing opportunity for team members to showcase their work products\n* Facilitate Team Retrospectives, guiding team to identify, manage and track continuous improvement opportunities.\n* Facilitate discussion, decision\\-making, and resolving impediments to team success.\n* Lead team through lifecycle phases: Inception, Construction and Transition\n* Manage issues and risks\n* Ensure impediments to team’s progress are dealt with in a timely manner. Develop continuous improvement plan within agile team.\n* Maintain Agile Team Dashboard with KPIs such as velocity to provide data used for continuous improvement.\n* Empower team to identify opportunities to optimize processes and realize efficiencies.\n* Ensure resources are available to the team to deliver on their commitments.\n* Keep current with Agile Trends and MCAP Agile maturity. Learn, identify, and use agile best practices such as Agile Scrum, or Kanban.\n* Educate / inspire team members on agile practices.\n* Encourage full participation of team members within their defined roles and responsibilities.\n\n**What You Bring To The Team**\n\n* 2\\+ years’ experience in an Agile environment, as an Agile Coach, Team Lead, Tech Lead or Product Owner would be an asset\n* Experience in the Financial Services industry preferred\n* Excellent communication and mentoring skills\n* Experience using Azure DevOps or comparable agile delivery tools, would be an asset\n* Working knowledge of the software development lifecycle and methodologies.\n* Working knowledge of DevSecOps \\& Continuous Integration and Delivery\n* Organized and detail\\-oriented\n* Excellent facilitation skills\n* Proven leadership skills with a mission to support agile teams in achieving their goals\n* Strong interpersonal skills, including coaching and mentoring\n* Excellent communication and mentoring skills\n* Ability to work in and foster a team environment\n* Disciplined in how you perform your duties\n* Experience with Microsoft Office, Azure DevOps\n* Able to make decisions that are Risk and Value Driven\n* A self\\-starter, possessing a high degree of self\\-motivation\n* An experienced problem solver with a passion for continuous improvement\n* A coach, providing encouragement, an influencer and are full of positive energy\n* Ability to plan forward and manage ranged release plans\n* Post\\-secondary degree or diploma\n* Agile certification\n* PMP or PMI\\-ACP, preferred\n\n\nIf this sounds like you and you are looking to be a part of one of Canada’s largest independent mortgage finance companies, then we want to hear from you!\n\n**Be A Part Of Something Great**  \n\n  \n\nMCAP is Canada’s largest independent Mortgage Finance company with over $150 billion in assets under management providing mortgage solutions for residential and commercial properties. For over 35 years, MCAP originates, trades, securitizes and services mortgages in offices across Canada. MCAP originates residential mortgages exclusively through the mortgage broker channel as we believe that a professional mortgage broker is a consumer's best option and MCAP actively promotes the services of mortgage brokers across the country. MCAP is also a leader in the Canadian residential construction lending market with over 25 years in the business. Our teams of dedicated professionals serve a variety of developer, construction and lender clients across Canada.\n\n**Position \\#:** req2120\n\n**Employment Status:** Permanent Full Time\n\n**Location:** Waterloo; Ontario\n\n**Number Of Openings:** 1\n\n**Department:** Information Technology\n\n**Internal Job Title:** Agile Team Lead\n\n**Salary Range:** $90,000 \\- $105,000\n\n  \n\nThe above information in this description has been designed to indicate the general nature and level of work performed by employees in the position. It is not designated to contain a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to this job.\n\n  \n\nMCAP provides equal opportunities for all applicants and is committed to fostering an inclusive, accessible environment, where all employees feel valued, respected and supported throughout the recruitment and employment process. If you require accommodation, we will work with you to meet your needs.",
    "id": "in-baba34a13c5a5a0f",
    "currency": "CAD",
    "site": "indeed",
    "location": "Waterloo, ON, CA",
    "company": "MCAP",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=baba34a13c5a5a0f",
    "title": "Agile Team Lead (Infrastructure Enablement)",
    "date_posted": "2025-12-10",
    "job_type": "fulltime",
    "max_amount": 150.0,
    "min_amount": 150.0,
    "job_url_direct": "https://mcap.csod.com/ux/ats/careersite/1/home/requisition/2120?c=mcap",
    "company_group": "MCAP",
    "company_search_term": "MCAP",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": [
      "fulltime"
    ],
    "location_city": "Waterloo",
    "location_region": "ON",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:31.158027+00:00",
    "posted_days_ago": null,
    "dedupe_key": "119e3769b0fd990c6b6cfd18c46b38594c23f67e"
  },
  {
    "description": "**Sr. Director, Investment Management (Commercial)**\n\n**MCAP at a Glance**\n\n\nJoining MCAP means you will be a part of our diverse workforce of highly talented individuals who are recognized for their expertise and success! At MCAP, your professional expertise, commitment to teamwork and passion for service excellence are recognized and rewarded with competitive total rewards offering, a career with continuous learning and development (formal \\& informal training), and exciting opportunities in a dynamic, entrepreneurial environment.\n\n**The Role**\n\n\nThis position is responsible for supporting the successful growth of MCAP’s commercial insured lending programs in partnership with the VP, Investment Management and VP Origination and the VP Origination. Based in Toronto, the incumbent will be responsible for leading, developing and mentoring a team of analysts. Their team’s key accountabilities encompass underwriting, loan approval, loan sale, issue resolution, and reporting. The incumbent will support the VP Investment Management to manage key Investor relationships; this will include developing investment criteria and new funding programs, educating Investors on market conditions,\n\n\nOngoing accountabilities include maintaining and updating credit policies and standardized underwriting templates, overseeing the credit approval process with the CMB Investors and supporting the VP Investment Management in the implementation of short and long term business as it relates to products, policies and programs .\n\n\n**Loan Underwriting**\n\n\n* Pre\\-screen CMHC proposals determining whether they are suitable for MCAP investors.\n* Prioritize transactions to be underwritten and assign to appropriate staff.\n* Supervise and review completion of loan submission by staff per approved templates supported by appropriate due diligence.\n* Approve variances to funding conditions/items within discretionary authority.\n* Ensure team maintains Pipeline Reporting.\n\n\n**Loan Approval and Sale**\n\n\n* Approve CMHC transactions whether through securing investor consent or via delegated approval authority or by the investor.\n* Ensure that Commitment Letters have been issued in compliance with credit approval.\n* Resolve deal Issues within own approval authority, or escalate to the VP Investment and/or Investor, accompanied by fully considered recommendations.\n* Oversee the allocation and prioritization of loans to investors.\n* Under the direction of the VP Investment, work collaboratively with CMHC to resolve file level and policy level matters.\n\n**Planning and Product Promotion**\n\n* Subject matter expert for assigned line of business, supporting internal projects and resource for other business units.\n* Promote lending programs under responsibility to production, educating team in product eligibility requirements and pricing parameters.\n\n\n**Compliance and Risk Management**\n\n\n* Support the VP Investment Management in establishing and maintaining credit policies and procedures within the assigned line of business.\n* Maintain and develop standard business templates (i.e. u/w manual, comm letter, approved professionals, financial models, etc).\n* Compliance with MCAP policies (example allocation policy, delegated approval authorities) which would be managed through Investment Committee.\n\n\n**Co\\-Lead the Investment Management Team**\n\n\n* Support direct reports with hiring, training/coaching to ensure they all are competent in their positions.\n* Establish goals and provide guidance to encourage development of employees.\n* Conduct performance reviews for direct reports and provide staff with feedback.\n* Assist in the career development of direct reports.\n* Impart credit, risk, policy and market knowledge to direct reports.\n\n\n**Investor Management**\n\n\n* Investment Committee invitee\n* Under direction of VP Investment Management, support continued growth of assigned investor relationships.\n* Partner with loan administration group to ensure timely and accurate reporting provided to investors.\n* Under the guidance of the VP Investment Management, support the timely introduction and implementation of new investor relationships.\n\n\n**Lead and Manage Staff**\n\n\n* Champion the company’s Vision, Mission and Values as set out in the Strategic Plan both internally and externally within the industry.\n* Recruit and develop the right people that believe in and reflect in their behavior MCAP’s Values and culture.\n* Establish, monitor and communicate performance standards to direct reports reinforcing individual results, work quality, continuous improvement, teamwork and achievement of MCAP’s objectives.\n* Educate, coach and counsel staff to ensure they are empowered to effectively handle their roles in a confident and professional manner.\n* Establish and maintain an effective system of communication throughout the business unit.\n* Ensure a continuous improvement culture is established and encouraged.\n\n**What You Bring To The Team**\n\n* 10 years commercial lending experience\n* Previous leadership experience, hiring , coaching , building high performing teams\n* Experience with capital markets and structured finance\n* Strong background in CMHC Multi\\-family underwriting\n* Knowledge of conventional, commercial loan underwriting for office, retail, industrial, and other forms of commercial real estate\n* Knowledge and understanding of CMHC policies and procedures related to both term and construction of multi\\-residential property finance an asset\n* Expertise in credit adjudication\n* Recruiting and staff development experience.\n* Strong Marketing and negotiating skills\n* Problem solving and conflict resolution skills\n* Articulate logical arguments\n* Ability to work independently and within a team environment\n* Excellent oral and written communication skills\n* Detail\\-Oriented\n* Exceptional analytical and problem\\-solving skills\n* Proficient with MS Word, MS Excel, MS PowerPoint,\n* Ability to demonstrate initiative/confidence and is decisive.\n* Excellent relationship management skills\n* Excellent presentation skills\n* Ability to coach, mentor, and motivate employees\n* Preferably a bachelor degree in business/commerce\n\n\nIf this sounds like you and you are looking to be a part of one of Canada’s largest independent mortgage finance companies, then we want to hear from you!\n\n**Be A Part Of Something Great**  \n\n  \n\nMCAP is Canada’s largest independent Mortgage Finance company with over $150 billion in assets under management providing mortgage solutions for residential and commercial properties. For over 35 years, MCAP originates, trades, securitizes and services mortgages in offices across Canada. MCAP originates residential mortgages exclusively through the mortgage broker channel as we believe that a professional mortgage broker is a consumer's best option and MCAP actively promotes the services of mortgage brokers across the country. MCAP is also a leader in the Canadian residential construction lending market with over 25 years in the business. Our teams of dedicated professionals serve a variety of developer, construction and lender clients across Canada.\n\n**Position \\#:** req2117\n\n**Employment Status:** Permanent Full Time\n\n**Location:** Toronto; Ontario\n\n**Number Of Openings:** 1\n\n**Department:** Commercial Mortgage\n\n**Internal Job Title:** Sr. Director, Investment Management\n\n**Salary Range:** $150,000\\-180,000\n\n  \n\nThe above information in this description has been designed to indicate the general nature and level of work performed by employees in the position. It is not designated to contain a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to this job.\n\n  \n\nMCAP provides equal opportunities for all applicants and is committed to fostering an inclusive, accessible environment, where all employees feel valued, respected and supported throughout the recruitment and employment process. If you require accommodation, we will work with you to meet your needs.",
    "id": "in-0826b7d0f98d59ff",
    "currency": "CAD",
    "site": "indeed",
    "location": "Toronto, ON, CA",
    "company": "MCAP",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=0826b7d0f98d59ff",
    "title": "Sr. Director, Investment Management (Commercial)",
    "date_posted": "2025-12-04",
    "job_type": "fulltime",
    "max_amount": 150.0,
    "min_amount": 150.0,
    "job_url_direct": "https://mcap.csod.com/ux/ats/careersite/1/home/requisition/2117?c=mcap",
    "company_group": "MCAP",
    "company_search_term": "MCAP",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": [
      "fulltime"
    ],
    "location_city": "Toronto",
    "location_region": "ON",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:31.160350+00:00",
    "posted_days_ago": null,
    "dedupe_key": "50d2d942ae15194747f85309ef1dfbc27f95be7a"
  },
  {
    "description": "**Sr. Director, Investment Management**\n\n**MCAP at a Glance**\n\n\nJoining MCAP means you will be a part of our diverse workforce of highly talented individuals who are recognized for their expertise and success! At MCAP, your professional expertise, commitment to teamwork and passion for service excellence are recognized and rewarded with competitive total rewards offering, a career with continuous learning and development (formal \\& informal training), and exciting opportunities in a dynamic, entrepreneurial environment.\n\n**The Role**\n\n\nThis position will work with the Investment Management team on the development, implementation and monitoring of business plans that are aligned with MCAP’s strategic plan to support the company’s vision, mission, and values.\n\n\nThe position is responsible for maintaining a strong working relationship between MCAP’s Strategic and/or Third\\-Party Investors and MCAP’s origination / funding teams. This includes ensuring responsible file management of loans within the overall portfolio, while balancing intelligent risk with maximizing revenue targets and profitability. A primary responsibility will be to review and ensure that all loans proposed for MCAP’s direct lending programs qualify under all applicable mandates.\n\n\nThe role will also have accountability as ‘Portfolio Manager’ for all DFG loans. In this capacity, they will take a proactive role in monitoring the status of the portfolio, including but not limited to site visits, discussions with the branches, reviewing amendments and monitoring advances/sales as needed.\n\n\nExpert knowledge of MCAP’s investor requirements, the loan portfolio, and the regional markets is essential, requiring a close relationship with branch personnel, investors, borrowers, and other key consultants.\n\n\n**MCAP Capital Programs:**\n\n\n* Work with the SVP and the Loan Allocation \\& Review Committee (“ILAC”) in establishing volume targets for the MCAP capital programs and monitoring targets on a quarterly basis.\n* Review and adjudicate Term Sheets submitted by the regional branches. Term Sheet review is to ensure proper allocation of loans among MCAP’s Strategic Investors and/or that the loan qualifies under applicable MCAP capital programs.\n* Review and submit loan submissions to Credit Committee recommending MCAP’s investment in loans. Accountable for ensuring that the loans are underwritten and administered in accordance with the MCAP policies and procedures.\n* Approve non\\-material amendments, extensions or funding variances on behalf of MCAP as the investor relating to Commitment Letter changes, funding variances/relaxations, and partial discharge amounts, and determine when elevation is required.\n* Identify loan purchases/sales, recommend purchases to Credit Committee, and execute as required.\n\n\n**General Investor Relations:**\n\n\n* Cultivate Strategic Investor and/or Third\\-Party relationships via regular communication.\n* Maintain knowledge of investor requirements and desired product to ensure originators are targeting products that fit investor programs.\n* Manage allocation of loan opportunities fairly amongst investors, including MCAP as an investor, or advise/assist branches to source via Third party investors where applicable.\n* Mediate challenges or issues between the branches and investors.\n* Maintain expert knowledge of MCAP credit policies. Lead updating and revising the Policy and Procedures manual.\n* Establish \\& coordinate semi\\-annual market update presentations to key investors and be available to participate in investor tours or attend industry events.\n* Review and execute servicing agreements, interlender agreements or other documentation pertaining to loan syndications among investors.\n\n\n**Portfolio Management:**\n\n\n* Maintain expert knowledge of the overall loan portfolio with the ability to accurately respond to investor and/or internal inquiries in a timely manner.\n* Review of monthly and quarterly investor reporting to ensure accuracy and identify potential issues.\n* Work closely with MCAP’s funding team to address questions or issues that arise during the funding process and to sign off on advances as required.\n\n**Default Loan Management:**\n\n\n* Take a lead position in default management files and an active role in all monitored loans.\n* Coordinate with Investors, Borrower’s and counsel to create and implement workout strategies.\n* Update investors and senior management on status of monitored or workout loans.\n\n\n**Leadership and Management**\n\n\n* Champion the company’s vision, mission and values as set out in the Strategic Plan both internally and externally within the industry.\n* Educate, coach and counsel regional branch personnel to increase their ability to effectively handle their roles.\n* Work closely with origination staff to help structure loans, provide feedback and to lend guidance on investor strategies.\n* Assist in training regional branch personnel through term sheet/loan summary/amendment review process.\n* Provide backup for Managing Directors as required to review and sign off on Commitment / Loan documents or loan advances.\n\n**What You Bring To The Team**\n\n* Minimum of 8 years of experience in construction \\& development financing\n* Excellent verbal and writing skills to interface with all levels of the organization is a requirement, ensuring clear \\& concise reporting.\n* Proven capability to make well\\-reasoned and logical business decisions.\n* Demonstrated problem solving, conflict resolution and negotiation skills.\n* Experience in mortgage administration/funding and loan syndications is an asset.\n* Knowledge of CMHC construction and term funding programs would be beneficial.\n* Prior default management experience is highly valued.\n* Ability to multi\\-task in a fast\\-paced environment.\n* Strong proficiency to analyze financial statements and interpret results.\n* Ability to lead change initiatives and to foster a positive environment.\n* Established teamwork skills that allow for effective work in a diverse work group.\n* Demonstrated commitment to performing duties with integrity and professionalism.\n* Bachelor’s degree or higher\n* Licensing as required by the regional governing body\n\n\nIf this sounds like you and you are looking to be a part of one of Canada’s largest independent mortgage finance companies, then we want to hear from you!\n\n**Be A Part Of Something Great**  \n\n  \n\nMCAP is Canada’s largest independent Mortgage Finance company with over $150 billion in assets under management providing mortgage solutions for residential and commercial properties. For over 35 years, MCAP originates, trades, securitizes and services mortgages in offices across Canada. MCAP originates residential mortgages exclusively through the mortgage broker channel as we believe that a professional mortgage broker is a consumer's best option and MCAP actively promotes the services of mortgage brokers across the country. MCAP is also a leader in the Canadian residential construction lending market with over 25 years in the business. Our teams of dedicated professionals serve a variety of developer, construction and lender clients across Canada.\n\n**Position \\#:** req2111\n\n**Employment Status:** Permanent Full Time\n\n**Location:** Toronto or Calgary\n\n**Number Of Openings:** 1\n\n**Department:** Development Finance\n\n**Internal Job Title:** Sr. Director, Investment Management\n\n**Salary Range:** $150,000\\-$180,000\n\n  \n\nThe above information in this description has been designed to indicate the general nature and level of work performed by employees in the position. It is not designated to contain a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to this job.\n\n  \n\nMCAP provides equal opportunities for all applicants and is committed to fostering an inclusive, accessible environment, where all employees feel valued, respected and supported throughout the recruitment and employment process. If you require accommodation, we will work with you to meet your needs.",
    "id": "in-73a4af352a15a1e8",
    "currency": "CAD",
    "site": "indeed",
    "location": "Calgary, AB, CA",
    "company": "MCAP",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=73a4af352a15a1e8",
    "title": "Sr. Director, Investment Management",
    "date_posted": "2025-11-24",
    "job_type": "fulltime",
    "max_amount": 150.0,
    "min_amount": 150.0,
    "job_url_direct": "https://mcap.csod.com/ux/ats/careersite/1/home/requisition/2111?c=mcap",
    "company_group": "MCAP",
    "company_search_term": "MCAP",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": [
      "fulltime"
    ],
    "location_city": "Calgary",
    "location_region": "AB",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:31.163063+00:00",
    "posted_days_ago": null,
    "dedupe_key": "d89e50e776a8feeea203956c14593613a1b336af"
  },
  {
    "description": "**Business Development Manager \\- MERIX**\n\n**MCAP at a Glance**\n\n\nJoining MCAP means you will be a part of our diverse workforce of highly talented individuals who are recognized for their expertise and success! At MCAP, your professional expertise, commitment to teamwork and passion for service excellence are recognized and rewarded with competitive total rewards offering, a career with continuous learning and development (formal \\& informal training), and exciting opportunities in a dynamic, entrepreneurial environment.\n\n**The Role**\n\n\nAs a Business Development Manager at MCAP, you will be responsible for identifying, developing, and securing new business opportunities to drive revenue growth and expand market presence. You will leverage tools like Microsoft 365 and Salesforce to manage client relationships, track performance, and collaborate across departments. This role requires a strategic thinker with a strong sales acumen, excellent communication skills, and a passion for building long\\-term partnerships. The Business Development Manager will be accountable for annual achievement of specific targets set at the beginning of each fiscal year. The primary focus is on funded volume with additional secondary targets based on other business unit priorities as set by the VP, Sales (i.e. Funding Ratios).\n\n\nThis role will work primarily out of a remote home office with travel required to broker offices and industry events. BDMs must possess a valid driver’s license at all times.\n\n\n**Relationship Management – Retain, Grow, \\& Acquire**\n\n\n* Cultivate meaningful broker relationships through proactive support and communication\n* Cross\\-functional Collaboration: Work closely with marketing, product, and operations teams to align business development efforts with company objectives\n* Create awareness of MERIX products with Mortgage Brokers by:\n+ Presenting to small or large groups selling value proposition\n+ Position products and services\n\n* Increase results with existing MERIX Mortgage Brokers\n+ Apply Know Your Client (KYC) principles to uncover broker needs and develop tailored strategic plans\n+ Utilize sales and marketing programs to add additional value to the broker relationship (i.e. Mpoints loyalty program)\n+ Negotiate with brokers to gain a commitment on volume, funding ratios, and other metrics and follow\\-up for accountability\n\n* Identify new/potential Brokers/Brokerages\n+ On a frequent basis, contact potential new brokers and set up appointments to present MERIX’s value proposition\n+ Inform and educate new brokers on products and programs\n\n* Engage brokers with professionalism and strategic dialogue focused on market trends and business opportunities\n* The use of agendas for scheduled meetings, accompanied with broker score card and co\\-agent reporting\n* 10 – 12 meetings per week are required in this role with a mix of face\\-to\\-face and virtual\n\n**Marketing**\n\n\n* Design and execute territory\\-specific marketing initiatives tailored to local broker needs, market dynamics, and MERIX priorities\n* Share relevant insights such as local housing trends, rate movement impacts, and “MERIX Did You Know?” updates to position MERIX as a strategic partner\n* Leverage Salesforce to track broker engagement, log outreach activities, and share timely, personalized updates.\n* Represent MERIX at local industry events, networking sessions, and broker\\-hosted functions to build visibility and trust\n* Support brand presence at tradeshows by engaging attendees\n\n**Planning**\n\n\n* Develop an annual strategic territory and account plan\n* Create a touch\\-point strategy to organize work week, meetings and presentations\n* Identify the Broker’s business style and personal attributes in order to foster a strong working relationship with MERIX\n* Follow up on leads in a timely manner in order to capitalize on the opportunity to increase our customer base\n\n**Reporting and Administration**\n\n\n* Update and maintain all broker information within Salesforce\n* Complete full Know Your Client (KYC) profiles for all Submission Agents within Salesforce\n* Assist in registration and changes of MERIX Broker/Brokerage profiles\n* Log all daily activity in Salesforce \\- maintaining minimum levels\n* Manage monthly expenses prudently to assist in growth of the business\n\n**What You Bring To The Team**\n\n* Minimum 5 years sales experience – Financial Services preferred\n\nOR\n\n\n* Minimum 2 years mortgage underwriting experience Results oriented\n* Creative and innovative\n* Exceptional verbal and written communication skills\n* Excellent organizational and time\\-management skills\n* Excellent presentation skills – including virtual\n* Ability to build meaningful and trusting relationships internally and externally\n* Ability to multi\\-task in a fast\\-paced environment\n* Effective negotiation and conflict resolution skills\n* Strong analytical and problem\\-solving skills\n* Proficient with Microsoft 365 including Outlook and Teams\n* Tech savvy, including use of video for communication\n* Strong customer service skills\n* Self\\-driven, motivated with the ability to work independently and in a team environment\n* Carries out duties with integrity and takes responsibility for actions.\n* Thorough knowledge of mortgage broker network and emerging industry trends\n* Deep understanding of mortgage lending principles, including high\\-ratio, conventional, refinance, and purchase transactions\n* Ability to interpret and communicate policy changes to brokers clearly and accurately\n* Experience navigating underwriting guidelines and documentation requirements\n* University Degree\n* Accredited Mortgage Professional (AMP, preferred) or courses to satisfy provincial regulatory requirements\n\nIf this sounds like you and you are looking to be a part of one of Canada’s largest independent mortgage finance companies, then we want to hear from you!\n\n**Be A Part Of Something Great**  \n\n  \n\nMCAP is Canada’s largest independent Mortgage Finance company with over $150 billion in assets under management providing mortgage solutions for residential and commercial properties. For over 35 years, MCAP originates, trades, securitizes and services mortgages in offices across Canada. MCAP originates residential mortgages exclusively through the mortgage broker channel as we believe that a professional mortgage broker is a consumer's best option and MCAP actively promotes the services of mortgage brokers across the country. MCAP is also a leader in the Canadian residential construction lending market with over 25 years in the business. Our teams of dedicated professionals serve a variety of developer, construction and lender clients across Canada.\n\n**Position \\#:** req2094\n\n**Employment Status:** Permanent Full Time\n\n**Location:** Calgary and Edmonton, Alberta\n\n**Number Of Openings:** 2\n\n**Department:** Residential\n\n**Internal Job Title:** Business Development Manager\n\n  \n\nThe above information in this description has been designed to indicate the general nature and level of work performed by employees in the position. It is not designated to contain a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to this job.\n\n  \n\nMCAP provides equal opportunities for all applicants and is committed to fostering an inclusive, accessible environment, where all employees feel valued, respected and supported throughout the recruitment and employment process. If you require accommodation, we will work with you to meet your needs.",
    "id": "in-1dace670ab0f5d01",
    "currency": "CAD",
    "site": "indeed",
    "location": "Calgary, AB, CA",
    "company": "MCAP",
    "interval": null,
    "is_remote": true,
    "job_url": "https://ca.indeed.com/viewjob?jk=1dace670ab0f5d01",
    "title": "Business Development Manager - MERIX",
    "date_posted": "2025-11-06",
    "job_type": "fulltime",
    "max_amount": 150.0,
    "min_amount": 150.0,
    "job_url_direct": "https://mcap.csod.com/ux/ats/careersite/1/home/requisition/2094?c=mcap",
    "company_group": "MCAP",
    "company_search_term": "MCAP",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": "remote",
    "employment_types": [
      "fulltime"
    ],
    "location_city": "Calgary",
    "location_region": "AB",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:31.165248+00:00",
    "posted_days_ago": null,
    "dedupe_key": "6f4d2bdb8a27fb4f43773b552feecbeac01f8669"
  },
  {
    "description": "**Gestionnaire de Financement**\n\n*English posting to follow.*\n\n\n**MCAP en un coup d’œil**  \n\nEn vous joignant à MCAP, vous ferez partie de nos effectifs diversifiés composés de personnes hautement talentueuses qui sont reconnues pour leur expertise et leurs succès! À MCAP, votre expertise professionnelle, votre engagement envers le travail d’équipe et votre passion pour l’excellence du service sont reconnus et récompensés au moyen d’une rémunération totale concurrentielle, d’une carrière qui favorise l’apprentissage continu et le perfectionnement (formation officielle et non officielle) et des occasions passionnantes dans un milieu entrepreneurial dynamique.\n\n\n**Le rôle**\n\n\nLe titulaire de ce poste est responsable de la direction régionale et de la gestion des coordonnateurs de clôture afin d'assurer le traitement rapide et précis des opérations hypothécaires de clôture pour tous les prêts directs et les prêts par courtier pour toutes les marques.\n\n\nLe responsable du financement sera responsable de la réalisation régionale des accords sur les niveaux de service de MCAP pour les coordonnateurs de clôture et du suivi du rendement et de l'exactitude des membres de l'équipe afin de cerner les lacunes et d'offrir un accompagnement, une formation et un perfectionnement qui assureront l'excellence du rendement.\n\n\n**Le bilinguisme en français et en anglais est requis pour ce poste afin d'interagir, de soutenir et/ou de fournir des services aux avocats, juristes, employés et/ou partenaires francophones et non\\-francophones à l'intérieur et/ou à l'extérieur de la province de Québec.**\n\n\n**Planification et performance**\n\n\n* Gérer les ressources pour distribuer efficacement les rapports de financement hebdomadaires, la vérification de la documentation et du financement entre les membres de l'équipe afin de respecter ou de dépasser les normes de service.\n* S'assurer que l'ensemble du personnel comprend la politique et les objectifs de risque MCAP afin de garantir la qualité élevée des actifs.\n* Repérer tout changement aux procédures ou aux politiques de financement existantes qui incite les avocats à faire des demandes inutiles ou qui a une incidence sur la productivité.\n* Être responsable de la gestion des coûts liés aux erreurs ou aux processus.\n* Être responsable du respect des normes de niveaux de service.\n* Être responsable de la liaison, de la négociation et de la résolution des problèmes avec les fournisseurs de services afin d'assurer la fluidité des processus et de faire de MCAP un partenaire expert.\n* Être responsable de l'enregistrement des prêts hypothécaires et de la mise en place de toutes les garanties avant que les fonds ne soient avancés, et que les fonds soient avancés en temps opportun.\n* Surveiller toutes les activités pour s’assurer qu’elles sont réalisées conformément au processus documenté de MCAP.\n* Communiquer avec le personnel pour résoudre tout problème lié à la documentation ou aux clôtures.\n* Examiner et financer les prêts hypothécaires conformément aux politiques et lignes directrices de MCAP et de l'autorité d'approbation des prêts.\n* Maintenir à jour ses connaissances de MCAP et des conditions du marché afin de les transmettre à l'équipe.\n\n\n**Suivi et création de rapports**\n\n\n* Ententes de rendement.\n* Utiliser les rapports de clôture de toutes les marques pour l'examen quotidien et le suivi des courtiers et des avocats.\n* Suivre le tableau de bord pour gérer la répartition de la charge de travail.\n\n\n**Diriger et gérer le personnel**\n\n\n* Défendre la vision, la mission et les valeurs de l’entreprise, telles qu’elles sont énoncées dans le plan stratégique, tant à l’interne qu’à l’externe au sein de l’industrie.\n* Recruter et former les personnes compétentes qui adhèrent aux valeurs et à la culture de MCAP et les reflètent par leur comportement.\n* Assurer le leadership, l’orientation et l’accompagnement des collaborateurs directs afin de faciliter l’atteinte des buts et objectifs.\n* Établir, surveiller et communiquer des normes de rendement aux subordonnés directs afin de renforcer les résultats individuels, la qualité du travail, l’amélioration continue, le travail d’équipe et la réalisation des objectifs de MCAP.\n* Former, accompagner et conseiller le personnel pour s'assurer qu'il est habilité à gérer efficacement ses rôles de manière confiante et professionnelle.\n* Déterminer les forces du personnel pour fournir un cheminement de carrière approprié.\n* Établir des objectifs et fournir des conseils pour encourager le perfectionnement des employés.\n* Trouver les écarts de rendement et développer un plan d'amélioration.\n* Former le personnel conformément à la planification de la relève et aux exigences opérationnelles courantes.\n* Mettre en place et maintenir un système de communication efficace dans l'ensemble de l'unité fonctionnelle.\n* Veiller à instaurer et promouvoir une culture d'amélioration continue.\n* Traiter rapidement les problèmes disciplinaires graves, comme l'absentéisme et les problèmes de rendement, et participer à l'embauche de nouveaux employés et les recommander.\n\n\n**Votre contribution à l’équipe**\n\n\n* 5 ans d'expérience commerciale dans le secteur des prêts hypothécaires résidentiels\n* 5 ans d’expérience dans un poste de leadership\n* Capacité à cibler, évaluer et articuler les enjeux et les responsabilités qui peuvent être complexes à définir et à comprendre\n* Capacité à cerner les problèmes et à présenter des solutions de remplacement\n* Excellentes compétences interpersonnelles et capacité à favoriser et à entretenir des relations avec tous les niveaux du personnel et des professionnels tiers; flexible et accessible\n* Excellentes compétences en matière de prise de décision, de jugement et de négociations\n* Désireux de partager ses connaissances, aime apprendre et capacité à se motiver soi\\-même et les autres pour atteindre des objectifs\n* Forte éthique de travail\n* Excellentes compétences en communication orale et écrite\n* Excellentes compétences organisationnelles et de gestion du temps\n* Capacité à effectuer plusieurs tâches dans un environnement dynamique\n* Excellentes compétences en analyse et en résolution de problèmes\n* Capacité à diriger des initiatives de changement et à entretenir des relations positives\n* Excellentes compétences en service à la clientèle\n* Motivation et capacité à travailler de manière autonome et en équipe\n* S'acquitte de ses tâches avec intégrité et assume la responsabilité de ses actions\n* Connaissance des politiques de la SCHL, de la Canada Guaranty et de Genworth\n* Capacité à sortir des sentiers battus et à proposer des solutions grâce à une pensée novatrice\n* Capacité à mobiliser les ressources pour respecter les échéances\n* Excellentes compétences en résolution de problèmes et de conflits\n* Capacité éprouvée à accompagner, encadrer et former le personnel\n* Connaissance et compréhension du secteur des prêts hypothécaires et des tendances de l'industrie en lien avec l'unité fonctionnelle et MCAP\n* Connaissance de Microsoft Office et de ses applications requise\n* Expérience avec SharePoint\n* Diplôme universitaire ou collégial\n* Professionnel hypothécaire du Canada accrédité (souhaitable)\n\n\nSi vous vous reconnaissez dans ce qui précède et que souhaitez faire partie de l’une des plus vastes sociétés de financement hypothécaire du Canada, faites\\-nous signe!\n\n\n**Faites partie de quelque chose de grand**  \n\n  \n\nMCAP est l’une des plus importantes sociétés indépendantes de financement hypothécaire du Canada, avec des actifs sous gestion de plus de 150 milliards de dollars. Elle propose des solutions en matière d’hypothèques résidentielles et commerciales. Depuis plus de 35 ans, MCAP consent, négocie, titrise des prêts hypothécaires et en assure le service dans ses bureaux partout au Canada. De plus, MCAP octroie des prêts hypothécaires résidentiels exclusivement par l’entremise du canal de courtage hypothécaire, car nous sommes d’avis que le professionnalisme d’un courtier ou d’une courtière en hypothèques est la meilleure option dont dispose le consommateur et MCAP fait activement la promotion à la grandeur du pays des services offerts par les courtiers hypothécaires. MCAP est également chef de file sur le marché canadien des prêts à la construction résidentielle et est active à ce chapitre depuis plus de 25 ans. Nos équipes de professionnels dévoués servent divers clients à l’échelle du Canada, tels que des promoteurs, des constructeurs et des prêteurs.\n\n  \n\n\n**Manager, Funding**\n\n**MCAP at a Glance**\n\n\nJoining MCAP means you will be a part of our diverse workforce of highly talented individuals who are recognized for their expertise and success! At MCAP, your professional expertise, commitment to teamwork and passion for service excellence are recognized and rewarded with competitive total rewards offering, a career with continuous learning and development (formal \\& informal training), and exciting opportunities in a dynamic, entrepreneurial environment.\n\n\n**The Role**\n\n\nThis position is responsible for regional leadership and management of Closing Coordinators to ensure prompt and accurate processing of the closing mortgage transactions for all Direct and Broker originated loans for all Brands.\n\n\nThe Manager, Funding will be accountable for the regional attainment of MCAP service level agreements for Closing Coordinators and for monitoring performance and accuracy of team members to identify gaps and provide coaching, training and development that will ensure performance excellence.\n\n**Bilingualism in French and English is required for this position to interact, support and/or provide services to French and non\\-French speaking lawyers, solicitors, employees and/or partners inside and/or outside the province of Quebec.**\n\n\n**Planning and Performance**\n\n\n* Managing resources to efficiently distribute weekly funding report, documentation verification and fundings between team members to meet or exceed service standards\n* Ensure all staff understand MCAP Policy and Risk Objectives to ensure high asset quality\n* Identify any changes to existing procedures or funding policies that are causing solicitors to make unnecessary inquiries or that impact productivity.\n* Accountable for managing costs that are incurred due to errors or processes\n* Accountable to meet service level standards\n* Accountable for liaising, negotiating and problem solving with service providers to ensure smooth processes and that MCAP is seen as an Expert Partner.\n* Responsible for ensuring mortgages are registered and all security is in place prior to funds being advanced and that funds are advanced on a timely basis\n* Monitor all activities to ensure they are performed within MCAP’s documented process\n* Communicate with staff to resolve any escalated issues around documentation or closings\n* Review and fund mortgages according to Loan Authority Approval and MCAP policies/guidelines\n* Maintain up to date knowledge of MCAP and market condition to transfer knowledge to team\n\n\n**Tracking and Reporting**\n\n\n* Performance Agreements\n* Utilize Closing reports for all brands for daily review and broker/solicitor follow ups\n* Monitor dashboard to manage workload distribution\n\n\n**Lead and Manage Staff**\n\n\n* Champion the company’s Vision, Mission and Values as set out in the Strategic Plan both internally and externally within the industry\n* Recruit and develop the right people that believe in and reflect in their behavior, MCAP’s Values and culture\n* Provide leadership, direction and coaching to direct reports to facilitate the achievement of goals and objectives\n* Establish, monitor and communicate performance standards to direct reports reinforcing individual results, work quality, continuous improvement, teamwork and achievement of MCAP’s objectives\n* Educate, coach and counsel staff to ensure they are empowered to effectively handle their roles in a confident and professional manner\n* Identify staff’s strengths to provide suitable career path\n* Establish goals and provide guidance to encourage development of employees\n* Identify gaps in performance and develop a plan for improvement\n* Develop staff in keeping with succession planning and ongoing business requirements\n* Establish and maintain an effective system of communication throughout the business unit\n* Ensure a continuous improvement culture is established and encouraged\n* Deal rapidly with serious disciplinary problems, such as absenteeism and performance issues and participate and recommend hiring of new employees.\n\n**What You Bring To The Team**\n\n\n* 5 years’ business experience in Residential Mortgage Industry\n* 5 years’ experience in a leadership role\n* Ability to identify, assess and articulate issues and liabilities that may be complex to define and understand\n* Ability to identify issues and present alternative course of action\n* Strong interpersonal skills and able to foster and maintain relationships with all levels of staff and third\\-party professionals; flexible and approachable\n* Strong decision\\-making, sound judgment and negotiation skills\n* Willing to share knowledge, enjoys learning and can motivate self and others to attain goals\n* Strong work ethic\n* Exceptional oral and written communication skills\n* Excellent organizational and time\\-management skills\n* Ability to multi\\-task in a fast\\-paced environment\n* Strong analytical and problem\\-solving skills\n* Ability to lead change initiatives and foster positive relationships\n* Strong customer service skills\n* Self\\-driven, motivated with the ability to work independently and in a team environment\n* Carries out duties with integrity and takes responsibility for actions\n* Knowledge of CMHC, Canada Guaranty and Genworth policies\n* Ability to think outside the box and be able to provide solutions through innovative thinking\n* Ability to pull resources together to meet deadlines\n* Excellent problem\\-solving and conflict resolution skills\n* Proven ability to coach, mentor and train staff\n* Knowledge and understanding of the mortgage business and industry trends as it relates to the business unit and MCAP\n* Microsoft Office knowledge and application required\n* SharePoint experience\n* University or College Degree\n* Accredited Mortgage Professional (AMP) (preferred)\n\n\nIf this sounds like you and you are looking to be a part of one of Canada’s largest independent mortgage finance companies, then we want to hear from you!\n\n\n**Be A Part Of Something Great**  \n\n  \n\nMCAP is Canada’s largest independent Mortgage Finance company with over $150 billion in assets under management providing mortgage solutions for residential and commercial properties. For over 35 years, MCAP originates, trades, securitizes and services mortgages in offices across Canada. MCAP originates residential mortgages exclusively through the mortgage broker channel as we believe that a professional mortgage broker is a consumer's best option and MCAP actively promotes the services of mortgage brokers across the country. MCAP is also a leader in the Canadian residential construction lending market with over 25 years in the business. Our teams of dedicated professionals serve a variety of developer, construction and lender clients across Canada.\n\n\nThe above information in this description has been designed to indicate the general nature and level of work performed by employees in the position. It is not designated to contain a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to this job.\n\n\nMCAP provides equal opportunities for all applicants and is committed to fostering an inclusive, accessible environment, where all employees feel valued, respected and supported throughout the recruitment and employment process. If you require accommodation, we will work with you to meet your needs.\n\n **Position \\#:** req2045  \n\n**Employment Status:** Permanent Full Time  \n\n**Location:** Montreal  \n\n**Number Of Openings:** 1  \n\n**Department:** Residential  \n\n**Internal Job Title:** Manager, Funding\n\n\n**Salary Range:** $80,000 \\- $90,000",
    "id": "in-c18ce24345416e63",
    "currency": "CAD",
    "site": "indeed",
    "location": "Calgary, AB, CA",
    "company": "MCAP",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=c18ce24345416e63",
    "title": "Bilingual Mortgage Funding Manager / Gestionnaire de Financement d'Hypotheque",
    "date_posted": "2025-06-09",
    "job_type": "fulltime",
    "max_amount": 150.0,
    "min_amount": 150.0,
    "job_url_direct": "https://mcap.csod.com/ux/ats/careersite/1/home/requisition/2045?c=mcap",
    "company_group": "MCAP",
    "company_search_term": "MCAP",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": [
      "fulltime"
    ],
    "location_city": "Calgary",
    "location_region": "AB",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:31.170424+00:00",
    "posted_days_ago": null,
    "dedupe_key": "687055fd5e9287285d86642cce6fafe37856a23a"
  }
]