[
  {
    "description": "**WHO IS RATEHUB?**\n\n\nWe’re a company on a mission. We are a unique Canadian Fintech that is the one\\-stop shop for all financial needs of the consumer: Save, Spend, Borrow, Invest, and Protect. Every single team member — from Product \\& Engineering to Sales \\& Marketing, Finance, Operations, and everything in between — is obsessed with one thing: helping Canadians make better financial choices. And we’re pretty great at it, too. Via our digital application technology and our award\\-winning in\\-house brokerages, we help over 2M Canadians per month make a positive impact on their finances. We have many unique businesses: a mortgage brokerage, a life insurance brokerage, a home and auto insurance brokerage, a mortgage originations and servicing business, a Financial Services Marketplace, and a content business across Ratehub and MoneySense. 365 days a year, we deliver our users the best online mortgage experience, personalized credit card and loan options, and cheaper auto and home insurance policies than they typically get from their existing financial adviser.\n\n\nChanging how people make financial choices isn’t easy, though. We know that achieving our mission is full of challenges — challenges that can be complex and often unexpected but that are always interesting, rewarding, and fun to solve as a team. This is where you come in. We are on the hunt for the right candidate to join us and help lead us forward to continued growth.\n\n  \n\nWe’re looking for a **Product Designer** to join our growing team: someone who takes end\\-to\\-end ownership of the design process, from discovery to final delivery. The ideal candidate is equally strong in UX and UI, passionate about solving user problems, and skilled at transforming high\\-level ideas into intuitive user experiences that drive real impact. Although headquartered in downtown Toronto, Ratehub is a remote\\-first company and as such, we’re open to remote candidates.\n\n**YOUR RESPONSIBILITIES**\n\n**Core Design:**\n\n* Own the end\\-to\\-end design process, from research and ideation to prototyping, validating, and delivering high\\-impact product experiences that help our users make smart financial decisions.\n* Act as the voice of the customer, using research, usability testing, A/B testing, and other analytical tools to understand and validate ideas, problems, and solutions, ensuring every decision delivers measurable value to users.\n* Partner with product, engineering, data, marketing, and content teams to translate ideas into meaningful, user\\-centered experiences.\n* Design responsive and consistent experiences across mobile and desktop.\n* Collaborate closely with engineers to ensure design feasibility, high\\-fidelity implementation, and visual and functional accuracy in the final product.\n* Contribute to product roadmaps and sprint planning alongside product and engineering teams.\n* Build and maintain design backlogs, and help shape design strategy for the next 6–24 months.\n* Support additional design needs from content and marketing initiatives across Ratehub and MoneySense.\n\n**Collaboration and Communication:**\n\n* Facilitate workshops with stakeholders to align on goals, gather requirements, and co\\-create solutions.\n* Communicate design concepts and rationale clearly and persuasively to technical and non\\-technical audiences, including senior leadership.\n\n**Design Systems and Standards:**\n\n* Build and maintain scalable design systems and style guides to ensure consistency across products.\n* Ensure all designs meet accessibility standards (WCAG) and deliver inclusive user experiences.\n* Stay current with industry trends, tools, and best practices to continuously improve design processes and methodologies.\n\n**YOUR QUALIFICATIONS**\n\n* 3\\+ years of product design experience, with a strong portfolio showcasing responsive designs for web and mobile platforms.\n* Proven ability to own the end\\-to\\-end design process: user research, ideation, prototyping, UX/UI design, and usability testing.\n* Strong UX and UI design skills, with excellent attention to detail and a deep understanding of how to craft intuitive, impactful user experiences.\n* High proficiency with Figma.\n* Proven ability to leverage both quantitative and qualitative data to validate design decisions, with proficiency in usability testing tools (e.g., usertesting.com, Maze) and analytics tools (e.g., Heap, Hotjar)\n* Highly organized and self\\-sufficient, with the ability to prioritize and manage multiple projects under tight deadlines in a fast\\-paced, agile environment.\n* Skilled at breaking down complex problems into simple, intuitive solutions and iterating quickly based on feedback.\n* Demonstrated experience building and maintaining scalable, component\\-based design systems using modern design principles.\n* Excellent communication and collaboration skills, with the ability to present design rationale and align cross\\-functional stakeholders.\n* Bias toward action — balancing quality and speed, knowing when to dive deep and when to move quickly\n\nComfortable with ambiguity and experienced in designing 0* 1 products and features.\n* Familiarity with Agile methodologies and tools such as Jira and Confluence.\n* Post\\-secondary degree, diploma, or certificate in UX Design or a related field.\n\n**Nice\\-to\\-haves:**\n\n* Experience working with Storybook or Wordpress.\n* Basic understanding of front\\-end development (HTML, CSS, Javascript).\n* Experience designing for customer\\-facing financial services products\n\n**CULTURE FIT:**\n\n* **Members first** \\- we prioritise the interests and needs of our members above all else.We solve member pain points and focus on member satisfaction. We start with members, and end with the P\\&L.\n* **Growth mindset** \\- we set ambitious goals and challenge the status quo. We take responsible risks and are accountable for our actions.\n* **Better together** \\- we are One team with One common goal. We make our footprint bigger than our foot, leave our egos at the door, support each other to achieve great results as One company.\n* **Run after problems** \\- we tackle problems head on and focus on finding solutions. Obstacles are seen as opportunities for growth and innovation. We have the hard conversations and choose the harder right over the easier wrong. And we do it with a smile.\n* **Measure Learn Iterate Innovate** \\- we focus on getting things done. We measure what matters, iterate, learn, iterate many times in a data\\-driven way, which is how we will innovate.\n\n**JOB PERKS:**\n\n* Competitive salary: We know it’s expensive to live/work in Canada\n* Remote\\-first organization: we love opportunities to get together as a team, but for the most part we offer our employees the flexibility to work anywhere in Canada\n* Flexible hours: Enjoy a couple more hours of sleep in the morning, if you want\n* Benefits: Health is wealth! A benefits package with no employee contribution required\n* Perks: RRSP matching program, individual training allowance, fun team socials (remote AND in\\-person) and more!\n\n  \n\nThis job posting is for a currently open vacancy.\n\n\nAI technology is not used in the screening and assessment process of our recruitment.\n\n\nThe compensation range for this position is $90,000 \\- $125,000 CAD.\n\n\nRatehub welcomes and encourages applications from people with disabilities. Accommodations are available upon request for candidates taking part in all aspects of the selection process.\n\n\n\n\nOXUaKyRu78",
    "id": "in-f4b41ba08a1e1f0b",
    "currency": "CAD",
    "site": "indeed",
    "location": "Remote, CA",
    "company": "RateHub",
    "interval": null,
    "is_remote": true,
    "job_url": "https://ca.indeed.com/viewjob?jk=f4b41ba08a1e1f0b",
    "title": "Product Designer",
    "date_posted": "2026-01-07",
    "job_type": "fulltime",
    "max_amount": 90000.0,
    "min_amount": 90000.0,
    "job_url_direct": "https://ratehubinc.applytojob.com/apply/095f370d7448596f58737b4f6271037a0741090b70263f2618221f0d01593810212a22/Product-Designer?sid=c0URFxkZiCKwSB2B5uVL9mqnHqXIBawAxyi&source=INDE&~",
    "company_group": "Ratehub.ca",
    "company_search_term": "RateHub",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": "remote",
    "employment_types": [
      "fulltime"
    ],
    "location_city": "Remote",
    "location_region": "CA",
    "location_country_hint": null,
    "scraped_at": "2026-01-09T22:15:31.937540+00:00",
    "posted_days_ago": null,
    "dedupe_key": "7c2a467d7adb96ac83e09f6f1ea16a89961a05b8"
  },
  {
    "description": "**WHO IS RATEHUB INC?**\n\n\nWe’re a company on a mission \\- We are a unique Canadian Fintech that is the one stop shop for all financial needs of the consumer \\- Save, Spend, Borrow, Invest, and Protect. Every single team member, from product \\& engineering to sales \\& marketing, finance, operations, and everything in between is obsessed with one thing; helping Canadians make better financial choices. And we’re pretty great at it, too. Via our digital application technology and our award\\-winning in\\-house brokerages, we help over 2M Canadians per month make a positive impact on their finances. We have many unique businesses \\- a mortgage brokerage, a life insurance brokerage, a home and auto insurance brokerage, a mortgage originations and servicing business, a Financial Services Marketplace and a content business across Ratehub and MoneySense. 365 days a year we deliver our users the best online mortgage experience, personalized Credit Card and Loans options, and cheaper auto \\& home insurance policies than they typically get from their existing financial adviser.\n\n\nChanging how people make financial choices isn’t easy, though. We know that achieving our mission is full of challenges; challenges that can be complex and often unexpected, but that are always interesting, rewarding, and fun to solve as a team. This is where you come in. We are on the hunt for the right kind of people to join us and help lead us forward to continued growth.\n\n\nWe’re looking for an **Experienced Customer Service Broker** to join our Insurance team in Alberta, (fully remote replacement role). Reporting to the Customer Service Broker Team Lead, the incumbent will have an exciting opportunity to join the fast growing Insurance brokerage for Ratehub \\- RH Insurance! The successful candidate will be motivated by working alongside a startup team, thrives in a fast paced environment, and is eager to grow with a rapidly expanding company.\n\n**YOUR RESPONSIBILITIES**\n\n* Provide quality customer service and professional expert advice to clients\n* Proactively conduct renewal reviews to ensure customer retention targets are met\n* Handle outbound calls to existing clients for renewal review as necessary\n* Liaison with insurers, building and maintaining relationships\n* Administer, support and complete policy changes within our company partner’s portals and websites\n* Review policies and make recommendations as required\n* Adhere to the underwriting criteria set out by our broker partners\n* Coordinate and follow up on client documents\n* Respond to incoming calls and service customer needs\n* Give claims advice to clients, report claims, follow up on claims\n* Strong Ability to multitask, prioritize, and manage time effectively\n\n**YOUR QUALIFICATIONS**\n\n* Alberta level 1 licence required, Level 2 license preferred\n* Minimum 2\\+ years of insurance experience\n* Independent, ambitious and competitive\n* Thrives in a fast\\-paced environment\n* Positive attitude\n* Looking to grow with a rapidly expanding company\n\n**CULTURE FIT:**\n\n* **Members first** \\- we prioritise the interests and needs of our members above all else. We solve member pain points and focus on member satisfaction. We start with members, and end with the P\\&L.\n* **Growth mindset** \\- we set ambitious goals and challenge the status quo. We take responsible risks and are accountable for our actions.\n* **Better together** \\- we are One team with One common goal. We make our footprint bigger than our foot, leave our egos at the door, support each other to achieve great results as One company.\n* **Run after problems** \\- we tackle problems head on and focus on finding solutions. Obstacles are seen as opportunities for growth and innovation. We have the hard conversations and choose the harder right over the easier wrong. And we do it with a smile.\n* **Measure Learn Iterate Innovate** \\- we focus on getting things done. We measure what matters, iterate, learn, iterate many times in a data\\-driven way, which is how we will innovate.  \n\n  \n\nRatehub Inc does not use AI to select, screen, or assess applicants.\n\n\nThis job posting is for a currently open vacancy.\n\n\nAI technology is not used in the screening and assessment process of our recruitment.\n\n  \n\nThe compensation range for this position is $55,000 \\- $64,000 CAD.\n\n\nRatehub welcomes and encourages applications from people with disabilities. Accommodations are available upon request for candidates taking part in all aspects of the selection process.\n\n\n\n\nGuKAYl3bpg",
    "id": "in-3a961c73720e9a91",
    "currency": "CAD",
    "site": "indeed",
    "location": "Remote, CA",
    "company": "RateHub",
    "interval": null,
    "is_remote": true,
    "job_url": "https://ca.indeed.com/viewjob?jk=3a961c73720e9a91",
    "title": "Customer Service Broker - Personal Lines",
    "date_posted": "2025-12-22",
    "job_type": "fulltime",
    "max_amount": 55000.0,
    "min_amount": 55000.0,
    "job_url_direct": "https://ratehubinc.applytojob.com/apply/GuKAYl3bpg/Customer-Service-Broker-Personal-Lines?source=INDE&~",
    "company_group": "Ratehub.ca",
    "company_search_term": "RateHub",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": "remote",
    "employment_types": [
      "fulltime"
    ],
    "location_city": "Remote",
    "location_region": "CA",
    "location_country_hint": null,
    "scraped_at": "2026-01-09T22:15:31.939266+00:00",
    "posted_days_ago": null,
    "dedupe_key": "96c93626c11b0936d8254082a30f17502de3e169"
  },
  {
    "description": "**WHO IS RATEHUB?**\n\n\nWe’re a company on a mission \\- We are a unique Canadian Fintech that is the one stop shop for all financial needs of the consumer \\- Save, Spend, Borrow, Invest, and Protect. Every single team member, from product \\& engineering to sales \\& marketing, finance, operations, and everything in between is obsessed with one thing; helping Canadians make better financial choices. And we’re pretty great at it, too. Via our digital application technology and our award\\-winning in\\-house brokerages, we help over 2M Canadians per month make a positive impact on their finances. We have many unique businesses \\- a mortgage brokerage, a life insurance brokerage, a home and auto insurance brokerage, a mortgage originations and servicing business, a Financial Services Marketplace and a content business across Ratehub and MoneySense. 365 days a year we deliver our users the best online mortgage experience, personalized Credit Card and Loans options, and cheaper auto \\& home insurance policies than they typically get from their existing financial adviser.\n\n\nChanging how people make financial choices isn’t easy, though. We know that achieving our mission is full of challenges; challenges that can be complex and often unexpected, but that are always interesting, rewarding, and fun to solve as a team. This is where you come in. We are on the hunt for the right kind of people to join us and help lead us forward to continued growth.\n\n  \n\nWe’re looking for an Executive Assistant for the Office of the CEO. Reporting directly to the CEO, this person is part of the Executive Leadership team and will work closely with the CEO on the day\\-to\\-day running of the company. This is a great opportunity for a high performing, early career individual with stellar organisational skills, a resilient and motivated attitude and the professional acumen to work at all levels of the organisation and see and learn how a company is run from a CEO’s office. **This role is a 6 month contract with the possibility for extension.**\n\n **YOUR RESPONSIBILITIES**\n\n* Manage a variety of administrative tasks for our CEO, including calendar management, booking travel, submitting expenses, and email/communication management, etc.\n* Plan, schedule, and coordinate logistics for monthly town halls and quarterly socials (venue booking, catering, agenda coordination, AV setup, final deck organization), whether in person or remote, collaborating across the Leadership Team as needed to confirm items for delivery.\n* Ongoing office management of our Toronto headquarters (onsite typically once a week, but more during weeks with in person meetings/events) liaising with the WeWork Team as needed to manage access control, mail/courier services, and monthly billing, and ensuring overall the space remains an inviting and positive environment for our employees.\n* Lead the Employee of the Month, and Employee Recognition \\& Gifting initiatives, promoting an engaged and valued employee culture.\n* Monitor our customer service platform Zendesk, ensuring service requests are forwarded to the appropriate person promptly.\n* Other administrative duties as needed to support the Office of the CEO and teams across Ratehub.\n\n**YOUR QUALIFICATIONS**:\n\n* Experience in a fast paced office environment providing executive level support is a strong asset.\n* Ability to manage multiple priorities in a deadline driven organisation\n* Confidence to interface with senior level stakeholders, and build relationships across the organisation.\n* Proficient with technology and openness to learning new systems.\n* Obsessed with the details! You’re a planner and incredibly organised.\n* Resourceful: You don’t have all the answers, but you know how to get them.\n* Proactive: You are never idle and love being busy.\n* 'No job is too big or too small' mentality: The only place where success comes before work is in the dictionary.\n* Positive attitude: We have a great culture and want to preserve it.\n\n **CULTURE FIT:**\n\n* **Members first** \\- we prioritise the interests and needs of our members above all else.We solve member pain points and focus on member satisfaction. We start with members, and end with the P\\&L.\n* **Growth mindset** \\- we set ambitious goals and challenge the status quo. We take responsible risks and are accountable for our actions.\n* **Better together** \\- we are One team with One common goal. We make our footprint bigger than our foot, leave our egos at the door, support each other to achieve great results as One company.\n* **Run after problems** \\- we tackle problems head on and focus on finding solutions. Obstacles are seen as opportunities for growth and innovation. We have the hard conversations and choose the harder right over the easier wrong. And we do it with a smile.\n* **Measure Learn Iterate Innovate** \\- we focus on getting things done. We measure what matters, iterate, learn, iterate many times in a data\\-driven way, which is how we will innovate.\n\n  \n\nThis job posting is for a currently open vacancy.\n\n\nAI technology is not used in the screening and assessment process of our recruitment.\n\n\nThe compensation range for this position is $40,000 \\- $65,000 CAD.\n\n\nRatehub welcomes and encourages applications from people with disabilities. Accommodations are available upon request for candidates taking part in all aspects of the selection process.\n\n\n\n\nN7SnKB0Oil",
    "id": "in-ef7ce435ca4dfaa9",
    "currency": "CAD",
    "site": "indeed",
    "location": "Toronto, ON, CA",
    "company": "RateHub",
    "interval": null,
    "is_remote": true,
    "job_url": "https://ca.indeed.com/viewjob?jk=ef7ce435ca4dfaa9",
    "title": "Executive Assistant to the CEO (Early Career)",
    "date_posted": "2025-12-06",
    "job_type": "temporary",
    "max_amount": 40000.0,
    "min_amount": 40000.0,
    "job_url_direct": "https://ratehubinc.applytojob.com/apply/N7SnKB0Oil/Executive-Assistant-To-The-CEO-Early-Career?source=INDE&~",
    "company_group": "Ratehub.ca",
    "company_search_term": "RateHub",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": "remote",
    "employment_types": [
      "contract",
      "temporary"
    ],
    "location_city": "Toronto",
    "location_region": "ON",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:31.941525+00:00",
    "posted_days_ago": null,
    "dedupe_key": "fad9072794e03b8327d632c1ac1036be1868b2f3"
  },
  {
    "description": "**WHO IS RATEHUB?**\n\n  \n\nWe’re a company on a mission. We are a unique Canadian Fintech that is the one\\-stop shop for all financial needs of the consumer: Save, Spend, Borrow, Invest, and Protect. Every single team member — from Product \\& Engineering to Sales \\& Marketing, Finance, Operations, and everything in between — is obsessed with one thing: helping Canadians make better financial choices. And we’re pretty great at it, too. Via our digital application technology and our award\\-winning in\\-house brokerages, we help over 2M Canadians per month make a positive impact on their finances. We have many unique businesses: a mortgage brokerage, a life insurance brokerage, a home and auto insurance brokerage, a mortgage originations and servicing business, a Financial Services Marketplace, and a content business across Ratehub and MoneySense. 365 days a year, we deliver our users the best online mortgage experience, personalized credit card and loan options, and cheaper auto and home insurance policies than they typically get from their existing financial adviser.\n\n\nChanging how people make financial choices isn’t easy, though. We know that achieving our mission is full of challenges — challenges that can be complex and often unexpected but that are always interesting, rewarding, and fun to solve as a team. This is where you come in. We are on the hunt for the right candidate to join us and help lead us forward to continued growth.\n\n  \n\nWe’re looking for an experienced **Software Development Manager (SDM)** who combines strong technical and analytical capabilities with a proven ability to deliver results quickly and effectively. In this role, you will lead a talented team of engineers to build scalable, customer\\-facing software products through iterative, data\\-driven development. You will act as both a strategic operator and an execution\\-focused leader, ensuring the on\\-time delivery of high\\-quality, differentiated solutions that create measurable impact. You’ll also be a strong people leader, capable of mentoring and scaling a high\\-performing engineering team.\n\n**YOUR RESPONSIBILITIES**\n-------------------------\n\n **Technical Strategy and Execution**\n\n* Own the end\\-to\\-end delivery of key projects, ensuring high standards of quality, reliability, and scalability.\n* Drive engineering best practices across the full development lifecycle, including design reviews, code quality, testing, deployment, and monitoring.\n* Use data and metrics to inform decisions, prioritize work, and continuously improve solutions.\n* Balance short\\-term delivery with long\\-term system health, advocating for reduced technical debt and strategic architecture improvements.\n\n **People Leadership**\n\n* Hire, mentor, and develop high\\-performing engineers through regular coaching, performance reviews, and career planning.\n* Foster a culture of ownership, learning, experimentation, and engineering excellence.\n* Create an environment where engineers are empowered, aligned, and able to deliver their best work.\n* Contribute to quarterly planning and help shape Ratehub’s broader technical and product strategy.\n\n **Collaboration and Communication**\n\n* Partner with Product and Design to define requirements, prioritize backlog items, clarify trade\\-offs, and ensure shared ownership of outcomes.\n* Collaborate with other engineering and cross\\-functional leaders to align on dependencies, architecture, and long\\-term technical direction.\n* Earn trust by communicating progress, risks, and key decisions proactively and effectively to stakeholders and leadership.\n\n**YOUR QUALIFICATIONS**\n-----------------------\n\n\n* 3\\+ years of engineering management experience, with a proven ability to hire, develop, and mentor high\\-performing engineers.\n* 5\\+ years of hands\\-on software engineering experience building modern web applications.\n* 2\\+ years of experience in system design or architecture, with a focus on performance, reliability and scalability of new and existing systems.\n* Strong understanding of engineering best practices across the full software development life cycle, including coding standards, code reviews, version control, build automation, testing, deployment, and monitoring.\n* Experience partnering with product management, design, and data teams to define requirements, plan roadmaps, and deliver high\\-quality solutions.\n* Strong communication and collaboration skills, with an ability to influence and align cross\\-functional partners.\n* Ability to work in a fast\\-paced, ambiguous, high\\-growth environment, with strong ownership and decision\\-making skills\n* Bachelor's or advanced degree in Computer Science, Engineering, or a related technical field\n\n**Nice\\-to\\-haves:**\n\n* Experience leading software development for customer\\-facing financial services or fintech products\n\n**OUR TECH STACK**\n\n* Back\\-end: Node/Express, PHP/Laravel, Java\n* Front\\-end: Javascript/React, styled\\-components/CSS, Next.js\n* Content: Headless wordpress\n* Databases: PostgreSQL, MongoDb, Redis\n* Eventing/Pub\\-Sub: Kafka, Google Pub/Sub\n* CI/CD: GitHub Actions, ArgoCD, Argo Workflows\n* Packaging and Deployment: Docker, Kubernetes, Helm, GCP/GKE\n* Observability and Monitoring: Datadog, Heap\n\n**CULTURE FIT:**\n\n* **Members first** \\- we prioritise the interests and needs of our members above all else.We solve member pain points and focus on member satisfaction. We start with members, and end with the P\\&L.\n* **Growth mindset** \\- we set ambitious goals and challenge the status quo. We take responsible risks and are accountable for our actions.\n* **Better together** \\- we are One team with One common goal. We make our footprint bigger than our foot, leave our egos at the door, support each other to achieve great results as One company.\n* **Run after problems** \\- we tackle problems head on and focus on finding solutions. Obstacles are seen as opportunities for growth and innovation. We have the hard conversations and choose the harder right over the easier wrong. And we do it with a smile.\n* **Measure Learn Iterate Innovate** \\- we focus on getting things done. We measure what matters, iterate, learn, iterate many times in a data\\-driven way, which is how we will innovate.\n\n**JOB PERKS:**\n\n* Competitive salary: We know it’s expensive to live/work in Canada\n* Remote\\-first organization: we love opportunities to get together as a team, but for the most part we offer our employees the flexibility to work anywhere in Canada\n* Flexible hours: Enjoy a couple more hours of sleep in the morning, if you want\n* Benefits: Health is wealth! A benefits package with no employee contribution required\n* Perks: RRSP matching program, individual training allowance, fun team socials (remote AND in\\-person) and more!\n\n\nThis job posting is for a currently open vacancy.\n\n\nAI technology is not used in the screening and assessment process of our recruitment.\n\n\nThe compensation range for this position is $120,000 \\- $170,000 CAD.\n\n  \n\nRatehub welcomes and encourages applications from people with disabilities. Accommodations are available upon request for candidates taking part in all aspects of the selection process.\n\n\n\n\nuVYb4xyBrI",
    "id": "in-d3733a3e1e6c7339",
    "currency": "CAD",
    "site": "indeed",
    "location": "Remote, CA",
    "company": "RateHub",
    "interval": null,
    "is_remote": true,
    "job_url": "https://ca.indeed.com/viewjob?jk=d3733a3e1e6c7339",
    "title": "Software Development Manager",
    "date_posted": "2025-12-01",
    "job_type": "fulltime",
    "max_amount": 120000.0,
    "min_amount": 120000.0,
    "job_url_direct": "https://ratehubinc.applytojob.com/apply/uVYb4xyBrI/Software-Development-Manager?source=INDE&~",
    "company_group": "Ratehub.ca",
    "company_search_term": "RateHub",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": "remote",
    "employment_types": [
      "fulltime"
    ],
    "location_city": "Remote",
    "location_region": "CA",
    "location_country_hint": null,
    "scraped_at": "2026-01-09T22:15:31.946042+00:00",
    "posted_days_ago": null,
    "dedupe_key": "a5a9f3a4754450ce422a49eabb3be338b704b964"
  },
  {
    "description": "**WHO IS RATEHUB?**\n\n  \n\nWe’re a company on a mission. We are a unique Canadian Fintech that is the one\\-stop shop for all financial needs of the consumer: Save, Spend, Borrow, Invest, and Protect. Every single team member — from Product \\& Engineering to Sales \\& Marketing, Finance, Operations, and everything in between — is obsessed with one thing: helping Canadians make better financial choices. And we’re pretty great at it, too. Via our digital application technology and our award\\-winning in\\-house brokerages, we help over 2M Canadians per month make a positive impact on their finances. We have many unique businesses: a mortgage brokerage, a life insurance brokerage, a home and auto insurance brokerage, a mortgage originations and servicing business, a Financial Services Marketplace, and a content business across Ratehub and MoneySense. 365 days a year, we deliver our users the best online mortgage experience, personalized credit card and loan options, and cheaper auto and home insurance policies than they typically get from their existing financial adviser.\n\n\nChanging how people make financial choices isn’t easy, though. We know that achieving our mission is full of challenges — challenges that can be complex and often unexpected but that are always interesting, rewarding, and fun to solve as a team. This is where you come in. We are on the hunt for the right candidate to join us and help lead us forward to continued growth.\n\n  \n\nWe’re looking for an experienced **Software Development Manager (SDM)** who combines strong technical and analytical capabilities with a proven ability to deliver results quickly and effectively. In this role, you will lead a talented team of engineers to build scalable, customer\\-facing software products through iterative, data\\-driven development. You will act as both a strategic operator and an execution\\-focused leader, ensuring the on\\-time delivery of high\\-quality, differentiated solutions that create measurable impact. You’ll also be a strong people leader, capable of mentoring and scaling a high\\-performing engineering team.\n\n**YOUR RESPONSIBILITIES**\n-------------------------\n\n **Technical Strategy and Execution**\n\n* Own the end\\-to\\-end delivery of key projects, ensuring high standards of quality, reliability, and scalability.\n* Drive engineering best practices across the full development lifecycle, including design reviews, code quality, testing, deployment, and monitoring.\n* Use data and metrics to inform decisions, prioritize work, and continuously improve solutions.\n* Balance short\\-term delivery with long\\-term system health, advocating for reduced technical debt and strategic architecture improvements.\n\n **People Leadership**\n\n* Hire, mentor, and develop high\\-performing engineers through regular coaching, performance reviews, and career planning.\n* Foster a culture of ownership, learning, experimentation, and engineering excellence.\n* Create an environment where engineers are empowered, aligned, and able to deliver their best work.\n* Contribute to quarterly planning and help shape Ratehub’s broader technical and product strategy.\n\n **Collaboration and Communication**\n\n* Partner with Product and Design to define requirements, prioritize backlog items, clarify trade\\-offs, and ensure shared ownership of outcomes.\n* Collaborate with other engineering and cross\\-functional leaders to align on dependencies, architecture, and long\\-term technical direction.\n* Earn trust by communicating progress, risks, and key decisions proactively and effectively to stakeholders and leadership.\n\n**YOUR QUALIFICATIONS**\n-----------------------\n\n\n* 3\\+ years of engineering management experience, with a proven ability to hire, develop, and mentor high\\-performing engineers.\n* 5\\+ years of hands\\-on software engineering experience building modern web applications.\n* 2\\+ years of experience in system design or architecture, with a focus on performance, reliability and scalability of new and existing systems.\n* Strong understanding of engineering best practices across the full software development life cycle, including coding standards, code reviews, version control, build automation, testing, deployment, and monitoring.\n* Experience partnering with product management, design, and data teams to define requirements, plan roadmaps, and deliver high\\-quality solutions.\n* Strong communication and collaboration skills, with an ability to influence and align cross\\-functional partners.\n* Ability to work in a fast\\-paced, ambiguous, high\\-growth environment, with strong ownership and decision\\-making skills\n* Bachelor's or advanced degree in Computer Science, Engineering, or a related technical field\n\n**Nice\\-to\\-haves:**\n\n* Experience leading software development for customer\\-facing financial services or fintech products\n\n**OUR TECH STACK**\n\n* Back\\-end: Node/Express, PHP/Laravel, Java\n* Front\\-end: Javascript/React, styled\\-components/CSS, Next.js\n* Content: Headless wordpress\n* Databases: PostgreSQL, MongoDb, Redis\n* Eventing/Pub\\-Sub: Kafka, Google Pub/Sub\n* CI/CD: GitHub Actions, ArgoCD, Argo Workflows\n* Packaging and Deployment: Docker, Kubernetes, Helm, GCP/GKE\n* Observability and Monitoring: Datadog, Heap\n\n**CULTURE FIT:**\n\n* **Members first** \\- we prioritise the interests and needs of our members above all else.We solve member pain points and focus on member satisfaction. We start with members, and end with the P\\&L.\n* **Growth mindset** \\- we set ambitious goals and challenge the status quo. We take responsible risks and are accountable for our actions.\n* **Better together** \\- we are One team with One common goal. We make our footprint bigger than our foot, leave our egos at the door, support each other to achieve great results as One company.\n* **Run after problems** \\- we tackle problems head on and focus on finding solutions. Obstacles are seen as opportunities for growth and innovation. We have the hard conversations and choose the harder right over the easier wrong. And we do it with a smile.\n* **Measure Learn Iterate Innovate** \\- we focus on getting things done. We measure what matters, iterate, learn, iterate many times in a data\\-driven way, which is how we will innovate.\n\n**JOB PERKS:**\n\n* Competitive salary: We know it’s expensive to live/work in Canada\n* Remote\\-first organization: we love opportunities to get together as a team, but for the most part we offer our employees the flexibility to work anywhere in Canada\n* Flexible hours: Enjoy a couple more hours of sleep in the morning, if you want\n* Benefits: Health is wealth! A benefits package with no employee contribution required\n* Perks: RRSP matching program, individual training allowance, fun team socials (remote AND in\\-person) and more!\n\n\nThis job posting is for a currently open vacancy.\n\n\nAI technology is not used in the screening and assessment process of our recruitment.\n\n\nThe compensation range for this position is $120,000 \\- $170,000 CAD.\n\n\nRatehub welcomes and encourages applications from people with disabilities. Accommodations are available upon request for candidates taking part in all aspects of the selection process.\n\n\n\n\nprTGmlbbs1",
    "id": "in-b36024c88f4fe05c",
    "currency": "CAD",
    "site": "indeed",
    "location": "Remote, CA",
    "company": "RateHub",
    "interval": null,
    "is_remote": true,
    "job_url": "https://ca.indeed.com/viewjob?jk=b36024c88f4fe05c",
    "title": "Software Development Manager",
    "date_posted": "2025-12-01",
    "job_type": "fulltime",
    "max_amount": 120000.0,
    "min_amount": 120000.0,
    "job_url_direct": "https://ratehubinc.applytojob.com/apply/prTGmlbbs1/Software-Development-Manager?source=INDE&~",
    "company_group": "Ratehub.ca",
    "company_search_term": "RateHub",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": "remote",
    "employment_types": [
      "fulltime"
    ],
    "location_city": "Remote",
    "location_region": "CA",
    "location_country_hint": null,
    "scraped_at": "2026-01-09T22:15:31.943836+00:00",
    "posted_days_ago": null,
    "dedupe_key": "f79574a92fe5336e46b2d97bd40a102ade965fd1"
  },
  {
    "description": "**WHO IS RATEHUB?**\n\n  \n\nWe’re a company on a mission. We are a unique Canadian Fintech that is the one\\-stop shop for all financial needs of the consumer: Save, Spend, Borrow, Invest, and Protect. Every single team member — from Product \\& Engineering to Sales \\& Marketing, Finance, Operations, and everything in between — is obsessed with one thing: helping Canadians make better financial choices. And we’re pretty great at it, too. Via our digital application technology and our award\\-winning in\\-house brokerages, we help over 2M Canadians per month make a positive impact on their finances. We have many unique businesses: a mortgage brokerage, a life insurance brokerage, a home and auto insurance brokerage, a mortgage originations and servicing business, a Financial Services Marketplace, and a content business across Ratehub and MoneySense. 365 days a year, we deliver our users the best online mortgage experience, personalized credit card and loan options, and cheaper auto and home insurance policies than they typically get from their existing financial adviser.\n\n\nChanging how people make financial choices isn’t easy, though. We know that achieving our mission is full of challenges — challenges that can be complex and often unexpected but that are always interesting, rewarding, and fun to solve as a team. This is where you come in. We are on the hunt for the right candidate to join us and help lead us forward to continued growth.\n\n  \n\nWe’re looking for an experienced **Software Development Manager (SDM)** who combines strong technical and analytical capabilities with a proven ability to deliver results quickly and effectively. In this role, you will lead a talented team of engineers to build scalable, customer\\-facing software products through iterative, data\\-driven development. You will act as both a strategic operator and an execution\\-focused leader, ensuring the on\\-time delivery of high\\-quality, differentiated solutions that create measurable impact. You’ll also be a strong people leader, capable of mentoring and scaling a high\\-performing engineering team.\n\n**YOUR RESPONSIBILITIES**\n-------------------------\n\n **Technical Strategy and Execution**\n\n* Own the end\\-to\\-end delivery of key projects, ensuring high standards of quality, reliability, and scalability.\n* Drive engineering best practices across the full development lifecycle, including design reviews, code quality, testing, deployment, and monitoring.\n* Use data and metrics to inform decisions, prioritize work, and continuously improve solutions.\n* Balance short\\-term delivery with long\\-term system health, advocating for reduced technical debt and strategic architecture improvements.\n\n **People Leadership**\n\n* Hire, mentor, and develop high\\-performing engineers through regular coaching, performance reviews, and career planning.\n* Foster a culture of ownership, learning, experimentation, and engineering excellence.\n* Create an environment where engineers are empowered, aligned, and able to deliver their best work.\n* Contribute to quarterly planning and help shape Ratehub’s broader technical and product strategy.\n\n **Collaboration and Communication**\n\n* Partner with Product and Design to define requirements, prioritize backlog items, clarify trade\\-offs, and ensure shared ownership of outcomes.\n* Collaborate with other engineering and cross\\-functional leaders to align on dependencies, architecture, and long\\-term technical direction.\n* Earn trust by communicating progress, risks, and key decisions proactively and effectively to stakeholders and leadership.\n\n**YOUR QUALIFICATIONS**\n-----------------------\n\n\n* 3\\+ years of engineering management experience, with a proven ability to hire, develop, and mentor high\\-performing engineers.\n* 5\\+ years of hands\\-on software engineering experience building modern web applications.\n* 2\\+ years of experience in system design or architecture, with a focus on performance, reliability and scalability of new and existing systems.\n* Strong understanding of engineering best practices across the full software development life cycle, including coding standards, code reviews, version control, build automation, testing, deployment, and monitoring.\n* Experience partnering with product management, design, and data teams to define requirements, plan roadmaps, and deliver high\\-quality solutions.\n* Strong communication and collaboration skills, with an ability to influence and align cross\\-functional partners.\n* Ability to work in a fast\\-paced, ambiguous, high\\-growth environment, with strong ownership and decision\\-making skills\n* Bachelor's or advanced degree in Computer Science, Engineering, or a related technical field\n\n**Nice\\-to\\-haves:**\n\n* Experience leading software development for customer\\-facing financial services or fintech products\n\n**OUR TECH STACK**\n\n* Back\\-end: Node/Express, PHP/Laravel, Java\n* Front\\-end: Javascript/React, styled\\-components/CSS, Next.js\n* Content: Headless wordpress\n* Databases: PostgreSQL, MongoDb, Redis\n* Eventing/Pub\\-Sub: Kafka, Google Pub/Sub\n* CI/CD: GitHub Actions, ArgoCD, Argo Workflows\n* Packaging and Deployment: Docker, Kubernetes, Helm, GCP/GKE\n* Observability and Monitoring: Datadog, Heap\n\n**CULTURE FIT:**\n\n* **Members first** \\- we prioritise the interests and needs of our members above all else.We solve member pain points and focus on member satisfaction. We start with members, and end with the P\\&L.\n* **Growth mindset** \\- we set ambitious goals and challenge the status quo. We take responsible risks and are accountable for our actions.\n* **Better together** \\- we are One team with One common goal. We make our footprint bigger than our foot, leave our egos at the door, support each other to achieve great results as One company.\n* **Run after problems** \\- we tackle problems head on and focus on finding solutions. Obstacles are seen as opportunities for growth and innovation. We have the hard conversations and choose the harder right over the easier wrong. And we do it with a smile.\n* **Measure Learn Iterate Innovate** \\- we focus on getting things done. We measure what matters, iterate, learn, iterate many times in a data\\-driven way, which is how we will innovate.\n\n**JOB PERKS:**\n\n* Competitive salary: We know it’s expensive to live/work in Canada\n* Remote\\-first organization: we love opportunities to get together as a team, but for the most part we offer our employees the flexibility to work anywhere in Canada\n* Flexible hours: Enjoy a couple more hours of sleep in the morning, if you want\n* Benefits: Health is wealth! A benefits package with no employee contribution required\n* Perks: RRSP matching program, individual training allowance, fun team socials (remote AND in\\-person) and more!\n\n  \n\nThis job posting is for a currently open vacancy.\n\n\nAI technology is not used in the screening and assessment process of our recruitment.\n\n\nThe compensation range for this position is $120,000 \\- $170,000 CAD.\n\n\nRatehub welcomes and encourages applications from people with disabilities. Accommodations are available upon request for candidates taking part in all aspects of the selection process.\n\n\n\n\nQKVY9kckyO",
    "id": "in-0e951394ed4ea6d4",
    "currency": "CAD",
    "site": "indeed",
    "location": "Remote, CA",
    "company": "RateHub",
    "interval": null,
    "is_remote": true,
    "job_url": "https://ca.indeed.com/viewjob?jk=0e951394ed4ea6d4",
    "title": "Software Development Manager",
    "date_posted": "2025-11-26",
    "job_type": "fulltime",
    "max_amount": 120000.0,
    "min_amount": 120000.0,
    "job_url_direct": "https://ratehubinc.applytojob.com/apply/QKVY9kckyO/Software-Development-Manager?source=INDE&~",
    "company_group": "Ratehub.ca",
    "company_search_term": "RateHub",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": "remote",
    "employment_types": [
      "fulltime"
    ],
    "location_city": "Remote",
    "location_region": "CA",
    "location_country_hint": null,
    "scraped_at": "2026-01-09T22:15:31.948278+00:00",
    "posted_days_ago": null,
    "dedupe_key": "59a1396e29fb72dc2e2e7535e6e8a691ef6fe707"
  },
  {
    "description": "### **WHO IS RATEHUB?**\n\n### We’re a company on a mission \\- We are a unique Canadian Fintech that is the one stop shop for all financial needs of the consumer \\- Save, Spend, Borrow, Invest, and Protect. Every single team member, from product \\& engineering to sales \\& marketing, finance, operations, and everything in between is obsessed with one thing; helping Canadians make better financial choices. And we’re pretty great at it, too. Via our digital application technology and our award\\-winning in\\-house brokerages, we help over 2M Canadians per month make a positive impact on their finances. We have many unique businesses \\- a mortgage brokerage, a life insurance brokerage, a home and auto insurance brokerage, a mortgage originations and servicing business, a Financial Services Marketplace and a content business across Ratehub and MoneySense. 365 days a year we deliver our users the best online mortgage experience, personalized Credit Card and Loans options, and cheaper auto \\& home insurance policies than they typically get from their existing financial adviser.\n\n### Changing how people make financial choices isn’t easy, though. We know that achieving our mission is full of challenges; challenges that can be complex and often unexpected, but that are always interesting, rewarding, and fun to solve as a team. This is where you come in. We are on the hunt for the right kind of people to join us and help lead us forward to continued growth.\n\n### The General Manager will shape the next chapter of MoneySense, one of Canada’s most trusted and award\\-winning personal finance media brands. Since joining Ratehub in 2018, MoneySense has remained proudly editorially independent and is focused on expanding its reach and impact.\n\n\n### We’re looking for a leader who can combine editorial excellence with SEO and audience\\-growth expertise to help more Canadians feel confident in their financial decisions. But this role goes beyond editorial: you’ll be responsible for guiding the future of the brand, ensuring MoneySense stays commercially viable (i.e. profitability), strategically aligned, and positioned for long\\-term growth in a rapidly evolving media landscape.\n\n### As General Manager, you’ll set the editorial vision, refine content strategy, and lead a talented team while also shaping how MoneySense continues to thrive as both a trusted resource and a successful business. This is a high\\-impact opportunity to grow a national brand, shape financial conversations in Canada, and lead MoneySense into its future.\n\n### **YOUR RESPONSIBILITIES**\n\n#### **Strategic Leadership**\n\n* Co\\-design and execute a revenue strategy that supports the magazine's positioning in the Canadian market, ensuring reader segments are balanced with business objectives\n* Stay current with industry trends and monitor performance of market competitors, exploring new business opportunities to maximise profitability and market share\n* Define and execute a content strategy that establishes our publication as the go\\-to source for personal finance in Canada.\n* Identify emerging trends in digital publishing and personal finance, leveraging them to maintain our competitive edge.\n* Collaborate with the CEO, Business Unit Director, Head of Product, etc., and cross\\-functional teams (marketing, product, design) to align content with broader company objectives.\n\n#### **Content Strategy, Development, and Management**\n\n* Develop and implement a comprehensive content strategy that aligns with organizational goals, ensuring a consistent and compelling narrative across platforms.\n* Oversee the creation, curation, and distribution of high\\-quality, engaging, and accurate content across all platforms.\n* Set and uphold editorial standards, ensuring all content adheres to our brand voice, SEO best practices, and legal guidelines.\n* Build, manage and mentor a team of writers, editors, freelancers, and contributors, fostering a culture of innovation and excellence.\n* Collaborate with the partner relations team to brainstorm and create engaging paid partner content and campaigns.\n* Occasionally craft high\\-quality, data\\-driven content such as blogs, articles, reports, white papers, and multimedia assets that resonate with our audience.\n* Plan, manage, and execute a content calendar to ensure timely and impactful content delivery.\n\n#### **Audience Growth and Engagement**\n\n* Develop strategies to expand audience reach, retention, and engagement through innovative content formats and platforms.\n* Analyze performance metrics and user feedback to refine the content strategy and meet evolving audience needs.\n* Expand the publication’s reach through partnerships, syndication, and collaborations with industry experts and influencers.\n\n#### **Brand Building**\n\n* Act as the public face of the publication, representing the brand at industry events, media opportunities, and conferences.\n* Cultivate a network of thought leaders, experts, and collaborators to enhance the publication’s authority and visibility.\n\n### **YOUR QUALIFICATIONS**\n\n#### **Experience and Expertise**\n\n* 7\\+ years in editorial leadership roles, ideally within digital publishing or personal finance.\n* Proven success in building and scaling content brands, with a focus on audience growth and revenue generation.\n* Strong understanding of the Canadian personal finance landscape and digital media trends.\n* Experience in real estate\\-related content or a solid understanding of the real estate market is a significant plus.\n\n#### **Skills and Abilities**\n\n* Strategic thinker with a demonstrated ability to drive growth through innovative content strategies.\n* Exceptional editorial judgment and a passion for creating high\\-quality, impactful content.\n* Proficient in CMS, analytics tools (e.g., Google Analytics), and project management software.\n* Strong leadership and team management skills, with the ability to inspire and develop a high\\-performing team.\n* Data\\-driven decision\\-maker, with expertise in analytics tools and SEO best practices.\n\n#### **Personal Attributes**\n\n* Passionate about personal finance and empowering Canadians to make informed financial decisions.\n* Highly collaborative, with excellent communication and relationship\\-building skills.\n* Adaptable and forward\\-thinking, able to thrive in a fast\\-paced, evolving environment.\n\n **CULTURE FIT:**\n\n* **Members first** \\- we prioritise the interests and needs of our members above all else.We solve member pain points and focus on member satisfaction. We start with members, and end with the P\\&L.\n* **Growth mindset** \\- we set ambitious goals and challenge the status quo. We take responsible risks and are accountable for our actions.\n* **Better together** \\- we are One team with One common goal. We make our footprint bigger than our foot, leave our egos at the door, support each other to achieve great results as One company.\n* **Run after problems** \\- we tackle problems head on and focus on finding solutions. Obstacles are seen as opportunities for growth and innovation. We have the hard conversations and choose the harder right over the easier wrong. And we do it with a smile.\n* **Measure Learn Iterate Innovate** \\- we focus on getting things done. We measure what matters, iterate, learn, iterate many times in a data\\-driven way, which is how we will innovate.\n\n**JOB PERKS:**\n\n* Competitive salary: We know it’s expensive to live/work in Canada\n* Remote\\-first organization: we love opportunities to get together as a team, but for the most part we offer our employees the flexibility to work anywhere in Canada\n* Flexible hours: Enjoy a couple more hours of sleep in the morning, if you want\n* Benefits: Health is wealth! A benefits package with no employee contribution required\n* Perks: RRSP matching program, individual training allowance, fun team socials (remote AND in\\-person) and more!\n\n\nThis job posting is for a currently open vacancy.\n\n\nAI technology is not used in the screening and assessment process of our recruitment.\n\n\nRatehub welcomes and encourages applications from people with disabilities. Accommodations are available upon request for candidates taking part in all aspects of the selection process.\n\n\n\n\npB3QXSgQrY",
    "id": "in-2d0975cc43c2defa",
    "currency": null,
    "site": "indeed",
    "location": "Remote, CA",
    "company": "RateHub",
    "interval": null,
    "is_remote": true,
    "job_url": "https://ca.indeed.com/viewjob?jk=2d0975cc43c2defa",
    "title": "General Manager, MoneySense",
    "date_posted": "2025-10-20",
    "job_type": "fulltime",
    "max_amount": null,
    "min_amount": null,
    "job_url_direct": "https://ratehubinc.applytojob.com/apply/pB3QXSgQrY/General-Manager-MoneySense?source=INDE&~",
    "company_group": "Ratehub.ca",
    "company_search_term": "RateHub",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": "remote",
    "employment_types": [
      "fulltime"
    ],
    "location_city": "Remote",
    "location_region": "CA",
    "location_country_hint": null,
    "scraped_at": "2026-01-09T22:15:31.950767+00:00",
    "posted_days_ago": null,
    "dedupe_key": "aa71698707fb7e711312c2efd1f40dad46abb368"
  },
  {
    "description": "Ratehub Inc. is looking for a full time licensed Life Insurance Agent to add to our expanding team. This position requires an individual licensed in Quebec with excellent communication skills, and great work ethic to join our team.\n\n\nOur ideal candidate profile is someone working at a major bank or an insurance company as a licensed Life Insurance Broker/Agent. This is an amazing opportunity for somebody with passion for sales, who is driven to become a successful Life Insurance Agent connecting with motivated buyers.\n\n**About the position**\n\n* High quality leads are provided daily\n* This is a fully remote role\n* Administrative support is provided\n* Competitive compensation structure \\- **100% commission**\n* On\\-target earnings of up to $150,000\n* Regular business hours\n\n**Responsibilities and Duties**\n\n* Converting online leads into closed insurance policies\n* Engaging with clients to determine their needs and provide expert advice to ensure the best coverage for them\n* Building rapport with new clients and strengthen existing relationships to establish a thriving trust\\-based client network\n* Providing excellent customer experience to our clients\n* Exhibiting a continued focus on service excellence\n* Staying current with the latest industry knowledge, competition, and market trends\n* Other responsibilities as assigned\n\n**Required Qualities and Skills**\n\n* Strong sales background with a drive to attract new clients and close sales\n* Minimum 5 years of life insurance sales experience demonstrating a proven track record of success\n* Quebec LLQP license in good standing\n* Proficient in using sales tools and software\n* Ability to multitask and pay strong attention to detail\n* Excellent time management skills, allowing you to prioritize tasks effectively and achieve ambitious sales targets.\n* Ability to develop and build client relationships\n\n**Why is this an amazing opportunity?**\n\n* Ratehub is one of Canada’s fastest growing companies\n* Ratehub is the most visited personal finance website in Canada\n* You will be a part of a highly intelligent sales team\n* Proven track record of building award winning brokerages\n* High quality leads are provided\n* We love helping Canadians make the right decisions when it comes to Life Insurance, Critical Illness and Disability coverage\n\n\nRatehub welcomes and encourages applications from people with disabilities. Accommodations are available upon request for candidates taking part in all aspects of the selection process.\n\n\n\n\nU2ZK9oNbvY",
    "id": "in-4727bbed40174705",
    "currency": "CAD",
    "site": "indeed",
    "location": "Remote, CA",
    "company": "RateHub",
    "interval": null,
    "is_remote": true,
    "job_url": "https://ca.indeed.com/viewjob?jk=4727bbed40174705",
    "title": "Life Insurance Agent - Quebec Market",
    "date_posted": "2025-01-24",
    "job_type": "fulltime",
    "max_amount": 150000.0,
    "min_amount": 150000.0,
    "job_url_direct": "https://ratehubinc.applytojob.com/apply/032c111b565a7b025b486758690a786564661a1e00211e5413447415212e29023e661b/Life-Insurance-Agent-Quebec-Market?sid=iCsDdjI6jxWkX9MUPWEWHkRmVu0LcxsOy6B&source=INDE&~",
    "company_group": "Ratehub.ca",
    "company_search_term": "RateHub",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": "remote",
    "employment_types": [
      "fulltime"
    ],
    "location_city": "Remote",
    "location_region": "CA",
    "location_country_hint": null,
    "scraped_at": "2026-01-09T22:15:31.951471+00:00",
    "posted_days_ago": null,
    "dedupe_key": "c55382ac30426ce2d44d46692987acb5c00f24ff"
  },
  {
    "description": "ABOUT US:  \n\n\n\n  \n\n  \n\nWe’re a talented team of product managers, digital marketers, developers, and product designers building Canada’s leading financial product comparison platform, Ratehub.ca (think Expedia, but for financial products). We compare mortgage rates, credit card rewards, deposit returns and insurance quotes.\n\n  \n\nWe love helping Canadians save money by empowering them with the tools to make smart financial decisions. We believe in financial transparency, product innovation, entrepreneurship, and community. That’s our modus operandi.\n\n  \n\nTHE ROLE:\n\n  \n\nWe are looking for a passionate web developer to join the Ratehub team who will play a central role in the keeping Ratehub’s web interfaces up\\-to\\-date and looking beautiful. The ideal candidate will work closely with skilled product owners, UI/UX designers and other engineers to build applications that exceed customers expectations and improve the way they find financial products.\n\n* Creating elegant and responsive web interfaces that work across a range of browsers and devices using HTML5, CSS3, ES6, React, and Webpack\n* Maintaining and extending our blog and content management systems\n* Building integration points between systems using web services and leveraging external web services to provide functionality\n* Working with support, marketing, business and other team members to identify product and process improvements, suggest implementation options, trade\\-off alternatives, and make engineering decisions\n\n  \n\nAs a growing, late\\-stage startup, we look for self\\-starters who thrive in a fast\\-paced, agile environment – which means wearing many hats, being able to change direction quickly, and showing an eagerness to learn new technologies as the need arises. And most importantly – we look for people who can prioritize, multitask, and deliver – because it’s a lot more fun to get things done.\n\n  \n\nRatehub offers a friendly, innovative and collaborative work environment and our engineering team is based in downtown Kingston, ON. Our talented team drives our success, and we support each individual in fulfilling his or her potential.\n\n  \n\nCULTURE FIT:\n\n* High performer: You’re not a 9\\-to\\-5er but a project completer\n* Passionate: You inspire others with your thirst for excellence\n* Resourceful: You don’t have all the answers, but you know how to get them\n* Meticulous: You’re borderline obsessive about quality of work and ensuring users get the best possible experience\n\n  \n\nYOUR QUALIFICATIONS:\n\n* 2\\+ years experience building web and mobile\\-optimized websites\n* Proficiency with HTML and CSS, and experience implementing complex layouts with a high degree of fidelity to designs; experience with SASS\n* A high degree of comfort with JavaScript; experience with a modern JS application framework (React/Flux, Ember, Angular, etc.) a strong plus\n* Knowledge of content management systems (CMS) and experience customizing/extending CMSes to provide web applications\n* Experience with source version control; Git strongly preferred\n* Familiarity with Linux, MacOS or another Unix\\-like operating system; feeling at home in the terminal\n* Excellent verbal and written communication skills\n\n  \n\nJOB PERKS:\n\n* Competitive salary: Our people are our most important asset\n* Medical \\& dental coverage: Health is wealth\n* Continuing education: Conference and learning budget\n* Casual dress code: If it’s good enough for you, it’s good enough for us\n\n  \n\nHOW TO APPLY:\n\n  \n\nPlease submit your resume or a link to your LinkedIn profile.",
    "id": "in-37319d46cfe015d3",
    "currency": null,
    "site": "indeed",
    "location": "Kingston, ON, CA",
    "company": "RateHub",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=37319d46cfe015d3",
    "title": "Front-end Web Developer",
    "date_posted": "2018-02-13",
    "job_type": "fulltime",
    "max_amount": null,
    "min_amount": null,
    "job_url_direct": "https://ratehub.bamboohr.com/careers/2?source=indeed&src=indeed&postedDate=2018-02-13",
    "company_group": "Ratehub.ca",
    "company_search_term": "RateHub",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": [
      "fulltime"
    ],
    "location_city": "Kingston",
    "location_region": "ON",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:31.953080+00:00",
    "posted_days_ago": null,
    "dedupe_key": "586dd1ce380099ab5d87914fff1835f254ad83e3"
  }
]