[
  {
    "description": "**Requisition ID**: 211418\n\n\nTangerine is Canada’s leading direct bank. We offer flexible and accessible banking options, innovative products, and award\\-winning Client service. The reason why Tangerine employees come to work each day is to help Canadians live better lives. We focus on making a difference in our communities, and that includes our own internal community. It’s important to us that our employees feel empowered and enthusiastic about belonging to our Orange culture.\n\n**About Tangerine**\n===================\n\n\nAs Canada’s leading digital bank, Tangerine technology is at the heart of everything we do. We redefine digital banking, continually evolving to create innovative, forward\\-thinking solutions with our clients’ needs in mind. Our high\\-performing, collaborative teams thrive in a high\\-trust agile environment, delivering best\\-in\\-class solutions for our customers. Join us to help shape the future of Canadian banking!\n\n**Role Purpose**\n================\n\n\nAs a Mobile Architect, you will lead the design and architecture of Tangerine’s mobile banking applications across multiple platforms (Android and iOS). You will drive technical strategy, set standards, and ensure the delivery of scalable, secure, and high\\-quality mobile solutions that impact our customers. You will collaborate with cross\\-functional teams and mentor developers, fostering innovation and excellence.\n\n**Key Accountabilities**\n========================\n\n* Mobile Architecture \\& Strategy: Define and own the mobile application architecture, ensuring scalability, maintainability, and security across Android and iOS platforms.\n* Technical Leadership: Serve as the technical authority for mobile development, guiding teams on best practices, emerging technologies, and architectural decisions.\n* Code Quality \\& Standards: Establish and enforce coding standards, conduct architecture and code reviews, and ensure adherence to performance and reliability benchmarks.\n* Mentorship \\& Coaching: Mentor senior and junior mobile developers, fostering a culture of continuous learning and technical excellence.\n* Collaboration: Partner with Product, Design, QA, Backend, and DevOps teams to deliver seamless, end\\-to\\-end mobile solutions.\n* Performance Optimization: Oversee performance tuning, security hardening, and scalability improvements for mobile applications.\n* Innovation: Stay abreast of industry trends, evaluate new tools and frameworks, and drive adoption of innovative solutions.\n\n**Minimum Qualifications**\n==========================\n\n* Experience: 8\\+ years of professional mobile development experience, including significant experience architecting and delivering complex mobile applications, preferably for both Android and iOS.\n* Technical Expertise:\n* Deep proficiency in Kotlin and Swift\n* Strong understanding of Android and iOS frameworks, components, and design and architectural patterns (MVVM, MVI, MVP, VIPER, etc.).\n* Experience with RESTful APIs, third\\-party integrations, and mobile security best practices.\n* Familiarity with Google’s Material Design and Apple’s Human Interface Guidelines.\n* Proficiency with Android Studio, Xcode, Gradle, and version control (Git).\n* Experience with automated testing frameworks and CI/CD pipelines for mobile.\n* Architecture Skills: Proven track record in designing scalable, modular, and maintainable mobile architectures.\n* Agile Methodologies: Comfortable working in Agile/Scrum environments, including sprint planning, estimation, and retrospectives.\n* Soft Skills:\n* Excellent problem\\-solving and analytical skills.\n* Strong verbal and written communication skills.\n* Ability to lead, influence, and collaborate in a fast\\-paced team setting.\n\n **What's in it for you?**\n\n  \n\n* You will be part of a diverse and inclusive team of Client\\-focused go\\-getters looking to learn from each other in an environment that celebrates and recognizes success!\n* You will have access to thousands of online and in person courses so you can shape your career growth with the support from diverse industry leaders.\n* You will get our help to save for your future and to invest in your total wellbeing through our Tangerine benefits\\*.\n* You belong here, we are equal and un\\-complicated. Bring your true self to work, dress codes don’t apply here.\n* You will enjoy workspace flexibility and all the excitement that comes from working at the official Bank of the Toronto Raptors.\n\n* Tangerine employees participate in Scotiabank’s pension \\& benefits programs (available to permanent employees)\n\n\nLocation(s): Canada : Ontario : Toronto\n\n\nAt Tangerine we value the unique skills and experiences each individual brings to the team, and are committed to creating and maintaining an inclusive and accessible environment. If you require accommodation during the recruitment and selection process, please let our Recruitment team know.",
    "id": "in-5eb2fb50ee5dea60",
    "currency": null,
    "site": "indeed",
    "location": "Toronto, ON, CA",
    "company": "Tangerine",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=5eb2fb50ee5dea60",
    "title": "Mobile Architect",
    "date_posted": "2026-01-09",
    "job_type": null,
    "max_amount": null,
    "min_amount": null,
    "job_url_direct": "https://jobs.scotiabank.com/Tangerine/job/Toronto-Mobile-Architect-ON-M2H0A1/598714517/?feedId=352460&utm_source=Indeed&utm_campaign=TheBankofNovaScotia_Indeed",
    "company_group": "Tangerine",
    "company_search_term": "Tangerine",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": null,
    "location_city": "Toronto",
    "location_region": "ON",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:14.373395+00:00",
    "posted_days_ago": null,
    "dedupe_key": "080745488ba70be21bed700469581f4a138a0bb5"
  },
  {
    "description": "**Requisition ID**: 238197\n\n\nTangerine is Canada’s leading direct bank. We offer flexible and accessible banking options, innovative products, and award\\-winning Client service. The reason why Tangerine employees come to work each day is to help Canadians live better lives. We focus on making a difference in our communities, and that includes our own internal community. It’s important to us that our employees feel empowered and enthusiastic about belonging to our Orange culture.\n\n  \n\nAs Canada’s leading digital bank, Tangerine technology is at the heart of everything we do. We have redefined what digital banking is, and we continue to evolve to tackle any opportunity and face every challenge through progressive technology and the power of collaboration.\n\n  \n\nDo you like new challenges? Are you ready to reach new heights in your career and become part of an established disruptor? If so, come join us and help redefine the Canadian banking landscape!\n\n **What you will be doing:**\n\n  \n\nContributes to Tangerine’s overall success and growth of Tangerine Investments by building trusted relationships with new and existing clients. Models an entrepreneurial mindset and ensures specific individual activity targets, goals, plans, and initiatives are executed and delivered in support of the team’s business strategies and objectives. Ensures all activities are conducted in compliance with governing regulations and internal policies and procedures.\n\n **Is this role right for you? In this role, you will:**\n\n  \n\n* Develop and build trusted client relationships by proactively delivering effective investments and financial advice:  \n\n\t+ Conduct deep discovery and financial needs assessments to understand clients’ life priorities and preferences, goals, financial position, and risk appetite.\n\t+ Offer tailored, high\\-quality financial advice on investments based on clients’ life priorities and preferences, leveraging strong subject matter expertise of Tangerine investments products, including structure, features, risks, and costs.\n\t+ Using marketing and lead generation data, and through proactive prospecting outreach, seek out, identify and connect with existing Tangerine clients and prospects to build new client relationships.\n\t+ Identify and refer opportunities for savings, loans, and other financial services products to provide holistic support and advice.\n\t+ In client interactions, use language and share information appropriate to the client’s level of investment knowledge, interest, and sophistication.\n\t\n\tEducate and empower clients to use online and digital self\\-serve tools.  \n\t+\n* Effectively execute business development activities focused on driving growth to the wealth business:\n\t+ Implement a highly proactive client contact strategy, including planned calls and leveraging referrals.\n\t+ Ask for referrals from satisfied clients to generate sales and increase market share.\n\t+ Conduct outbound marketing activities to attract business from new and existing clients.\n\t\n\tWork closely with marketing and lead generation teams on strategy and execution.  \n\t+\n* Contribute to the effectiveness of the Tangerine Wealth team:\n\t+ Establish and maintain personal finance expertise by participating in ongoing professional development.\n\t+ Keep informed and current on financial services/market trends and new Tangerine products, services, and initiatives.\n\t+ Work toward meeting productivity goals and targets.\n\t\n\tIdentify areas and recommend solutions to the Management team to improve the overall client experience.  \n\t+\n* Minimize Tangerine’s exposure to risk:\n\t+ Ensure all client interactions rigorously adhere to the Global Sales Principles guidelines.\n\t+ Comply with regulatory activities and guidelines as part of the sales process, including (but not limited to) Privacy, Anti\\-Money Laundering/Anti\\-Terrorist Financing (AML/ATF), Financial Consumer Agency of Canada (FCAC), Know Your Client (KYC), Canadian Deposit Insurance Corporation (CDIC), Mutual Fund Dealer Association (MFDA) rules, regulations and policies, as well as Scotia Securities Inc. (SSI) guidelines/processes and Guidelines for Business Conduct.\n\t+ Adhere to Tangerine security procedures, including internal policies and processes, assigned authorities, and limits.\n\t+ Stay current on compliance and regulatory requirements.\n\t+ Ensure strict adherence to security procedures, assigned authorities, and limits.\n\t+ Escalate fraudulent activities, unusual occurrences, and issues/deficiencies/trends to your direct supervisor and/or Manager and/or escalation protocols.\n\n **Do you have the skills that will enable you to succeed in this role? We'd love to work with you if you have:**\n\n  \n\n* Expert knowledge of:\n\t+ Deliver personalized, advice\\-driven conversations that reflect client priorities\n\t+ Uncover client goals and needs through deep discovery\n\t+ Build long\\-term relationships by supporting clients across life stages\n\t+ Provide informed investment advice using strong product knowledge\n\t+ Apply market insights to enhance client recommendations\n\t+ Ensure all interactions meet regulatory and compliance standards\n\t+ Managing a sales process\n* Ability to multi\\-task and work in a dynamic and changing environment\n* Post\\-secondary education in Business or a related field\n* Minimum 3\\-5 years of work experience, as a financial planner or investment advisor, dealing 1:1 with clients\n* Preferably previous registration with an Investment Dealer and experience in Stocks, Bonds, ETFs and Mutual funds\n* Minimum Requirement: Licensed as a Mutual Fund Dealing Representatives\n* Either working towards or successfully completed either Certified Financial Planner (CFP) or Personal Financial Planner (PFP) designations.\n* Fluent verbal and written communication skills in English\n* Fluent verbal and written communication skills in French is an asset\n* Excellent sales and client service skills\n* Proven networking, client acquisition, and interpersonal skills\n\n **What's in it for you?**\n\n  \n\n* Work in a mission\\-driven culture that prioritizes empowerment, diversity, and continuous learning.\n* Join a modern banking environment where design plays a central role in shaping client value.\n* Be part of a high\\-visibility team that is reimagining the future of personal finance in Canada.\n* You will get our help to save for your future and to invest in your total wellbeing through our Tangerine benefits\\*.\n* You belong here, we are equal and un\\-complicated. Bring your true self to work, dress codes don’t apply here.\n* You will enjoy workspace flexibility and all the excitement that comes from working at the official Bank of the Toronto Raptors.\n\n* Tangerine employees participate in Scotiabank’s pension \\& benefits programs (available to permanent employees)\n  \n\nLocation(s): Canada : Ontario : Toronto\n\n\nAt Tangerine we value the unique skills and experiences each individual brings to the team, and are committed to creating and maintaining an inclusive and accessible environment. If you require accommodation during the recruitment and selection process, please let our Recruitment team know.",
    "id": "in-3d75809883473d5f",
    "currency": null,
    "site": "indeed",
    "location": "Toronto, ON, CA",
    "company": "Tangerine",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=3d75809883473d5f",
    "title": "Tangerine Advisor, Growth - Tangerine",
    "date_posted": "2026-01-08",
    "job_type": null,
    "max_amount": null,
    "min_amount": null,
    "job_url_direct": "https://jobs.scotiabank.com/Tangerine/job/Toronto-Tangerine-Advisor%2C-Growth-Tangerine-ON/596494917/?feedId=352460&utm_source=Indeed&utm_campaign=TheBankofNovaScotia_Indeed",
    "company_group": "Tangerine",
    "company_search_term": "Tangerine",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": null,
    "location_city": "Toronto",
    "location_region": "ON",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:14.377681+00:00",
    "posted_days_ago": null,
    "dedupe_key": "86546e1255a2c42c7a66cb223d4615f36110c3be"
  },
  {
    "description": "**Requisition ID**: 244339\n\n\nTangerine is Canada’s leading direct bank. We offer flexible and accessible banking options, innovative products, and award\\-winning Client service. The reason why Tangerine employees come to work each day is to help Canadians live better lives. We focus on making a difference in our communities, and that includes our own internal community. It’s important to us that our employees feel empowered and enthusiastic about belonging to our Orange culture.\n\n  \n\nDo you like new challenges? Are you ready to reach new heights in your career and become part of an established disruptor? If so, come join us and help redefine the Canadian banking landscape!\n\n **What you will be doing:**\n\n\nWe are seeking a Senior DevOps Specialist with strong hands\\-on experience in Cloud Migration, devOps Development ( CI/CD pipelines ,Jenkins/Github Action, Terraform), combined with exposure to AI Ops and application modernization initiatives. Our environment is primarily google cloud and you will be leading efforts around building, optimizing, and scaling DevOps practices tailored for Java\\-based applications  \n\nThe Sr DevOps Specialist will be working to extend the release automation and deployment capabilities across a diverse set of Java based enterprise applications, including but not limited to running source control management in Git through automated build and packaging using Jenkins pipelines, automated deployment and test execution, to automation and provisioning of Cloud\\-Based environments based on Kubernetes (both Linux and Windows). The DevOps Specialist is primary responsible for cloud migration , automating and maintaining CI/CD pipeline and CI environments.\n\n **Is this role right for you? In this role, you will:**\n\n* Working to extend the release automation and deployment capabilities across a diverse set of Java based enterprise applications, including but not limited to running source control management in Git through automated build and packaging using Jenkins pipelines, automated deployment and test execution, to automation and provisioning of Cloud\\-Based environments based on Kubernetes (both Linux and Windows).\n* Primary responsible for cloud migration , automating and maintaining CI/CD pipeline and CI environments.\n* A successful candidate for this position should have past development experience in addition to his devOps skill sets.\n* Should have Strong cloud expertise and be comfortable working independently as well as being part of a collaborative environment.\n* Hands\\-on development experience and breadth of technical skills, the right candidate will also have a good understanding of current best practices, configuration management, and deployment automation.\n* Have experienced in release coordinating and deployment and willing to work on overnight deployments.\n* Ideal candidates will have a financial services background, preferably with experience working at one or more of the Big Five Canadian banks or any similar institutions.\n* Candidate should be comfortable acting as an architect and project lead, driving strategic DevOps transformations across complex financial applications and infrastructure.\n\n **Do you have the skills that will enable you to succeed in this role? We'd love to work with you if you have:**\n\n* Proficient in knowledge of technologies and processes like Agile Software Delivery, Continuous Integration and Continuous Delivery, DevOps, GitOps, Cloud Native Technologies including Docker Containers and Kubernetes, and Deployment Automation \\& Orchestration.\n* Maintain a technical proficiency with respect to programming languages, scripts and processes to ensure that Tangerine is well positioned for technological advances in the marketplace.\n* Ability to use a wide variety of open source technologies and cloud services (GCP and GKE).\n* Assist/support developers troubleshooting efforts of applications in development environments. Timely resolution/investigation of deployments and development environments issues.\n* Maintain and manage the non\\-Production environments to ensure stability and uptime.\n* Develop Jenkins CICD pipelines\\-as\\-code to run and maintain non\\-Production environments to ensure stability and uptime.\n* Champions a customer focused culture to deepen client relationships and leverage broader Bank relationships, systems and knowledge.\n* Understand how the Bank’s risk appetite and risk culture should be considered in day\\-to\\-day activities and decisions.\n* Actively pursues effective and efficient operations of his/her respective areas in accordance with Tangerine’s Values, its Code of Conduct and the Global Sales Principles, while ensuringthe adequacy, adherence to and effectiveness of day\\-to\\-day business controls to meet obligations with respect to operational, compliance, AML/ATF/sanctions and conduct risk.\n* Champions a high performance environment and contributes to an inclusive work environment.\n* Responsible for Mobile Strategy, Deployment and releases \\- iOS and Android\n\n **What's in it for you?**\n\n* You will be part of a diverse and inclusive team of Client\\-focused go\\-getters looking to learn from each other in an environment that celebrates and recognizes success!\n* You will have access to thousands of online and in\\-person courses so you can shape your career growth with support from diverse industry leaders.\n* You will get our help to save for your future and to invest in your total well\\-being through our Tangerine benefits.\n* You belong here, and we are equal and uncomplicated. Bring your true self to work, dress codes don’t apply here.\n* You will enjoy workspace flexibility and all the excitement that comes from working at the official Bank of the Toronto Raptors.\n\n\nLocation(s): Canada : Ontario : Toronto\n\n\nAt Tangerine we value the unique skills and experiences each individual brings to the team, and are committed to creating and maintaining an inclusive and accessible environment. If you require accommodation during the recruitment and selection process, please let our Recruitment team know.",
    "id": "in-49a59ef07caeec99",
    "currency": null,
    "site": "indeed",
    "location": "Toronto, ON, CA",
    "company": "Tangerine",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=49a59ef07caeec99",
    "title": "Sr. DevOps Specialist - Tangerine",
    "date_posted": "2026-01-08",
    "job_type": null,
    "max_amount": null,
    "min_amount": null,
    "job_url_direct": "https://jobs.scotiabank.com/Tangerine/job/Toronto-Sr_-DevOps-Specialist-Tangerine-ON-M2H0A1/598013717/?feedId=352460&utm_source=Indeed&utm_campaign=TheBankofNovaScotia_Indeed",
    "company_group": "Tangerine",
    "company_search_term": "Tangerine",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": null,
    "location_city": "Toronto",
    "location_region": "ON",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:14.375368+00:00",
    "posted_days_ago": null,
    "dedupe_key": "0b04889221c9ff6419ba5dd57ff4a3956cd64744"
  },
  {
    "description": "**Requisition ID**: 246517\n\n\nTangerine is Canada’s leading direct bank. We offer flexible and accessible banking options, innovative products, and award\\-winning Client service. The reason why Tangerine employees come to work each day is to help Canadians live better lives. We focus on making a difference in our communities, and that includes our own internal community. It’s important to us that our employees feel empowered and enthusiastic about belonging to our Orange culture.\n\n  \n\nThe Risk Management mandate is to provide oversight, monitoring and reporting of all operational, credit and market risks, including fraud exposures on an enterprise\\-wide basis. It is comprised of four well\\-defined functions: Operational Risk Management, Retail Credit Risk Management, Wholesale Credit Risk Management and Market Risk Management. The Senior Manager of Strategic Initiatives and Portfolio Oversight, Credit Risk is accountable for monitoring the various credit portfolios at Tangerine to ensure we are staying within risk appetite. This role is also responsible for managing our strategic roadmap within credit risk. The Senior Manager will report directly to the Director, Retail Credit Risk. Primary elements include: ownership of the deck for the monthly Local Risk Credit Committee, creation of new reports to enhance the oversight of the portfolio such as early warning reporting, ownership of the credit risk roadmap, and representing the team on large strategic projects. **Is this role right for you? In this role, you will:*** Provide Credit Risk leadership and execution expertise with particular focus on the Credit Card program, working with stakeholders across Tangerine and Bank of Nova Scotia Risk teams, Product, Marketing, frontline operations and vendors.\n* Develop a reporting framework to ensure continued portfolio health moving forward\n* Lead reporting and ongoing enhancement of credit policy and risk strategy to drive organic business growth and loss mitigation plans with balanced risk/reward trade\\-off.\n* Manage portfolio loss results to acceptable levels, while supporting business profitability objectives, regulatory requirements and Tangerine’s client centric business mission.\n* Provide coaching and mentoring to foster a strong risk discipline environment.\n* Collaborate with Acquisition risk and Operations risk teams to ensure compliance with regulatory requirements.\n* Lead and support the development and implementation of credit risk and loss mitigation plans and provide insight to business leaders through ad hoc requests, projects and initiatives.\n* Bring a sense of urgency in driving initiatives through to the finish line\n* Responsible for understanding and complying with the Regulatory Compliance Framework including the Anti\\-Money Laundering/Anti\\-Terrorist Financing and Sanctions Policy and all AML related policies, procedures and controls within the department.\n* Other duties as assigned.\n **Do you have the skills that will enable you to succeed in this role? \\- We'd love to work with you if you have:*** University Degree in business or equivalent\n* Minimum 10 years of financial services experience, with particular focus and emphasis on Credit Risk\n* Proven leadership in operational function support, system and project implementation and vendor management\n* Proven leadership in the establishment of procedure structure, policies and/or programs within a business or function\n* Strong capability to work with senior business leaders\n* Strong ability to lead cross functional teams and collaborate effectively in high pressure environment\n* Strong presentation and “story\\-telling” skills\n* Aptitude for innovation and readiness to “roll up sleeves” and do what is necessary to deliver on business objectives\n* Excellent leadership and communication\n* Strong verbal and written communication skills\n* Strong attention to detail\n* Strong change management and people development skills\n **What’s in it for you?*** An inclusive \\& collaborative working environment that encourages creativity, curiosity, and celebrates success!\n* We offer a competitive rewards package: Performance bonus, Employee Share Ownership Program, and Pension Plan Matching, Health Benefits from day one!\n* Your career matters! You will have access to career development and progression opportunities.\n\n\nLocation(s): Canada : Ontario : Toronto\n\n\nAt Tangerine we value the unique skills and experiences each individual brings to the team, and are committed to creating and maintaining an inclusive and accessible environment. If you require accommodation during the recruitment and selection process, please let our Recruitment team know.",
    "id": "in-84df50741ae481c3",
    "currency": null,
    "site": "indeed",
    "location": "Toronto, ON, CA",
    "company": "Tangerine",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=84df50741ae481c3",
    "title": "Senior Manager, Strategic Initiatives and Portfolio Oversight",
    "date_posted": "2026-01-06",
    "job_type": null,
    "max_amount": null,
    "min_amount": null,
    "job_url_direct": "https://jobs.scotiabank.com/Tangerine/job/Toronto-Senior-Manager%2C-Strategic-Initiatives-and-Portfolio-Oversight-ON-M5C2W1/598593117/?feedId=352460&utm_source=Indeed&utm_campaign=TheBankofNovaScotia_Indeed",
    "company_group": "Tangerine",
    "company_search_term": "Tangerine",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": null,
    "location_city": "Toronto",
    "location_region": "ON",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:14.379449+00:00",
    "posted_days_ago": null,
    "dedupe_key": "5bcf1fe7729a6e0741448f60e86eb53a3998df8d"
  },
  {
    "description": "**Requisition ID**: 246492\n\n\nTangerine is Canada’s leading direct bank. We offer flexible and accessible banking options, innovative products, and award\\-winning Client service. The reason why Tangerine employees come to work each day is to help Canadians live better lives. We focus on making a difference in our communities, and that includes our own internal community. It’s important to us that our employees feel empowered and enthusiastic about belonging to our Orange culture.\n\n  \n\nAs Canada’s leading digital bank, Tangerine technology is at the heart of everything we do. We have redefined what digital banking is, and we continue to evolve to tackle any opportunity and face every challenge through progressive technology and the power of collaboration.\n\n  \n\nDo you like new challenges? Are you ready to reach new heights in your career and become part of an established disruptor? If so, come join us and help redefine the Canadian banking landscape!\n\n **What you will be doing:**\n\n  \n\nThe Senior Manager, Digital Marketing Delivery is responsible for leading a team of Digital Marketing Delivery Managers to ensure seamless collaboration and execution of end\\-to\\-end customer journeys across all digital marketing campaigns. This role will oversee strategic delivery, ensuring alignment with business objectives and driving operational excellence across the fully owned digital marketing funnel. The Senior Manager will work in close partnership with the Client Strategy, Marketing Planning, Content Designers and Client Solution Product teams to shape and execute integrated strategies that drive maximum impact and efficiency. This role demands exceptional leadership to inspire, mentor, and empower the team, fostering a high\\-performance culture built on innovation, collaboration, and accountability.\n\n  \n\nThe Senior Manager, Digital Marketing Delivery will report directly to the Director, Digital Marketing Delivery.\n\n **Is this role right for you? In this role, you will:**\n\n  \n\n* Lead the strategic orchestration and execution of all digital marketing campaigns across owned channels including email, push notifications, mobile ads, .com promotions, and emerging digital touchpoints.\n* Guide and collaborate with editorial and creative teams to deliver content that aligns with marketing strategy and campaign objectives, ensuring consistency and impact.\n* Champion cross\\-functional partnerships across Marketing, Client Experience, Customer Insights, Product Management, Martech, Contact Centres, and other key stakeholders to deliver growth and retention\\-focused communications and measure success.\n* Champion a culture of data\\-driven decision\\-making by leveraging advanced analysis of client behaviour, channel performance, and segmentation to deliver data\\-informed campaign optimizations that enhance message relevance and maximize campaign ROI.\n* Collaborate with the team to harness analytic platforms such as Google Analytics and Looker Studio Pro to monitor campaign performance, apply real\\-time optimizations, and uncover actionable insights that shape future strategies.\n* Foster strong collaborative relationships with Tangerine Marketing and Product teams, acting as a trusted advisor and strategic partner.\n* Lead and mentor a team of Digital Marketing Delivery Managers, providing guidance, coaching, and performance management to build capability and deliver excellence.\n* Ensure compliance with banking and regulatory requirements, maintaining awareness of amendments and responsibilities to safeguard organizational integrity.\n* Other duties as assigned.\n\n **Do you have the skills that will enable you to succeed in this role? We'd love to work with you if you have:**\n\n  \n\n* University Degree in Marketing, Advertising and/or equivalent combination of education and work experience – MBA from a leading institution is highly desirable\n* Minimum 6\\-8 years of marketing experience in demanding digital\\-oriented Tier\\-1 organizations (e.g. Telco, Banking, Retail, Technology, etc.)\n* Minimum 6\\-8 years of strategic digital marketing experience, working in an agile/quick to market environment is an asset\n* Hands\\-on experience with journey orchestration platforms such as Adobe Journey Optimiser (AJO), Braze, or similar tools for designing and managing customer journeys.\n* Familiarity with analytics platforms like Google Analytics (GA) or Adobe Analytics for measuring and optimizing campaign performance.\n\n **What's in it for you?**\n\n  \n\n* Work in a mission\\-driven culture that prioritizes empowerment, diversity, and continuous learning.\n* Join a modern banking environment where design plays a central role in shaping client value.\n* Be part of a high\\-visibility team that is reimagining the future of personal finance in Canada.\n* You will get our help to save for your future and to invest in your total wellbeing through our Tangerine benefits\\*.\n* You belong here, we are equal and un\\-complicated. Bring your true self to work, dress codes don’t apply here.\n* You will enjoy workspace flexibility and all the excitement that comes from working at the official Bank of the Toronto Raptors.\n\n* Tangerine employees participate in Scotiabank’s pension \\& benefits programs (available to permanent employees)\n\n  \n\nLocation(s): Canada : Ontario : Toronto\n\n\nAt Tangerine we value the unique skills and experiences each individual brings to the team, and are committed to creating and maintaining an inclusive and accessible environment. If you require accommodation during the recruitment and selection process, please let our Recruitment team know.",
    "id": "in-70f3ad0e691bde7d",
    "currency": null,
    "site": "indeed",
    "location": "Toronto, ON, CA",
    "company": "Tangerine",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=70f3ad0e691bde7d",
    "title": "Senior Manager, Digital Marketing Delivery - Tangerine",
    "date_posted": "2026-01-06",
    "job_type": null,
    "max_amount": null,
    "min_amount": null,
    "job_url_direct": "https://jobs.scotiabank.com/Tangerine/job/Toronto-Senior-Manager%2C-Digital-Marketing-Delivery-Tangerine-ON-M5C2W1/598572917/?feedId=352460&utm_source=Indeed&utm_campaign=TheBankofNovaScotia_Indeed",
    "company_group": "Tangerine",
    "company_search_term": "Tangerine",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": null,
    "location_city": "Toronto",
    "location_region": "ON",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:14.382935+00:00",
    "posted_days_ago": null,
    "dedupe_key": "35eb7b2787565d39eb69fc7e7873117b51d22c57"
  },
  {
    "description": "**Requisition ID**: 246692\n\n\nTangerine is Canada’s leading direct bank. We offer flexible and accessible banking options, innovative products, and award\\-winning Client service. The reason why Tangerine employees come to work each day is to help Canadians live better lives. We focus on making a difference in our communities, and that includes our own internal community. It’s important to us that our employees feel empowered and enthusiastic about belonging to our Orange culture.\n\n  \n\nAs Canada’s leading digital bank, Tangerine technology is at the heart of everything we do. We have redefined what digital banking is, and we continue to evolve to tackle any opportunity and face every challenge through progressive technology and the power of collaboration.\n\n  \n\nDo you like new challenges? Are you ready to reach new heights in your career and become part of an established disruptor? If so, come join us and help redefine the Canadian banking landscape!\n\n **What you will be doing:**\n\n  \n\nAs a Senior Graphic Designer on the Creative Service Team, you will handle graphic design requests to ensure all visual executions are seamless and represent the Tangerine Brand. You will be responsible for the design and production of various visual assets for email, marketing campaigns, the website, mobile app, and content marketing support. The successful candidate thrives in a dynamic, collaborative, fast\\-paced environment and is dedicated to design excellence and creativity. You work to create effective and impactful design solutions. The Senior Graphic Designer will report directly into the Creative Lead, Marketing.\n\n **Is this role right for you? In this role, you will:**\n\n  \n\n* Create original, high\\-quality illustrations and graphics that align with campaign objectives and brand guidelines.\n* Collaborating with teams to conceptualize and execute custom illustrations that enhance user engagement across digital platforms will be second nature to you, as you’ll work closely with marketing and product design.\n* Ensure consistency of visual assets across all digital channels and cross\\-functional teams.\n* Articulate design decisions based on design principles, customer data, and business needs.\n* Ability to multi\\-task and manage multiple project priorities and deadlines.\n* Interact and consult with other team members and stakeholders at various levels including copywriters, project managers, creative specialists, digital project owners, agile team leaders, managers, directors and VPs.\n* Contribute to the evolution of the Tangerine Design system.\n* Contribute to shaping, influencing and nurturing our design culture and process.\n\n **Do you have the skills that will enable you to succeed in this role? We'd love to work with you if you have:**\n\n  \n\n* Diploma or bachelor's degree in graphic design (or equivalent).\n* 5\\+ years of professional experience.\n* Exceptional creative, graphic design, and illustration skills for print, web, and mobile, with a strong portfolio showcasing original illustration work.\n* Strong visual storytelling skills with a keen eye for detail, composition, and colour.\n* Excellent written and verbal communication skills.\n* Exceptional knowledge of Mac platform with expert skills in o Proficiency in digital illustration tools such as Adobe Illustrator, Procreate, or equivalent\n\t+ Adobe Photoshop and Acrobat\n\t+ Web (knowledge of best practices, image optimization, responsive design/programming, HTML and CSS)\n* Your toolbox includes Figma and Microsoft (Word, PowerPoint). Experience with Adobe After Effects is an asset.\n* Ability to work independently when required, and highly collaborative with groups at all levels of the organization.\n* Ability to develop and adapt illustration styles to suit various campaign needs.\n* Demonstrate strong problem\\-solving skills and ability to make timely decisions.\n* Positive and resilient, with the ability to embrace feedback and strong desire for continuous improvement and iteration.\n\n **What's in it for you?**\n\n  \n\n* Work in a mission\\-driven culture that prioritizes empowerment, diversity, and continuous learning.\n* Join a modern banking environment where design plays a central role in shaping client value.\n* Be part of a high\\-visibility team that is reimagining the future of personal finance in Canada.\n* You will get our help to save for your future and to invest in your total wellbeing through our Tangerine benefits\\*.\n* You belong here, we are equal and un\\-complicated. Bring your true self to work, dress codes don’t apply here.\n* You will enjoy workspace flexibility and all the excitement that comes from working at the official Bank of the Toronto Raptors.\n* Tangerine employees participate in Scotiabank’s pension \\& benefits programs (available to permanent employees).\n\n  \n\nLocation(s): Canada : Ontario : Toronto\n\n\nAt Tangerine we value the unique skills and experiences each individual brings to the team, and are committed to creating and maintaining an inclusive and accessible environment. If you require accommodation during the recruitment and selection process, please let our Recruitment team know.",
    "id": "in-a738e1873c2ca012",
    "currency": null,
    "site": "indeed",
    "location": "Toronto, ON, CA",
    "company": "Tangerine",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=a738e1873c2ca012",
    "title": "Senior Graphic Designer - Tangerine",
    "date_posted": "2026-01-06",
    "job_type": null,
    "max_amount": null,
    "min_amount": null,
    "job_url_direct": "https://jobs.scotiabank.com/Tangerine/job/Toronto-Senior-Graphic-Designer-Tangerine-ON-M2H0A1/598593317/?feedId=352460&utm_source=Indeed&utm_campaign=TheBankofNovaScotia_Indeed",
    "company_group": "Tangerine",
    "company_search_term": "Tangerine",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": null,
    "location_city": "Toronto",
    "location_region": "ON",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:14.381098+00:00",
    "posted_days_ago": null,
    "dedupe_key": "58a1d503fd13055ef3279ef8c70d8e8f4411781c"
  },
  {
    "description": "**Requisition ID**: 246287\n\n\nTangerine is Canada’s leading direct bank. We offer flexible and accessible banking options, innovative products, and award\\-winning Client service. The reason why Tangerine employees come to work each day is to help Canadians live better lives. We focus on making a difference in our communities, and that includes our own internal community. It’s important to us that our employees feel empowered and enthusiastic about belonging to our Orange culture.\n\n  \n\nAs Canada’s leading digital bank, Tangerine technology is at the heart of everything we do. We have redefined what digital banking is, and we continue to evolve to tackle any opportunity and face every challenge through progressive technology and the power of collaboration.\n\n\nDo you like new challenges? Are you ready to become part of an established disruptor? If so, come join us and help redefine the Canadian banking landscape!\n\n **Is this role right for you?**\n\n* You have a passion for customer service.\n* You have a keen attention to detail.\n* You thrive when under pressure with multiple tasks.\n* You can work in a complex, fast paced and rapidly changing business environment and handle competing tasks in a calm and effective manner.\n* You excel at prioritizing, logging, and assigning all monitored incidents to the appropriate teams for resolution and managing escalation processes to ensure efficient, timely, high\\-quality support is provided in response to system issues.\n* You take pride in recognizing trends \\& patterns in monitored phenomena and collaborate well with team members to identify trends; as well as the ongoing evaluation \\& improvements to processes and procedures.\n* You are eager to think out of the box when troubleshooting issues \\& in providing guidance to end users.\n* You shine in the ability to document and create self\\-help articles.\n\n **Do you have the skills that will enable you to succeed in this role?**\n\n* You possess excellent communication (verbal/written) skills to convey technical information to both technical peers and business stakeholders. Furthermore, you also have good interpersonal skills to build relationships with internal and external business partners.\n* You have at least 2\\+ years of hands\\-on technical customer service working experience in supporting desktops, laptops, VDI (virtual machines) and mobile devices.\n* You have at least 1\\+ years of working experience in the use of an ITIL\\-based service desk solution (e.g., ServiceNow or BMC Helix ITSM or IBM Control Desk/Smart Cloud Control Desk \\[SCCD], etc…)\n* You have at least 1\\+ years of working experience in adjusting system settings \\& user configurations with Windows 10 OS.\n* You have at least 1\\+ years of working experience in using Active Directory to identify groups \\& permissions needed for users.\n* You have at least 1\\+ years of working experience in configuring MS Office Suite (MS Word/Excel/PowerPoint/Outlook) \\& MS Teams.\n* You can demonstrate technical knowledge in ITIL v3 processes, such as Incident, Request, Change, Problem and Knowledge Management.\n* You can also demonstrate technical knowledge of computer networking concepts (IP addressing and different subnets).\n* You possess excellent critical thinking skills and the ability to troubleshoot complex technical issues.\n* You can adapt to working in a fast\\-paced, collaborative team environment.\n* You must have attention to detail and a commitment to delivering high\\-quality results.\n* You can demonstrate a consistent track record in continuous learning.\n* Completion of a post\\-secondary education in Computer Science, Engineering or in a related technology\\-based stream.\n\n **What's in it for you?**\n\n* Diversity, Equity, Inclusion \\& Allyship \\- We strive to create an inclusive culture where every employee is empowered to reach their fullest potential, respected for who they are, and are embraced through bias\\-free practices and inclusive values across Scotiabank. We embrace diversity and provide opportunities for all employee to learn, grow \\& participate through our various Employee Resource Groups (ERGs) that span across diverse gender identities, ethnicity, race, age, ability \\& veterans.\n* Accessibility and Workplace Accommodations \\- We value the unique skills and experiences each individual brings to the Bank, and are committed to creating and maintaining an inclusive and accessible environment for everyone. Scotiabank continues to locate, remove and prevent barriers so that we can build a diverse and inclusive environment while meeting accessibility requirements.\n* Upskilling through online courses, cross\\-functional development opportunities, and tuition assistance.\n* Competitive Rewards program including bonus, flexible vacation, personal, sick days and benefits will start on day one.\n* Community Engagement \\- no matter where you choose to work from; we offer opportunities for community engagement \\& belonging with our various programs such as hackathons, contests, cooking with friends, Humans of Digital and much more!\n\n\nLocation(s): Canada : Ontario : Toronto\n\n\nAt Tangerine we value the unique skills and experiences each individual brings to the team, and are committed to creating and maintaining an inclusive and accessible environment. If you require accommodation during the recruitment and selection process, please let our Recruitment team know.",
    "id": "in-10b73f1eaab79d90",
    "currency": null,
    "site": "indeed",
    "location": "Toronto, ON, CA",
    "company": "Tangerine",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=10b73f1eaab79d90",
    "title": "Help Desk Analyst",
    "date_posted": "2026-01-06",
    "job_type": null,
    "max_amount": null,
    "min_amount": null,
    "job_url_direct": "https://jobs.scotiabank.com/Tangerine/job/Toronto-Help-Desk-Analyst-ON-M2H0A1/598570217/?feedId=352460&utm_source=Indeed&utm_campaign=TheBankofNovaScotia_Indeed",
    "company_group": "Tangerine",
    "company_search_term": "Tangerine",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": null,
    "location_city": "Toronto",
    "location_region": "ON",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:14.384707+00:00",
    "posted_days_ago": null,
    "dedupe_key": "f59f83204604c7a4bc400fd3f6f1004d223cadc3"
  },
  {
    "description": "**Requisition ID**: 240506\n\n\nTangerine is Canada’s leading direct bank. We offer flexible and accessible banking options, innovative products, and award\\-winning Client service. The reason why Tangerine employees come to work each day is to help Canadians live better lives. We focus on making a difference in our communities, and that includes our own internal community. It’s important to us that our employees feel empowered and enthusiastic about belonging to our Orange culture.\n\n  \n\nAre you ready to make the change and become part of an established disruptor with the backing of a highly engaged team? If so come join us and help redefine the Canadian banking landscape!\n\n **What you will be doing:**\n\n\nThe Quality Engineering (QE) Lead provides support to Senior Manager, Quality Engineering and is responsible for the oversight and coordination of testing and quality engineering activities within the banking domain. Responsibilities include automation, testing, planning, coaching, leading and supervising tasks and/or testing team. The lead will also support testing strategy, design, execution, defect management, reporting are executed and delivered in compliance with governing regulations, internal policies and procedures. The QE Lead will report directly to Senior Manager, Quality Engineering.\n\n **Is this role right for you?**\n\n* Day\\-to\\-day coordination of QE squad, including overseeing and carrying out following type of testing: Functional Testing (including automation), Integration Testing, Regression Testing, Accessibility Testing, User Acceptance Testing, Production Acceptance Testing and other types of testing as required\n* Delivering the automation results for the dedicated channel, based on the strategic directives set forth by leadership team\n* Coach and provide mentorships to test team members in various areas including business domain, functional testing, automation and non\\-functional testing while ensuring the test teams are compliant with Tangerine test methodologies and industry best practices\n* Recommending and implementing various processes or framework enhancements by collaborating with QE community within the bank\n* Manage and lead testing activities for multiple large\\-scale enterprise\\-wide programs/projects for Tangerine that are executed in Agile methodology\n* Assess the risks associated with the development aspects of each solution/project and define approach for manual versus automation testing and institute change within the team\n* Risk Management – document testing risks and provide mitigation and contingency plans from testing standpoint\n* Collect strategic, technical and operational test metrics. Analyze current defects and test execution trends and extrapolate data for predictive analysis\n* Work with people of varied levels within QE and/or outside of QE Team including Business/Product, Engineering, PMO, Release Management, Design, etc. to meet key objectives and advocate for quality\n* Responsible for team’s adherence to governance and processes, timely management of any issue or escalation and facilitate overall escalation processes\n* Manage and review documentation and creating testing artifacts (e.g., test strategies, plans, estimates, test cases, metrics/dashboard, defects log/report, signoffs) to ensure artifacts adhere to prescribed standards and audit requirements\n\n **Do you have the skills that will enable you to succeed in this role?**\n\n\n* 10\\+ years of solid experience working within SDLC/TDLC\n* 5\\+ years of solid testing experience within wealth management domain\n* 5\\+ years of experience with Mobile and Web technologies\n* 5\\+ years of experience managing onshore or offshore team\n* Proficient testing background in the Canadian financial services industry\n* University or College Degree or equivalent experience in Computer Science/Engineering\n* Must have hands on experience with Test Automation using Selenium Webdriver IO or similar, and ability to contribute to automation framework enhancements\n* Extensive knowledge of Java script, Type script etc\n* Proficient with API REST/SOAP testing and experience using related tools like Rest Assured etc\n* Experience with CI/CD and related tools and techniques; Jenkins/Dockers/Kubernetes\n* Expertise in utilizing accessibility tools across web and mobile such as ANDI, AXE, Voice Over/TalkBack, NVDA\n* Strong experience in Database Testing \\- analyzing data received from different data sources including RDBMS, My SQL and other databases\n* CTFL, ISTQB,CSQA,CSTE good to have\n\n **What's in it for you?**\n\n* You will be part of a diverse and inclusive team of Client\\-focused go\\-getters looking to learn from each other in an environment that celebrates and recognizes success!\n* You will have access to thousands of online and in\\-person courses so you can shape your career growth with support from diverse industry leaders.\n* You will get our help to save for your future and to invest in your total well\\-being through our Tangerine benefits\\*.\n* You belong here, and we are equal and uncomplicated. Bring your true self to work, dress codes don’t apply here.\n* You will enjoy workspace flexibility and all the excitement that comes from working at the official Bank of the Toronto Raptors.\n\n  \n\nLocation(s): Canada : Ontario : Toronto\n\n\nAt Tangerine we value the unique skills and experiences each individual brings to the team, and are committed to creating and maintaining an inclusive and accessible environment. If you require accommodation during the recruitment and selection process, please let our Recruitment team know.",
    "id": "in-e4239711165a86d3",
    "currency": null,
    "site": "indeed",
    "location": "Toronto, ON, CA",
    "company": "Tangerine",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=e4239711165a86d3",
    "title": "Quality Engineering Lead - Tangerine",
    "date_posted": "2026-01-04",
    "job_type": null,
    "max_amount": null,
    "min_amount": null,
    "job_url_direct": "https://jobs.scotiabank.com/Tangerine/job/Toronto-Quality-Engineering-Lead-Tangerine-ON-M2H0A1/597164617/?feedId=352460&utm_source=Indeed&utm_campaign=TheBankofNovaScotia_Indeed",
    "company_group": "Tangerine",
    "company_search_term": "Tangerine",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": null,
    "location_city": "Toronto",
    "location_region": "ON",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:14.386552+00:00",
    "posted_days_ago": null,
    "dedupe_key": "3215680884df7b34a91a2a0ac0667963f1f3d203"
  },
  {
    "description": "**Requisition ID**: 246344\n\n\nTangerine is Canada’s leading direct bank. We offer flexible and accessible banking options, innovative products, and award\\-winning Client service. The reason why Tangerine employees come to work each day is to help Canadians live better lives. We focus on making a difference in our communities, and that includes our own internal community. It’s important to us that our employees feel empowered and enthusiastic about belonging to our Orange culture.\n\n **Position Title: Bilingual Funding and Support Analyst**\n\n  \n\nAs Canada’s leading digital bank, Tangerine technology is at the heart of everything we do. We have redefined what digital banking is, and we continue to evolve to tackle any opportunity and face every challenge through progressive technology and the power of collaboration.\n\n  \n\nDo you like new challenges? Are you ready to reach new heights in your career and become part of an established disruptor? If so, come join us and help redefine the Canadian banking landscape!\n\n **What you will be doing:**  \n\n\n\nClient Business Support (CBS) is a client focused processing department that enables the bank to demonstrate that a virtual bank can offer superior client experience by efficiently and effectively delivering on the promises made to our clients.\n\n  \n\nThe CBS department is made up of several teams; each team plays a unique role in providing support for both Deposit/Chequing and Lending products.\n\n\nThe Bilingual Funding and Support Analyst position involves the timely and prudent administration of mortgage requests. This includes the processing of lawyer Instructions, the ordering and maintenance of appraisals, Income verifications, Funding and the processing of Final Documentation as required for mortgage applications. It must be ensured that a consistent service is delivered to the CBS \\- Lending department through the timely and accurate delivery of the Funding and Support activities.\n\n **Is this role right for you?** **In this role, you will:**\n\n  \n\n* Managing a busy workflow while maintaining a high level of accuracy and meeting defined service standard\n* Develop and maintain positive working relationships with Internal and External Clients\n* Sound, effective and prompt review of verification of Income documentation\n* Maintaining a high level of accuracy and consistency in document verification and disbursement release\n* Meeting defined service standards and turnaround times\n* Liaising with different areas of the department and developing relationships to ensure that job is done and to ensure the smooth completion of all closings\n* Liaising with external partners to confirm satisfactory delivery of documentation\n* Prioritization of allocated workflow\n* Regular review and processing of Registration Documentation.\n* Good knowledge of Funding, and conditions set for the Solicitors. Being able to process deals like i.e. Purchases, ETO’s, Add Helocs, Mortgage Increases, Refinances and Switches.\n* Review and validate of all legal documentation / Interim report received from Solicitors\n* Review and satisfied the Identification Verification Form in accordance with Tangerine requirements\n* Review and satisfied all additional Funding conditions prior to releasing Mortgage funds to Solicitor\n* Providing Funding projections and daily balancing reports\n* Processing and releasing of wires\n* Suggestions on process flow improvement\n* Thorough knowledge of Tangerine’s mortgage guidelines, processes and procedures including: CMHC, Genworth and familiarity with Tangerine’s Charge Terms as they pertain to Mortgage Servicing\n* Customer Service levels are met relating to e\\-mails, phone messages and fax enquiries, this is done by ensuring all e\\-mails, phone messages and fax enquiries are responded to within 2hrs\n* Reporting \\& tracking, analyze data related to the team, team members and the unit as a whole\n* Keep abreast of all Lending Credit Policies, Guidelines and Procedures\n\n **Do you have the skills that will enable you to succeed in this role?** **\\- We'd love to work with you if you have:**\n\n* Completion of a post\\-secondary degree or experiences in financial industry or equivalent professional experience\n* Completion or enrollment in mortgage courses\n* Mortgage and Credit experience an asset\n* Bilingual (French / English) is required\n* Computer literate, knowledge of Microsoft Office\n* Professional proficiency in all aspects of the business\n* Ability to build relationships at all levels\n* Ability to adapt to changing needs and priorities\n\n **What's in it for you?**\n\n  \n\n* You will be part of a diverse and inclusive team of Client\\-focused go\\-getters looking to learn from each other in an environment that celebrates and recognizes success!\n* You will have access to thousands of online and in person courses so you can shape your career growth with the support from diverse industry leaders.\n* You will get our help to save for your future and to invest in your total wellbeing through our Tangerine benefits\\*.\n* You belong here, we are equal and un\\-complicated.\n* You will enjoy workspace flexibility and all the excitement that comes from working at the official Bank of the Toronto Raptors.\n\n* Tangerine employees participate in Scotiabank’s pension \\& benefits programs (available to permanent employees)\n\n\nLocation(s): Canada : Ontario : North York\n\n\nAt Tangerine we value the unique skills and experiences each individual brings to the team, and are committed to creating and maintaining an inclusive and accessible environment. If you require accommodation during the recruitment and selection process, please let our Recruitment team know.",
    "id": "in-1485d0d30f3cf6e9",
    "currency": null,
    "site": "indeed",
    "location": "North York, ON, CA",
    "company": "Tangerine",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=1485d0d30f3cf6e9",
    "title": "Bilingual Funding and Support Analyst Level 2",
    "date_posted": "2026-01-02",
    "job_type": null,
    "max_amount": null,
    "min_amount": null,
    "job_url_direct": "https://jobs.scotiabank.com/Tangerine/job/North-York-Bilingual-Funding-and-Support-Analyst-Level-2-ON-M2H0A1/598508117/?feedId=352460&utm_source=Indeed&utm_campaign=TheBankofNovaScotia_Indeed",
    "company_group": "Tangerine",
    "company_search_term": "Tangerine",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": null,
    "location_city": "North York",
    "location_region": "ON",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:14.388375+00:00",
    "posted_days_ago": null,
    "dedupe_key": "5d78c44dce9b72f38c7557078d61e4554a831922"
  },
  {
    "description": "**Numéro de la demande:** 246344\n\n  \n\nTangerine est la plus importante banque directe au Canada. Nous offrons des options bancaires souples et accessibles, des produits novateurs et un service à la clientèle primé. La raison pour laquelle les employés de Tangerine se présentent au travail chaque jour est d'aider les Canadiens à vivre une meilleure vie. Nous nous efforçons de faire une différence dans nos communautés, et cela inclut notre propre communauté interne. Il est important pour nous que nos employés se sentent responsabilisés et enthousiastes à l'idée d'appartenir à notre culture d’entreprise.\n\n **Titre du poste : Analyste bilingue – Financement et soutien**\n\n  \n\nEn tant que première banque numérique au Canada, la technologie de Tangerine est au cœur de tout ce que nous faisons. Nous avons redéfini ce qu’est la banque numérique et nous continuons d’évoluer pour saisir chaque opportunité et relever chaque défi grâce à une technologie de pointe et à la force de la collaboration.\n\n\nAimez\\-vous relever de nouveaux défis? Êtes\\-vous prêt(e) à atteindre de nouveaux sommets dans votre carrière et à faire partie d’un acteur disruptif bien établi? Si oui, joignez\\-vous à nous et contribuez à redéfinir le paysage bancaire canadien!\n\n **Ce que vous ferez :**\n\n\nLe service **Client Business Support (CBS)** est un département axé sur le client qui permet à la banque de démontrer qu’une banque virtuelle peut offrir une expérience supérieure en respectant efficacement et rapidement les engagements pris envers nos clients.\n\n\nLe département CBS est composé de plusieurs équipes; chacune joue un rôle unique en offrant un soutien pour les produits Dépôt/Compte\\-chèques et Prêts.\n\n\nLe poste d’**Analyste bilingue – Financement et soutien** consiste à administrer de manière prudente et rapide les demandes hypothécaires. Cela inclut le traitement des instructions des avocats, la commande et la gestion des évaluations, la vérification des revenus, le financement et le traitement de la documentation finale requise pour les demandes hypothécaires. Il est essentiel de garantir un service constant au département CBS – Prêts grâce à une exécution rapide et précise des activités de financement et de soutien\n\n **Ce rôle est\\-il fait pour vous? Vous devrez :**\n\n* Gérer un flux de travail chargé tout en maintenant un haut niveau de précision et en respectant les normes de service définies\n* Développer et maintenir des relations positives avec les clients internes et externes\n* Examiner rapidement et efficacement les documents de vérification des revenus\n* Maintenir une grande précision et cohérence dans la vérification des documents et la libération des fonds\n* Respecter les normes de service et les délais\n* Collaborer avec différentes équipes du département pour assurer la bonne réalisation des tâches et la clôture des dossiers\n* Communiquer avec les partenaires externes pour confirmer la livraison satisfaisante des documents\n* Prioriser le flux de travail attribué\n* Examiner et traiter régulièrement la documentation d’enregistrement\n* Avoir une bonne connaissance du financement et des conditions imposées aux avocats; être capable de traiter des dossiers tels que : achats, ETO, ajout de marges de crédit hypothécaires, augmentations de prêts, refinancements et transferts\n* Examiner et valider toute la documentation légale / rapport intérimaire reçu des avocats\n* Vérifier et satisfaire le formulaire de vérification d’identité conformément aux exigences de Tangerine\n* Vérifier et satisfaire toutes les conditions de financement avant de libérer les fonds hypothécaires à l’avocat\n* Fournir des projections de financement et des rapports quotidiens d’équilibrage\n* Traiter et libérer les virements\n* Proposer des améliorations au processus\n* Connaissance approfondie des lignes directrices, processus et procédures hypothécaires de Tangerine, y compris : CMHC, Genworth et familiarité avec les conditions de charge de Tangerine liées au service hypothécaire\n* Respecter les niveaux de service pour les courriels, messages téléphoniques et demandes par fax (réponse dans les 2 heures)\n* Effectuer des rapports et suivis, analyser les données liées à l’équipe, aux membres et à l’unité dans son ensemble\n* Se tenir informé(e) des politiques, lignes directrices et procédures de crédit.\n\n **Compétences requises pour réussir dans ce rôle :**\n\n* Diplôme postsecondaire ou expérience dans le secteur financier ou expérience professionnelle équivalente\n* Achèvement ou inscription à des cours hypothécaires\n* Expérience en hypothèques et crédit (atout)\n* Bilinguisme (français / anglais) requis\n* Maîtrise des outils informatiques, connaissance de Microsoft Office\n* Professionnalisme dans tous les aspects du travail\n* Capacité à établir des relations à tous les niveaux\n* Capacité à s’adapter aux besoins et priorités changeants\n\n **Ce que nous offrons :**\n\n* Vous ferez partie d’une équipe diversifiée et inclusive, axée sur le client, qui aime apprendre les uns des autres dans un environnement qui célèbre et reconnaît le succès!\n* Vous aurez accès à des milliers de cours en ligne et en personne pour façonner votre développement de carrière avec le soutien de leaders issus de divers secteurs.\n* Nous vous aiderons à épargner pour votre avenir et à investir dans votre bien\\-être global grâce à nos avantages Tangerine\\*.\n* Vous avez votre place ici : nous sommes égaux et simples.\n* Vous bénéficierez d’une flexibilité de travail et de toute l’excitation de travailler pour la banque officielle des Toronto Raptors.\n* Les employés de Tangerine participent aux programmes de retraite et d’avantages sociaux de Scotiabank (disponibles pour les employés permanents).\n\n\nEmplacement(s): Canada : Ontario : North York\n\n\nChez Tangerine, nous valorisons les compétences et les expériences uniques que chaque personne apporte à l’équipe. Nous nous engageons à créer et à maintenir un environnement inclusif et accessible. Si vous avez besoin de mesures d’adaptation pendant le processus de recrutement et de sélection, veuillez en informer notre équipe de recrutement.",
    "id": "in-8bb63fe8c85119ba",
    "currency": null,
    "site": "indeed",
    "location": "North York, ON, CA",
    "company": "Tangerine",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=8bb63fe8c85119ba",
    "title": "Bilingual Funding and Support Analyst",
    "date_posted": "2026-01-02",
    "job_type": null,
    "max_amount": null,
    "min_amount": null,
    "job_url_direct": "https://jobs.scotiabank.com/Tangerine/job/North-York-Bilingual-Funding-and-Support-Analyst-ON-M2H0A1/598508017/?feedId=352460&utm_source=Indeed&utm_campaign=TheBankofNovaScotia_Indeed",
    "company_group": "Tangerine",
    "company_search_term": "Tangerine",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": null,
    "location_city": "North York",
    "location_region": "ON",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:14.390343+00:00",
    "posted_days_ago": null,
    "dedupe_key": "01874bb9d656de43c01a188da4576ea9adc08040"
  },
  {
    "description": "**Requisition ID**: 242550\n\n\nTangerine is Canada’s leading direct bank. We offer flexible and accessible banking options, innovative products, and award\\-winning Client service. The reason why Tangerine employees come to work each day is to help Canadians live better lives. We focus on making a difference in our communities, and that includes our own internal community. It’s important to us that our employees feel empowered and enthusiastic about belonging to our Orange culture.\n\n  \n\nContributes to the overall success of the Service Management Technology (SMT) team under Global Engineering, Operations \\& Functions in Global ensuring specific individual goals, plans, initiatives are executed / delivered in support of the team’s business strategies and objectives. Ensures all activities conducted are in compliance with governing regulations, internal policies and procedures.\n\n **Is this role right for you?**  \n\n* Champions a customer focused culture to deepen client relationships and leverage broader Bank relationships, systems, and knowledge.\n* Work with other lab members, such as business analysts, QA Testers, Architects, and the Operations Team to help support the delivery of releases.\n* Lead and coach the team members with task oriented activities, coordinate the team developments between the teams and teammates\n* Extract and maximise business value by providing solutions that best fit the business (i.e. leveraging out of box versus heavy customization).\n* Help with proofs of concept to get the most out of the ServiceNow modules for the business.\n* Configure and develop solutions on the ServiceNow Platform (i.e Worflows, Business Rules, Script Includes, etc)\n* Leading end\\-to\\-end ServiceNow implementation project teams and owning project delivery goals.\n* Must be able to work on multiple projects at the same time with good time management skills.\n* Provide guidance to junior members in the team.\n* Work without supervision on project work.\n* Provide Level 3 production support.\n* Provide support with technical solutions within your domain space (i.e. ITAM, ITSM).\n* Maintain up to date technical documentation.\n* Participate in estimation with your enterprise stakeholders.\n **Do you have the skills that will enable you to succeed in this role?**  \n\n* Computer Science Diploma or Degree; or related work experience.\n* ITIL Foundation certification or training.\n* ServiceNow Advanced System Administrator certified or training.\n* ServiceNow Scripting certification or training a plus.\n* 3 \\- 5 years of ServiceNow Experience within modules/applications (and ServiceNow in general). For example, ITSM, ITOM, SPM, etc.\n* 3 \\- 5 years’ experience and hands on development in general module configuration on the ServiceNow Platform.\n* 1 \\- 3 years’ experience as a Tech Lead working on ServiceNow platform.\n* Experience with the Service Graph Connector in ServiceNow a plus\n* Strong experience and knowledge of integrations on the ServiceNow Platform, consisting of either REST, SOAP, Integration Hub, workflows etc.\n* Has experience in systems design and a solid understanding of development, quality assurance and integration methodologies.\n* Ability to do research and development of new ways to leverage the ServiceNow platform.\n **What's in it for you?**  \n\n* Diversity, Equity, Inclusion \\& Allyship \\- We strive to create an inclusive culture where every employee is empowered to reach their fullest potential, respected for who they are, and are embraced through bias\\-free practices and inclusive values across Scotiabank. We embrace diversity and provide opportunities for all employee to learn, grow \\& participate through our various Employee Resource Groups (ERGs) that span across diverse gender identities, ethnicity, race, age, ability \\& veterans.\n* Accessibility and Workplace Accommodations \\- We value the unique skills and experiences each individual brings to the Bank, and are committed to creating and maintaining an inclusive and accessible environment for everyone. Scotiabank continues to locate, remove and prevent barriers so that we can build a diverse and inclusive environment while meeting accessibility requirements.\n* Upskilling through online courses, cross\\-functional development opportunities, and tuition assistance.\n* Competitive Rewards program including bonus, flexible vacation, personal, sick days and benefits will start on day one.\n* Community Engagement \\- no matter where you choose to work from; we offer opportunities for community engagement \\& belonging with our various programs such as hackathons, contests, cooking with friends, Humans of Digital and much more!\n\nLocation(s): Canada : Ontario : Toronto\n\n\nAt Tangerine we value the unique skills and experiences each individual brings to the team, and are committed to creating and maintaining an inclusive and accessible environment. If you require accommodation during the recruitment and selection process, please let our Recruitment team know.",
    "id": "in-ca65f4d810a7b2b5",
    "currency": null,
    "site": "indeed",
    "location": "Toronto, ON, CA",
    "company": "Tangerine",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=ca65f4d810a7b2b5",
    "title": "Lab Lead, ServiceNow, Tangerine",
    "date_posted": "2025-12-31",
    "job_type": null,
    "max_amount": null,
    "min_amount": null,
    "job_url_direct": "https://jobs.scotiabank.com/Tangerine/job/Toronto-Lab-Lead%2C-ServiceNow%2C-Tangerine-ON-M2H0A1/597772917/?feedId=352460&utm_source=Indeed&utm_campaign=TheBankofNovaScotia_Indeed",
    "company_group": "Tangerine",
    "company_search_term": "Tangerine",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": null,
    "location_city": "Toronto",
    "location_region": "ON",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:14.391933+00:00",
    "posted_days_ago": null,
    "dedupe_key": "0c1737cce08b0bff1ecc836cf9195af36cc3f370"
  },
  {
    "description": "**Requisition ID**: 245819\n\n\nTangerine is Canada’s leading direct bank. We offer flexible and accessible banking options, innovative products, and award\\-winning Client service. The reason why Tangerine employees come to work each day is to help Canadians live better lives. We focus on making a difference in our communities, and that includes our own internal community. It’s important to us that our employees feel empowered and enthusiastic about belonging to our Orange culture.\n\n  \n\nAs Canada’s leading digital bank, Tangerine technology is at the heart of everything we do. We have redefined what digital banking is, and we continue to evolve to tackle any opportunity and face every challenge through progressive technology and the power of collaboration.\n\n  \n\nDo you like new challenges? Are you ready to reach new heights in your career and become part of an established disruptor? If so, come join us and help redefine the Canadian banking landscape!\n\n **What you will be doing:**\n\n  \n\nSupport Senior manager to lead and oversee the strategy, flawless execution, and ongoing improvement of channel lead programs with the contact center, squads (including marketing) to drive client primacy, engage and deepen customer relationships and target revenue and profitability objectives for key strategic segments. This role will also support and overseeing the execution of client centric lead programs with the contact center, squads and cross\\-functional teams to develop omni\\-channel programs that connect digital channels and sales enablement tools to ensure the most optimal sequenced experience for our clients and agents. The role in the short term will also be responsible to support leading the broader contact center sales strategy with many cross\\-functional teams to enable inbound and outbound sales opportunities. The role is critical in driving channel sales KPIs through client\\-centric and data\\-driven program execution and innovation to deepen customer relationships and win the full customer relationship through effective client outreach and advice delivery. Ensures business strategies, plans and initiatives are executed / delivered in compliance with governing regulations, internal policies, and procedures.\n\n **Is this role right for you? In this role, you will:**\n\n  \n\n* Support Program lead Management\n\t+ Support lead strategy, by managing execution of contact center lead programs and tactics including launching new programs identified through our client base, outreach journeys and moments of truth\n\t+ Support the shift to customer centric leads through steady execution and optimization of customer\\-centric multi\\-product lead programs\n\t+ Track and measure lead performance across programs with analytics and channel partners on monthly and quarterly basis to distribute to channel and product leadership\n\t+ Conduct deep dive analyses with analytics to identify new opportunities to enhance existing programs and identify gaps to improve efficiency and conversion rates\n\t\n\tProvide or support delivery of lead information required for various cross\\-functional teams  \n\t+\n* Program Performance and Optimization\n\t+ Manage communication to contact center and leadership teams on lead priorities, new leads launching and key messages to drive consistency \\& unified approach\n\t+ Partner with growth squads, marketing and operational sales enablement teams to channel teams to manage lead naming, scripting and resources to support lead programs\n\t+ Test \\& learn new leads, incorporating new capabilities, offers, scripting etc\n\t+ Manage the prioritization of all sales leads into the contact center\n\t+ Work across squads and cross\\-functional teams to identify new contact center lead opportunities (inbound / outbound)\n\t+ As certain sales enablement features are unlocked, identify opportunities to plug into existing and new outreach programs\n\t+ Act as the change champion for enabling lead strategies opportunities into the contact center\n\t+ Support troubleshooting or problem resolution as required\n\t+ Optimize front\\-line channel growth results through identifying new channel programs to close performance gaps\n\t+ Work with growth squads to identify always on journeys to sequence digital and contact center channels together based on client needs and key data\n\t+ Support the contact center sales leads enablement strategy for Tangerine in the short term by working across stakeholders in product, marketing, operations to build the blueprint and gain the appropriate buy in to grow the channel\n\n  \n\n* Lead Forecasting\n\t+ Support lead forecasting through ongoing updates with Planning and Performance, Squads, contact center and operations to identify any new leads being planned for deployment\n\t+ Identify any initiatives impacting leads and significant changes to lead volumes and develop quarterly analysis of leads\n\t+ Support monthly analyzing of contact center leads for leadership in partnership with planning and performance team\n\t+ Ensure updates to branch leads are integrated with leads and campaign trackers in partnership with planning and performance team\n\n **Do you have the skills that will enable you to succeed in this role? We'd love to work with you if you have:**\n\n  \n\n* Post\\-secondary education (marketing/business administration preferred)\n* 5\\+ years of experience, including in Channel Marketing, Channel Programs, Customer Strategy, or Product/Program Management, specifically in organizations with broad geographical distribution network\n* Managing delivery of contact center experience is preferred\n* Strong ability to build comprehensive strategies and proposals\n* Ability to create comprehensive, visually engaging PowerPoint presentations that effectively communicate complex information\n* Ability to analyze large data sets and derive insights\n* Strong strategic thinking and results focus skills\n* Demonstrated success in working cross\\-functionally to deliver large, multi\\-faceted projects\n* Understanding of Retail Products financials and P\\&L\n* Innovative mindset who is very effective at seeing a strategy through from start to execution\n\n **What's in it for you?**\n\n  \n\n* Work in a mission\\-driven culture that prioritizes empowerment, diversity, and continuous learning.\n* Join a modern banking environment where design plays a central role in shaping client value.\n* Be part of a high\\-visibility team that is reimagining the future of personal finance in Canada.\n* You will get our help to save for your future and to invest in your total wellbeing through our Tangerine benefits\\*.\n* You belong here, we are equal and un\\-complicated. Bring your true self to work, dress codes don’t apply here.\n* You will enjoy workspace flexibility and all the excitement that comes from working at the official Bank of the Toronto Raptors.\n\n* Tangerine employees participate in Scotiabank’s pension \\& benefits programs (available to permanent employees)\n\n  \n\nLocation(s): Canada : Ontario : Toronto\n\n\nAt Tangerine we value the unique skills and experiences each individual brings to the team, and are committed to creating and maintaining an inclusive and accessible environment. If you require accommodation during the recruitment and selection process, please let our Recruitment team know.",
    "id": "in-fbb5f0bf98545851",
    "currency": null,
    "site": "indeed",
    "location": "Toronto, ON, CA",
    "company": "Tangerine",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=fbb5f0bf98545851",
    "title": "Manager, Channel Lead Orchestration - Tangerine",
    "date_posted": "2025-12-23",
    "job_type": null,
    "max_amount": null,
    "min_amount": null,
    "job_url_direct": "https://jobs.scotiabank.com/Tangerine/job/Toronto-Manager%2C-Channel-Lead-Orchestration-Tangerine-ON-M2H0A1/598388617/?feedId=352460&utm_source=Indeed&utm_campaign=TheBankofNovaScotia_Indeed",
    "company_group": "Tangerine",
    "company_search_term": "Tangerine",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": null,
    "location_city": "Toronto",
    "location_region": "ON",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:14.394437+00:00",
    "posted_days_ago": null,
    "dedupe_key": "3a486c1465809688789b1690889567084971181c"
  },
  {
    "description": "Requisition ID: 245741  \n\n  \n\nJoin a purpose driven winning team, committed to results, in an inclusive and high\\-performing culture.\n\n  \n\nTerm: May – August 2026\n\n\nWork Hours/Week: 37\\.5\n\n\nApplication Deadline: 01/16/26\n\n  \n\n\n\nThere's no better way to kickstart your career than to do a co\\-op or internship with Tangerine! During your work term, you’ll have the opportunity to be part of a winning team, build your network, and discover what you love – all while getting paid to do it! There’s a place for every type of student at Tangerine and all that we ask for is that you have passion and strong AOO (Attitude, Ownership and Opportunity).\n\n  \n\n\n\nThe Velocity Program is not your average internship or co\\-op! This is a customized experience that focuses on providing you with the development and tools you need to grow your career. After successfully completing a co\\-op or internship with top performance, we will work with you to establish your future placements. As a result, you will get to learn, grow, and experiment within different areas of both Scotiabank and Tangerine!\n\n  \n\n\n\n**Is this role right for you? In this role, you will:**\n\n* Be working and partnering with multiple stakeholders within the bank and teams such as contact centers, clients, internal operations teams etc.\n* Dive deep into process mapping and gap analysis for client related issues and help find solutions.\n* Provide recommendations for improvements to processes and procedures that drive operational excellence or a more amazing client experience.\n* Define the scope and the metrics to confirm success for initiatives in collaboration with stakeholders.\n* You will help support with a larger scope of team\\-wide projects and initiatives as needed.\n\n  \n\n\n\n**Do you have the skills and requirements that will enable you to succeed in this role? – We’d love to work with you if:**\n\n* You are currently enrolled in post\\-secondary education.\n* You love to learn and envision yourself working for an international organization that heavily invests in your future.\n* You enjoy being involved in extracurricular activities such as conferences, clubs, and competitions and/or hackathons.\n* You have knowledge in Microsoft Excel and PowerPoint.\n* You have the ability to research, analyze and prepare a report.\n* You have Knowledge in SQL series, although not a requirement.\n* You are analytical, detailed oriented with strong written and verbal skills.\n* You can work on multiple initiatives at the same time.\n\n  \n\n\n\n**What’s in it for you?**\n\n* You’ll be part of a diverse, collaborative, innovative, and high\\-performing team.\n* In\\-depth training to prepare you for the role, as well as ongoing coaching and feedback to help you succeed!\n* Exclusive student events such as Scotia Student Day, Lunch \\& Learns, leadership panels, and much more!\n* Bank\\-wide orientation to learn more about Scotiabank and gain exposure to senior leadership across the organization.\n* You’ll learn about different areas and processes in the bank and how the various functions work.\n* You will have exposure to stakeholders within and outside of the team.\n* You will have the opportunity to learn and collaborate with projects/initiatives within the operations team.\n* You will have the opportunity to learn new systems such as chatbot, IVR (interactive telephony system) which are AI based and help develop these tools.\n\n  \n\n\n\n**Please follow the steps below to successfully apply:**\n\n\nStep 1: Complete your PLUM Profile here and save it as a screenshot.\n\n\nStep 2: Complete a short one\\-way video interview here.\n\n\nStep 3: Once you have completed your Plum Profile, one\\-way video interview, apply to the role on our website. Reminder: when the application asks for your resume, instead upload the screenshot of your PLUM Profile!\n\n  \n\nLocation(s): Canada : Ontario : Toronto  \n\n  \n\nScotiabank is a leading bank in the Americas. Guided by our purpose: \"for every future\", we help our customers, their families and their communities achieve success through a broad range of advice, products and services, including personal and commercial banking, wealth management and private banking, corporate and investment banking, and capital markets.\n  \n\n  \n\nAt Scotiabank, we value the unique skills and experiences each individual brings to the Bank, and are committed to creating and maintaining an inclusive and accessible environment for everyone. If you require accommodation (including, but not limited to, an accessible interview site, alternate format documents, ASL Interpreter, or Assistive Technology) during the recruitment and selection process, please let our Recruitment team know. Candidates must apply directly online to be considered for this role. We thank all applicants for their interest in a career at Scotiabank; however, only those candidates who are selected for an interview will be contacted.",
    "id": "in-f67e8554ba339aeb",
    "currency": null,
    "site": "indeed",
    "location": "Toronto, ON, CA",
    "company": "Tangerine",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=f67e8554ba339aeb",
    "title": "Velocity - Tangerine Operations Internship/Co-op - Summer 2026",
    "date_posted": "2025-12-22",
    "job_type": null,
    "max_amount": null,
    "min_amount": null,
    "job_url_direct": "https://jobs.scotiabank.com/Tangerine/job/Toronto-Velocity-Tangerine-Operations-InternshipCo-op-Summer-2026-ON/598368317/?feedId=352460&utm_source=Indeed&utm_campaign=TheBankofNovaScotia_Indeed",
    "company_group": "Tangerine",
    "company_search_term": "Tangerine",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": [
      "internship"
    ],
    "location_city": "Toronto",
    "location_region": "ON",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:14.399272+00:00",
    "posted_days_ago": null,
    "dedupe_key": "d08a7f473e33933bd9e68fdc5c273aa2e3807c4c"
  },
  {
    "description": "Requisition ID: 245740  \n\n  \n\nJoin a purpose driven winning team, committed to results, in an inclusive and high\\-performing culture.\n\n  \n\nTerm: May – August 2026\n\n\nWork Hours/Week: 37\\.5\n\n\nApplication Deadline: 01/16/2026\n\n  \n\n\n\nThere's no better way to kickstart your career than to do a co\\-op or internship with Tangerine! During your work term, you’ll have the opportunity to be part of a winning team, build your network, and discover what you love – all while getting paid to do it! There’s a place for every type of student at Tangerine and all that we ask for is that you have passion and strong AOO (Attitude, Ownership and Opportunity).\n\n  \n\n\n\nThe Velocity Program is not your average internship or co\\-op! This is a customized experience that focuses on providing you with the development and tools you need to grow your career. After successfully completing a co\\-op or internship with top performance, we will work with you to establish your future placements. As a result, you will get to learn, grow, and experiment within different areas of both Scotiabank and Tangerine!\n\n  \n\n\n\n**Is this role right for you? In this role, you will:**\n\n* Support team by planning and coordinating day\\-to\\-day activities and providing any additional support.\n* Assist in development of reports to share with internal and external partners.\n* Summarize results and highlight wins and key opportunities of bank initiatives.\n* Analyze results/ findings for process improvements.\n* Ensure accuracy in all documentations and deliverables.\n* Work with internal and external stakeholders to ensure timelines/work back schedules are respected for on time delivery.\n\n  \n\n\n\n**Do you have the skills and requirements that will enable you to succeed in this role? – We’d love to work with you if:**\n\n* You are currently enrolled in post\\-secondary education.\n* You pride yourself on thinking outside of the box and bring in ground\\-breaking ideas to the team.\n* You have a natural curiosity and awareness about current market and business trends.\n* You enjoy being involved in extracurricular activities such as conferences, clubs, and competitions and/or hackathons.\n* You love to learn and envision yourself working for an international organization that heavily invests in your future.\n\n  \n\n\n\n**What’s in it for you?**\n\n* You’ll be part of a diverse, collaborative, innovative, and high\\-performing team.\n* In\\-depth training to prepare you for the role, as well as ongoing coaching and feedback to help you succeed!\n* Exclusive student events such as Scotia Student Day, Lunch \\& Learns, leadership panels, and much more!\n* Bank\\-wide orientation to learn more about Scotiabank and gain exposure to senior leadership across the organization.\n\n  \n\n\n\n**Please follow the steps below to successfully apply:**\n\n\nFor students applying to our internship/co\\-op or new graduate programs, we do not require resumes! We believe in evaluating you through relationships over resumes and are focused on learning about who you are and what you’re interested in to uncover your true potential. Instead, we ask that as part of your application you complete the below:\n\n  \n\n\n\nStep 1: Complete your PLUM Profile here and save it as a screenshot.\n\n\nStep 2: Complete a short one\\-way video interview here.\n\n\nStep 3: Once you have completed your Plum Profile, one\\-way video interview, apply to the role on our website. Reminder: when the application asks for your resume, instead upload the screenshot of your PLUM Profile!  \n\n\n\nLocation(s): Canada : Ontario : Toronto  \n\n  \n\nScotiabank is a leading bank in the Americas. Guided by our purpose: \"for every future\", we help our customers, their families and their communities achieve success through a broad range of advice, products and services, including personal and commercial banking, wealth management and private banking, corporate and investment banking, and capital markets.\n  \n\n  \n\nAt Scotiabank, we value the unique skills and experiences each individual brings to the Bank, and are committed to creating and maintaining an inclusive and accessible environment for everyone. If you require accommodation (including, but not limited to, an accessible interview site, alternate format documents, ASL Interpreter, or Assistive Technology) during the recruitment and selection process, please let our Recruitment team know. Candidates must apply directly online to be considered for this role. We thank all applicants for their interest in a career at Scotiabank; however, only those candidates who are selected for an interview will be contacted.",
    "id": "in-fa6acf3eed4f996f",
    "currency": null,
    "site": "indeed",
    "location": "Toronto, ON, CA",
    "company": "Tangerine",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=fa6acf3eed4f996f",
    "title": "Velocity - Tangerine Marketing Internship/Co-op - Summer 2026",
    "date_posted": "2025-12-22",
    "job_type": null,
    "max_amount": null,
    "min_amount": null,
    "job_url_direct": "https://jobs.scotiabank.com/Tangerine/job/Toronto-Velocity-Tangerine-Marketing-InternshipCo-op-Summer-2026-ON/598368117/?feedId=352460&utm_source=Indeed&utm_campaign=TheBankofNovaScotia_Indeed",
    "company_group": "Tangerine",
    "company_search_term": "Tangerine",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": [
      "internship"
    ],
    "location_city": "Toronto",
    "location_region": "ON",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:14.397440+00:00",
    "posted_days_ago": null,
    "dedupe_key": "82a1c283f3f75c78301a0ee877c23497180ff58f"
  },
  {
    "description": "Requisition ID: 245745  \n\n  \n\nJoin a purpose driven winning team, committed to results, in an inclusive and high\\-performing culture.\n\n  \n\nTerm: May – August 2026\n\n\nWork Hours/Week: 37\\.5\n\n\nApplication Deadline: 1/16/2026\n\n  \n\n\n\nThere's no better way to kickstart your career than to do a co\\-op or internship with Tangerine! During your work term, you’ll have the opportunity to be part of a winning team, build your network, and discover what you love – all while getting paid to do it! There’s a place for every type of student at Tangerine and all that we ask for is that you have passion and strong AOO (Attitude, Ownership and Opportunity).\n\n  \n\n\n\nThe Velocity Program is not your average internship or co\\-op! This is a customized experience that focuses on providing you with the development and tools you need to grow your career. After successfully completing a co\\-op or internship with top performance, we will work with you to establish your future placements. As a result, you will get to learn, grow, and experiment within different areas of both Scotiabank and Tangerine!\n\n  \n\n\n\n**Is this role right for you? In this role, you will:**\n\n* Support team by planning and coordinating day\\-to\\-day activities and providing any additional support.\n* Assist in development of reports to share with internal and external partners.\n* Summarize results and highlight wins and key opportunities of bank initiatives.\n* Analyze results/ findings for process improvements.\n* Ensure accuracy in all documentations and deliverables.\n* Work with internal and external stakeholders to ensure timelines/work back schedules are respected for on time delivery.\n\n  \n\n\n\n**Do you have the skills and requirements that will enable you to succeed in this role? – We’d love to work with you if:**\n\n* You are currently enrolled in post\\-secondary education.\n* You pride yourself on thinking outside of the box and bring in ground\\-breaking ideas to the team.\n* You have a natural curiosity and awareness about current market and business trends.\n* You enjoy being involved in extracurricular activities such as conferences, clubs, and competitions and/or hackathons.\n* You love to learn and envision yourself working for an international organization that heavily invests in your future.\n\n  \n\n\n\n**What’s in it for you?**\n\n* You’ll be part of a diverse, collaborative, innovative, and high\\-performing team.\n* In\\-depth training to prepare you for the role, as well as ongoing coaching and feedback to help you succeed!\n* Exclusive student events such as Scotia Student Day, Lunch \\& Learns, leadership panels, and much more!\n* Bank\\-wide orientation to learn more about Scotiabank and gain exposure to senior leadership across the organization.\n\n  \n\n\n\n**Please follow the steps below to successfully apply:**\n\n\nFor students applying to our internship/co\\-op or new graduate programs, we do not require resumes! We believe in evaluating you through relationships over resumes and are focused on learning about who you are and what you’re interested in to uncover your true potential. Instead, we ask that as part of your application you complete the below:\n\n  \n\n\n\nStep 1: Complete your PLUM Profile here and save it as a screenshot.\n\n\nStep 2: Complete a short one\\-way video interview here.\n\n\nStep 3: Once you have completed your Plum Profile, one\\-way video interview, apply to the role on our website. Reminder: when the application asks for your resume, instead upload the screenshot of your PLUM Profile!  \n\n\n\nLocation(s): Canada : Ontario : Toronto  \n\n  \n\nScotiabank is a leading bank in the Americas. Guided by our purpose: \"for every future\", we help our customers, their families and their communities achieve success through a broad range of advice, products and services, including personal and commercial banking, wealth management and private banking, corporate and investment banking, and capital markets.\n  \n\n  \n\nAt Scotiabank, we value the unique skills and experiences each individual brings to the Bank, and are committed to creating and maintaining an inclusive and accessible environment for everyone. If you require accommodation (including, but not limited to, an accessible interview site, alternate format documents, ASL Interpreter, or Assistive Technology) during the recruitment and selection process, please let our Recruitment team know. Candidates must apply directly online to be considered for this role. We thank all applicants for their interest in a career at Scotiabank; however, only those candidates who are selected for an interview will be contacted.",
    "id": "in-a76f3030e3719100",
    "currency": null,
    "site": "indeed",
    "location": "Toronto, ON, CA",
    "company": "Tangerine",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=a76f3030e3719100",
    "title": "Velocity - Tangerine Finance Internship/Co-op - Summer 2026",
    "date_posted": "2025-12-22",
    "job_type": null,
    "max_amount": null,
    "min_amount": null,
    "job_url_direct": "https://jobs.scotiabank.com/Tangerine/job/Toronto-Velocity-Tangerine-Finance-InternshipCo-op-Summer-2026-ON/598368717/?feedId=352460&utm_source=Indeed&utm_campaign=TheBankofNovaScotia_Indeed",
    "company_group": "Tangerine",
    "company_search_term": "Tangerine",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": [
      "internship"
    ],
    "location_city": "Toronto",
    "location_region": "ON",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:14.400706+00:00",
    "posted_days_ago": null,
    "dedupe_key": "ae946a24826afa3edccbfd719e1e66d8d3ebbde8"
  },
  {
    "description": "Requisition ID: 245736  \n\n  \n\nJoin a purpose driven winning team, committed to results, in an inclusive and high\\-performing culture.\n\n  \n\nTerm: May – August 2026\n\n\nWork Hours/Week: 37\\.5\n\n\nApplication Deadline: 01/16/2026\n\n  \n\nThere's no better way to kickstart your career than to do a co\\-op or internship with Tangerine! During your work term, you’ll have the opportunity to be part of a winning team, build your network, and discover what you love – all while getting paid to do it! There’s a place for every type of student at Tangerine and all that we ask for is that you have passion and strong AOO (Attitude, Ownership and Opportunity).\n\n  \n\n\n\nThe Velocity Program is not your average internship or co\\-op! This is a customized experience that focuses on providing you with the development and tools you need to grow your career. After successfully completing a co\\-op or internship with top performance, we will work with you to establish your future placements. As a result, you will get to learn, grow, and experiment within different areas of both Scotiabank and Tangerine!\n\n  \n\n\n\n**Is this role right for you? In this role, you will:**\n\n* Be working and partnering with multiple stakeholders within the bank and teams such as contact centers, clients, internal operations teams etc.\n* Dive deep into process mapping and gap analysis for client related issues and help find solutions.\n* Provide recommendations for improvements to processes and procedures that drive operational excellence or a more amazing client experience.\n* Define the scope and the metrics to confirm success for initiatives in collaboration with stakeholders.\n* You will help support with a larger scope of team\\-wide projects and initiatives as needed.\n\n  \n\n\n\n**Do you have the skills and requirements that will enable you to succeed in this role? – We’d love to work with you if:**\n\n* You are currently enrolled in post\\-secondary education.\n* You love to learn and envision yourself working for an international organization that heavily invests in your future.\n* You enjoy being involved in extracurricular activities such as conferences, clubs, and competitions and/or hackathons.\n* You have knowledge in Microsoft Excel and PowerPoint.\n* You have the ability to research, analyze and prepare a report.\n* You have Knowledge in SQL series, although not a requirement.\n* You are analytical, detailed oriented with strong written and verbal skills.\n* You can work on multiple initiatives at the same time.\n\n  \n\n\n\n**What’s in it for you?**\n\n* You’ll be part of a diverse, collaborative, innovative, and high\\-performing team.\n* In\\-depth training to prepare you for the role, as well as ongoing coaching and feedback to help you succeed!\n* Exclusive student events such as Scotia Student Day, Lunch \\& Learns, leadership panels, and much more!\n* Bank\\-wide orientation to learn more about Scotiabank and gain exposure to senior leadership across the organization.\n* You’ll learn about different areas and processes in the bank and how the various functions work.\n* You will have exposure to stakeholders within and outside of the team\n* You will have the opportunity to learn and collaborate with projects/initiatives within the operations team.\n* You will have the opportunity to learn new systems such as chatbot, IVR (interactive telephony system) which are AI based and help develop these tools.\n\n  \n\n\n\n**Please follow the steps below to successfully apply:**\n\n\nStep 1: Complete your PLUM Profile here and save it as a screenshot.\n\n\nStep 2: Complete a short one\\-way video interview here.\n\n\nStep 3: Once you have completed your Plum Profile, one\\-way video interview, apply to the role on our website. Reminder: when the application asks for your resume, instead upload the screenshot of your PLUM Profile!  \n\n\n\nLocation(s): Canada : Ontario : Toronto  \n\n  \n\nScotiabank is a leading bank in the Americas. Guided by our purpose: \"for every future\", we help our customers, their families and their communities achieve success through a broad range of advice, products and services, including personal and commercial banking, wealth management and private banking, corporate and investment banking, and capital markets.\n  \n\n  \n\nAt Scotiabank, we value the unique skills and experiences each individual brings to the Bank, and are committed to creating and maintaining an inclusive and accessible environment for everyone. If you require accommodation (including, but not limited to, an accessible interview site, alternate format documents, ASL Interpreter, or Assistive Technology) during the recruitment and selection process, please let our Recruitment team know. Candidates must apply directly online to be considered for this role. We thank all applicants for their interest in a career at Scotiabank; however, only those candidates who are selected for an interview will be contacted.",
    "id": "in-aa1a93078fb4c25e",
    "currency": null,
    "site": "indeed",
    "location": "Toronto, ON, CA",
    "company": "Tangerine",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=aa1a93078fb4c25e",
    "title": "Velocity - Tangerine Client Solutions (Product) Internship/Co-op - Summer 2026",
    "date_posted": "2025-12-22",
    "job_type": null,
    "max_amount": null,
    "min_amount": null,
    "job_url_direct": "https://jobs.scotiabank.com/Tangerine/job/Toronto-Velocity-Tangerine-Client-Solutions-%28Product%29-InternshipCo-op-Summer-2026-ON/598367917/?feedId=352460&utm_source=Indeed&utm_campaign=TheBankofNovaScotia_Indeed",
    "company_group": "Tangerine",
    "company_search_term": "Tangerine",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": [
      "internship"
    ],
    "location_city": "Toronto",
    "location_region": "ON",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:14.396006+00:00",
    "posted_days_ago": null,
    "dedupe_key": "2133cfd9db158724b748ee120538fa1dc242b3b4"
  },
  {
    "description": "**Requisition ID**: 245730\n\n\nTangerine is Canada’s leading direct bank. We offer flexible and accessible banking options, innovative products, and award\\-winning Client service. The reason why Tangerine employees come to work each day is to help Canadians live better lives. We focus on making a difference in our communities, and that includes our own internal community. It’s important to us that our employees feel empowered and enthusiastic about belonging to our Orange culture.\n\n  \n\nDo you like new challenges? Are you ready to reach new heights in your career and become part of an established disruptor? If so, come join us and help redefine the Canadian banking landscape!\n\n **What you will be doing:**\n\n  \n\nThe Technology Business Lead's primary role is to understand the problem we are trying to solve, be hands on and work collaboratively with the teams and stakeholders to define the right solution by eliciting, analyzing, validating, defining and writing requirements that meet the needs across various domains. This role will lead bridging the gap between the business need and the technology solution while keeping customer centricity and digital experience top of mind.\n\n\nThe successful candidate has years of deep, practical business analysis experience with complex cross\\-functional features across channels, applications, products \\& digitization. In addition, the Technology Business Lead is expected to act as a mentor to Business Analysts and contribute to the Business Analyst Community of Practice (CoP). This role reports directly to the Senior Manager of Business Analyst in the Digital Product Experience (DPX).\n\n **Is this role right for you? In this role, you will:**\n\n  \n\n* Work with the Product Owner, Technical Lead and stakeholders to capture and document the product vision.\n* Responsible to thoroughly understand and communicate stakeholder requirements and distribute relevant information, documentation and artifacts to stakeholders.\n* Responsible for the preparation, completion and compliance of business requirements based on business needs; go to person for clarity of vision \\& requirements.\n* Discover \\& elicit requirements using interviews, document analysis, requirements workshops, surveys, use cases, scenarios, business analysis and workflow analysis.\n* Supports the Product Owner to manage requirements related activities and deliverables throughout the delivery life cycle (e.g. change requests, issues, risks, schedules, status reporting etc.).\n* Work with the Delivery Teams to identify, anticipate, assess, manage and resolve issues and risks related to requirements' activities and deliverables.\n* Translate standard business requirements into user stories \\& acceptance criteria.\n* Support story mapping by decomposing epics into user stories.\n* Support the Product Owner with data insights to drive customer centric experiences and priorities.\n* Proactively communicate and collaborate with external and internal stakeholders.\n* Work collaboratively with cross\\-functional matrix teams to develop and maintain thorough knowledge of product, system and process capabilities \\& promote customer centric solutions.\n* Execute and maintain the requirement traceability matrix to meet audit requirements.\n\n **Do you have the skills that will enable you to succeed in this role? We'd love to work with you if you have:**\n\n  \n\n* 5\\+ years of experience in a Technology Business Lead role with preference to experience in the digital space (Mobile, Web/Online)\n* Agile mindset \\& comprehensive knowledge and experience in various delivery models including; agile, waterfall, hybrid frameworks\n* Extensive experience with aligning stakeholders and communicating information that enables transparency on the underlying issues and potential solutions.\n* Strong analytical skillset required\n* Customer centric mentality\n* High proficiency in MS Word and MS Visio and thorough experience with as\\-is to\\-be process flow mapping and sequence diagrams\n* High proficiency in the use of JIRA / Confluence\n* Strong presentation, facilitation, analysis and problem solving skills\n* Able to work independently with focus on time management to meet deadlines\n* Ability to deliver seamless execution whether on\\-site or remote\n* Ability to work in a fast paced, demanding and rapidly changing environment\n* Effective leadership skills\n* Detail\\-oriented with a high degree of accuracy and results\\-oriented; be diligent and work with a sense of urgency\n* Very strong organizational sense and effective time and priority management\n* Excellent verbal and written communication skills and the ability to interact professionally with diverse groups, managers and subject matter experts and ability to negotiate effectively.\n* Strong strategic relationship skills\n* Technical background is considered an asset\n* Project management experience is an asset\n* International Institute of Business Analysis (IIBA) certification is an asset\n\n **What's in it for you?**\n\n* You will be part of a diverse and inclusive team of Client\\-focused go\\-getters looking to learn from each other in an environment that celebrates and recognizes success!\n* You will have access to thousands of online and in person courses so you can shape your career growth with the support from diverse industry leaders.\n* You will get our help to save for your future and to invest in your total wellbeing through our Tangerine benefits\\*.\n* You belong here, we are equal and un\\-complicated. Bring your true self to work, dress codes don’t apply here.\n* You will enjoy workspace flexibility and all the excitement that comes from working at the official Bank of the Toronto Raptors.\n\n  \n\nLocation(s): Canada : Ontario : Toronto\n\n\nAt Tangerine we value the unique skills and experiences each individual brings to the team, and are committed to creating and maintaining an inclusive and accessible environment. If you require accommodation during the recruitment and selection process, please let our Recruitment team know.",
    "id": "in-abda4c40be6ed10d",
    "currency": null,
    "site": "indeed",
    "location": "Toronto, ON, CA",
    "company": "Tangerine",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=abda4c40be6ed10d",
    "title": "Technology Business Lead - Tangerine",
    "date_posted": "2025-12-22",
    "job_type": null,
    "max_amount": null,
    "min_amount": null,
    "job_url_direct": "https://jobs.scotiabank.com/Tangerine/job/Toronto-Technology-Business-Lead-Tangerine-ON-M5C2W1/598364917/?feedId=352460&utm_source=Indeed&utm_campaign=TheBankofNovaScotia_Indeed",
    "company_group": "Tangerine",
    "company_search_term": "Tangerine",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": "hybrid",
    "employment_types": null,
    "location_city": "Toronto",
    "location_region": "ON",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:14.402832+00:00",
    "posted_days_ago": null,
    "dedupe_key": "12a45bc42c3bb9d29ebb8c990a22743703cb5336"
  },
  {
    "description": "**Requisition ID**: 239426\n\n\nTangerine is Canada’s leading direct bank. We offer flexible and accessible banking options, innovative products, and award\\-winning Client service. The reason why Tangerine employees come to work each day is to help Canadians live better lives. We focus on making a difference in our communities, and that includes our own internal community. It’s important to us that our employees feel empowered and enthusiastic about belonging to our Orange culture.\n\n  \n\nAre you ready to make the change and become part of an established disruptor with the backing of a highly engaged team? If so come join us and help redefine the Canadian banking landscape!\n\n **What you will be doing:**\n\n\nBuilds out a new data engineering platform for Tangerine to enable business analytics and production AI and ML applications, in support of business strategies and objectives. Ensures all activities conducted are in compliance with governing regulations, internal policies and procedures.\n\n **Is this role right for you?**\n\n* Champions a customer\\-focused culture to deepen client relationships and leverage broader Bank relationships, systems and knowledge.\n* Leads the design and implementation of the Tangerine data engineering strategy and platform, advising senior leadership and executing on the vision with senior architects and the development team.\n* Collaborates with data scientists, data analysts, and software engineers to understand user requirements and inform the design and development of data engineering features.\n* Hands on development on highly complex initiatives.\n* Champions a data design pattern and architecture that supports Tangerine business needs and collaborates with senior architects on pipeline design to support our architectural vision.\n* Mentors technical leads and high\\-potential data engineers by providing stretch\\-goals and feedback through design and code reviews.\n* Remains delivery focused and help the team to resolve technical impediments.\n* Influences product roadmap by working closely with product team and by providing technical insights and suggestions.\n* Champions application security best practices and ensure security\\-by\\-design in data access and processing. Work closely with security architecture and security advisory committee to ensure continued adherence to directives and all security practices.\n* Advances our testing processes including unit, integration, functional, non\\-functional and security testing.\n* Keeps up with innovation in the field of data and AI, enabling advancements around cloud, agentic AI, and production ML workloads.\n* Champions a high\\-performance environment and contributes to an inclusive work environment.\n* Understands how the Bank’s risk appetite and risk culture should be considered in day\\-to\\-day activities and decisions.\n* Actively pursues effective and efficient operations of his/her respective areas in accordance with Scotiabank’s Values, its Code of Conduct and the Global Sales Principles, while ensuring the adequacy, adherence to and effectiveness of day\\-to\\-day business controls to meet obligations with respect to operational, compliance, AML/ATF/sanctions and conduct risk.\n **Do you have the skills that will enable you to succeed in this role?**\n\n* 8\\+ years of data engineering industry experience with a minimum of 6 years designing data platforms for large, complex enterprise applications.\n* Knowledge of/or hands\\-on experience with data and data warehousing technologies\n* Experience shaping and communicating the design pattern to store, organize, process and prepare data for various business purposes\n* Experience building, architecting, designing, and implementing data pipelines to support multiple types of downstream needs, ranging from reporting and analytics to production ML inference pipelines and agentic workflows.\n* Experience designing and implementing public cloud\\-based applications on Google Cloud Platform\n* Familiarity with DevOps practices and knowledge of enhancing CI/CD pipelines.\n* Excellent interpersonal, communication, and influencing skills with the ability to build and foster relationships with business partners, project stakeholders, strategic technology partners and external vendors.\n* Commitment to maintaining a diversified set of skills through continued education and mentoring peers and team members.\n* Ability to collaborate across organizational boundaries, build relationships, and achieve broader organizational goals.\n* Experience working with 3rd party vendors including defining SLOs, limitations, security assessments, etc. to achieve business goals.\n\n **What's in it for you?**\n\n* You will be part of a diverse and inclusive team of Client\\-focused go\\-getters looking to learn from each other in an environment that celebrates and recognizes success!\n* You will have access to thousands of online and in\\-person courses so you can shape your career growth with support from diverse industry leaders.\n* You will get our help to save for your future and to invest in your total well\\-being through our Tangerine benefits\\*.\n* You belong here, and we are equal and uncomplicated. Bring your true self to work, dress codes don’t apply here.\n* You will enjoy workspace flexibility and all the excitement that comes from working at the official Bank of the Toronto Raptors.\n\n  \n\nLocation(s): Canada : Ontario : Toronto\n\n\nAt Tangerine we value the unique skills and experiences each individual brings to the team, and are committed to creating and maintaining an inclusive and accessible environment. If you require accommodation during the recruitment and selection process, please let our Recruitment team know.",
    "id": "in-cd302cabb1102c22",
    "currency": null,
    "site": "indeed",
    "location": "Toronto, ON, CA",
    "company": "Tangerine",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=cd302cabb1102c22",
    "title": "Senior Data Engineer - Tangerine",
    "date_posted": "2025-12-22",
    "job_type": null,
    "max_amount": null,
    "min_amount": null,
    "job_url_direct": "https://jobs.scotiabank.com/Tangerine/job/Toronto-Senior-Data-Engineer-Tangerine-ON-M2H0A1/596785617/?feedId=352460&utm_source=Indeed&utm_campaign=TheBankofNovaScotia_Indeed",
    "company_group": "Tangerine",
    "company_search_term": "Tangerine",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": null,
    "location_city": "Toronto",
    "location_region": "ON",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:14.406797+00:00",
    "posted_days_ago": null,
    "dedupe_key": "3c7fefee130a314bc9d941e765658f4954eb4cfa"
  },
  {
    "description": "**Requisition ID**: 245152\n\n\nTangerine is Canada’s leading direct bank. We offer flexible and accessible banking options, innovative products, and award\\-winning Client service. The reason why Tangerine employees come to work each day is to help Canadians live better lives. We focus on making a difference in our communities, and that includes our own internal community. It’s important to us that our employees feel empowered and enthusiastic about belonging to our Orange culture.\n\n **Purpose**\n\n  \n\nThe Senior Accountant is able to work with minimal supervision, understands and resolves complex issues, has a very clear understanding of IFRS standards and trains and assists less experienced members of the team. The incumbent liaisons with other departments or service providers where necessary to investigate and resolve differences, issues and to design and implement process improvements. The Senior Accountant reports directly to the Manager of Finance Control and Analysis.\n\n\nThe Finance Department at Tangerine is primarily responsible for the capture and reporting of financial information for internal and external audiences in accordance with applicable standards. In addition, the Finance Department performs other important functions. The Treasury Administration function administers securitization transactions and ensures transaction details are accurately captured in our administrative systems so that they can be properly valued, accurately accounted for and appropriately cash settled.\n\n **Is this role right for you? In this role, you will:**\n\n* Analyze assigned general ledger accounts.\n* Explain period\\-over\\-period variances for assigned general ledger accounts.\n* Evaluate the recorded journal entries to ensure compliance with IFRS standards and the Bank’s accounting policies.\n* Reconcile complex general ledger accounts related to the Bank’s product offerings (i.e. mortgages, securities, mutual funds, overdraft account, deposits, and credit cards) and ensure timely identification and resolution of all reconciling items.\n* Reconcile complex general ledger accounts related to the Bank’s operational activities (i.e. payroll, fixed assets, stock\\-based compensation, leases, foreign currency accounting etc.) and ensure timely identification and resolution of all reconciling items.\n* Review and compile the daily reconciliation package. This also involves understanding the source, process and rationale for all entries booked to the general ledger.\n* Investigate, follow\\-up and resolve complex reconciliation issues spanning multiple channels and a multitude of vendors and systems.\n* Co\\-ordinate activities with external vendors and staff in other departments to investigate and resolve issues and to design and implement improvements.\n* Train and assist less experienced team members in executing their job responsibilities. This also involves answering queries of the junior members.\n* Ensure compliance with SOX requirements with respect to the assigned general ledger accounts.\n* Assist with answering external audit queries as well as preparing material requested by the auditors.\n* Assess the financial control processes to ensure adequate controls over mortgage investments, credit card and other banking products.\n* Identify and initiate process improvements to reduce manual effort and maintain accuracy and controls.\n\n **Do you have the skills that will enable you to succeed in this role? \\- We'd love to work with you if you have:**\n\n  \n\n* Education/Experience\n\t+ Minimum 3\\-5 years of relevant work experience in accounting\n\t+ Minimum 2 years of reconciliation experience\n\t+ Experience working with mortgages, retail deposits, overdraft account and credit card reconciliation.\n\n  \n\n* Professional Certification\n\t+ Completion of a financial accounting designation is an asset (Canadian or overseas)\n\n  \n\n* Specialized Knowledge\n* + Expert level understanding of IFRS requirements\n\t+ Strong understanding of all Banking products including, but not limited to, mortgages, investments, mutual funds, credit cards, overdraft accounts and retail deposits\n\n  \n\n* Technical Skills\n* + Exceptionally strong analytical skills\n\t+ Systematic approach to problem solving\n\t+ Strong computer skills with advanced proficiency in Excel and Access\n\n  \n\n* Abilities\n* + Proven ability to multi\\-task and to prioritize competing priorities\n\t+ Demonstrated past track\\-record of successfully meeting tight deadlines\n\n  \n\n* Attributes\n* + Very detail oriented\n\t+ Logical, clear, uncomplicated and organized thinking\n\t+ Excellent verbal and written communication skills\n **Working Conditions**\n\n\nThe Senior Accountant, Finance Control and Analysis will be working in a traditional office environment and may be subject to special working conditions as needed by the business. Special working conditions may cover a range of circumstances from regular evening and weekend work, overtime, shift work, working outdoors and/or working with challenging clients.\n\n  \n\nLocation(s): Canada : Ontario : Toronto\n\n\nAt Tangerine we value the unique skills and experiences each individual brings to the team, and are committed to creating and maintaining an inclusive and accessible environment. If you require accommodation during the recruitment and selection process, please let our Recruitment team know.",
    "id": "in-32ed9930ee71bd09",
    "currency": null,
    "site": "indeed",
    "location": "Toronto, ON, CA",
    "company": "Tangerine",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=32ed9930ee71bd09",
    "title": "Senior Accountant, Financial Control & Analysis - 2 Year Contract",
    "date_posted": "2025-12-22",
    "job_type": "contract",
    "max_amount": null,
    "min_amount": null,
    "job_url_direct": "https://jobs.scotiabank.com/Tangerine/job/Toronto-Senior-Accountant%2C-Financial-Control-&-Analysis-2-Year-Contract-ON-M5C2W1/598359717/?feedId=352460&utm_source=Indeed&utm_campaign=TheBankofNovaScotia_Indeed",
    "company_group": "Tangerine",
    "company_search_term": "Tangerine",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": [
      "contract"
    ],
    "location_city": "Toronto",
    "location_region": "ON",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:14.404891+00:00",
    "posted_days_ago": null,
    "dedupe_key": "452bee81acdf397bd2c561eda9c54db759acea76"
  },
  {
    "description": "**Requisition ID**: 242459\n\n\nTangerine is Canada’s leading direct bank. We offer flexible and accessible banking options, innovative products, and award\\-winning Client service. The reason why Tangerine employees come to work each day is to help Canadians live better lives. We focus on making a difference in our communities, and that includes our own internal community. It’s important to us that our employees feel empowered and enthusiastic about belonging to our Orange culture.\n\n  \n\nAs Canada’s leading digital bank, Tangerine technology is at the heart of everything we do. We have redefined what digital banking is, and we continue to evolve to tackle any opportunity and face every challenge through progressive technology and the power of collaboration.\n\n  \n\nDo you like new challenges? Are you ready to reach new heights in your career and become part of an established disruptor? If so, come join us and help redefine the Canadian banking landscape!\n\n **What you will be doing:**\n\n  \n\nOur design team is growing, and we're looking for an experienced Lead Product Designer to join our innovative and collaborative team. We live and breathe product design and thrive on creating user experiences that truly stand out. If you’re an inspiring leader and strong communicator who knows how to build and lead high\\-performance design teams, you're the one we want.  \n\n  \n\nAs a Lead Mobile Product Designer, you will play a pivotal role in shaping and enhancing the omni\\-channel experience. Your primary objective will be to lead a team of native designers in crafting seamless, engaging user journeys and interactions through design research, compelling visuals, and strong UX principles.\n\n **Is this role right for you? In this role, you will:**\n\n  \n\n* Team Leadership: You will lead and manage a team of designers, setting clear goals, providing guidance, and ensuring the team's effectiveness and efficiency.\n* Strategic Planning: You will contribute to strategic planning by conducting user studies, identifying client and business needs, and aligning the UX strategy with business objectives, working closely with your peers.\n* Mobile Acumen: You’ll not only lead and manage a team of native mobile designers, but also roll up your sleeves and design when needed. To support your team effectively, you must have a deep understanding of native mobile experiences, including the nuances between iOS and Android platforms. You should know their UI guidelines inside and out and be able to apply best practices to create intuitive, platform\\-consistent designs.\n* Design Direction: You will be responsible for providing design direction ensuring a consistent experience across all touchpoints. This includes creating design guidelines and processes, reviewing design artifacts, and providing feedback to the team.\n* Stakeholder Management: Acting as a liaison between the design team and other stakeholders, such as product managers, engineers, and executives, to advocate for usercentered design and negotiate design decisions.\n* Hands\\-on Design and Support: In a lean, flat team environment, you will need to be hands\\-on with design work and provide direct support to the product team when needed, including creating wireframes, prototypes, or design assets, and collaborating closely with the product team to integrate the experience into the product development process.\n\n **Do you have the skills that will enable you to succeed in this role? We'd love to work with you if you have:**\n\n  \n\n* You bring 7\\+ years of product design experience, including 2\\+ years leading high\\-performing teams.\n* You possess the positivity and energy to lead and inspire a high\\-performing team.\n* You have excellent communication skills and the ability to collaborate effectively with cross functional teams.\n* You enjoy coaching and mentoring designers, from UX methodology to the latest design trends, and even the nitty\\-gritty of design tools.\n* You have an eagle eye for catching inconsistencies and are meticulous in design quality assurance.\n* You have proven experience as a User Experience leader with a strong track record and a portfolio of successful projects.\n* You have proficiency in Figma, interactive prototyping, animation, and conducting UX studies.\n* You have a deep understanding of design systems and a strong knowledge of how to collaborate with a design system team to further evolve an existing system.\n* You thrive in both in\\-person/in\\-office collaboration and remote work settings, demonstrating adaptability and effectiveness in diverse work environments.\n* You have in\\-depth knowledge of UI frameworks and guidelines for mobile and web.\n* Experience in financial institution or related industry is a bonus.\n\n **What's in it for you?**\n\n  \n\n* Work in a mission\\-driven culture that prioritizes empowerment, diversity, and continuous learning.\n* Join a modern banking environment where design plays a central role in shaping client value.\n* Be part of a high\\-visibility team that is reimagining the future of personal finance in Canada.\n* You will get our help to save for your future and to invest in your total wellbeing through our Tangerine benefits\\*.\n* You belong here, we are equal and un\\-complicated. Bring your true self to work, dress codes don’t apply here.\n* You will enjoy workspace flexibility and all the excitement that comes from working at the official Bank of the Toronto Raptors.\n\n* Tangerine employees participate in Scotiabank’s pension \\& benefits programs (available to permanent employees)\n  \n\nLocation(s): Canada : Ontario : Toronto\n\n\nAt Tangerine we value the unique skills and experiences each individual brings to the team, and are committed to creating and maintaining an inclusive and accessible environment. If you require accommodation during the recruitment and selection process, please let our Recruitment team know.",
    "id": "in-1d8aff89ac361672",
    "currency": null,
    "site": "indeed",
    "location": "Toronto, ON, CA",
    "company": "Tangerine",
    "interval": null,
    "is_remote": true,
    "job_url": "https://ca.indeed.com/viewjob?jk=1d8aff89ac361672",
    "title": "Lead Mobile Product Designer - Tangerine",
    "date_posted": "2025-12-21",
    "job_type": null,
    "max_amount": null,
    "min_amount": null,
    "job_url_direct": "https://jobs.scotiabank.com/Tangerine/job/Toronto-Lead-Mobile-Product-Designer-Tangerine-ON-M5C2W1/597585417/?feedId=352460&utm_source=Indeed&utm_campaign=TheBankofNovaScotia_Indeed",
    "company_group": "Tangerine",
    "company_search_term": "Tangerine",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": "remote",
    "employment_types": null,
    "location_city": "Toronto",
    "location_region": "ON",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:14.408766+00:00",
    "posted_days_ago": null,
    "dedupe_key": "0d30d6530ab58dd0086c5adc89d1fa85d5a47425"
  },
  {
    "description": "**Requisition ID**: 229092\n\n\nTangerine is Canada’s leading direct bank. We offer flexible and accessible banking options, innovative products, and award\\-winning Client service. The reason why Tangerine employees come to work each day is to help Canadians live better lives. We focus on making a difference in our communities, and that includes our own internal community. It’s important to us that our employees feel empowered and enthusiastic about belonging to our Orange culture.\n\n  \n\nThe Information Technology (IT) department manages the technology and computer infrastructure that drives Tangerine’s business systems.\n\n\nThe IT department supports the organization in these critical areas: End\\-User Technical Support, Desktop Management, Network Management, Voice and Data Communications, Business and Web Applications and Strategic Technical Planning.\n\n\nThe Technical Support Analyst is responsible for the implementation, administration, and technical support of Tangerine’s Wintel Active Directory environment from an installed applications perspective. The Technical Support Analyst will combine solid technical knowledge, strong analytical skill and hands\\-on working experience in the administration and support of the Windows platform, maintaining a highly secure, reliable and optimized operating environment. The Technical Support Analyst of Applications will report directly to the Manager \\- Technical Support and Services, Applications (Global Platform Engineering).\n\n **Is this role right for you?**  \n\n* Administration, maintenance and technical support Enterprise Active Directory, CyberArk and all the Microsoft suite of products (SCCM, SCOM, Office 365, Orchestrator).\n* Administration, maintenance and technical support of the McAfee Endpoint Advanced suite of products.\n* Assist with the selection, design, build, and implementation of new Windows based applications and operating system technologies as well as supporting Tangerine standards and usage guidelines.\n* Assist with the administration and maintenance of an Enterprise Active Directory environment.\n* Assist with the forecasting of Windows capacity requirements as well based on business and internal IT infrastructure growth.\n* Provide 24x7 support for Active Directory Wintel Server applications in a production environment as required.\n* Work on Servers to ensure all control software/Agents (Trellix, CrowdStrike, Tenable, Tanium, SysLog, NTP, etc) are well up to date and reporting correctly.\n* Assist with the administration, maintenance, optimization, operating system patch management and technical support of the production and development environments.\n* Continuously work on identified vulnerabilities to ensure systems are secure and well up to date.\n* Must ensure availability, reliability and scalability of all Windows servers which includes all application, file and print and BCP and other servers. Perform periodic failover tests for applications to ensure they are well tested for DR scenarios.\n* Evaluate and recommend server\\-based solutions to meet changing business requirements to allow staff to work and support the business remotely.\n* Coordinate and ensure compliance with Windows Server disaster recovery and contingency plans to assure the rapid recovery of systems in the event of an emergency of disaster.\n* Actively participate in the evaluation and selection process for new Infrastructure, supporting applications.\n* Required to be available outside normal business hours.\n* Required to carry mobile device to handle 7x24 support issues and should be able to go on periodic On\\-Call responsibilities.\n* Other duties as assigned.\n **Do you have the skills that will enable you to succeed in this role?**  \n\n* University or College Degree\n* 5\\+ years of demonstrated hands\\-on experience in system administration supporting a\n* Experience and in\\-depth knowledge with installation, configuration and administration of Windows 2016, 2019 and 2022 Servers.\n* Working knowledge of Active Directory, GPOs, DNS, DHCP, IIS, DFS, Certificate and other Operating System Services.\n* Experience with Microsoft System Center Configuration Manager (Windows Patching, Application deployments, reporting, etc) and In\\-Tune environments.\n* Working knowledge of various aspects of vulnerability management on Windows Servers.\n* Working knowledge of Application management (Installing various applications on Windows Servers manually or using SCCM to automate or bulk deployments).\n* Hands\\-on experience with VMWare, Microsoft System Centre Operations Manager (SCOM) and CyberArk\n* Conceptual and working knowledge of ITIL processes (Incident, Request and Change Management)\n* Good Knowledge and experience working with PowerShell, scripting and automation.\n* Should have good hands\\-on experience with productivity enhancement software like Microsoft Word, Excel, PowerPoint, Visio, Outlook, Teams and OneDrive applications)\n* Demonstrated excellence in documenting complex enterprise level systems and procedures\n* Able to proactively share and communicate complex technical and procedural information\n* Self\\-motivated and self\\-directed with continuous improvement in mind.\n* Logical thinker, step\\-oriented problem solving\n* Good verbal and written communications, including presentation skills\n* Strong team player who is confident and challenged in a fast\\-paced environment supporting a wide range of technologies\n **What's in it for you?**  \n\n* Diversity, Equity, Inclusion \\& Allyship \\- We strive to create an inclusive culture where every employee is empowered to reach their fullest potential, respected for who they are, and are embraced through bias\\-free practices and inclusive values across Scotiabank. We embrace diversity and provide opportunities for all employee to learn, grow \\& participate through our various Employee Resource Groups (ERGs) that span across diverse gender identities, ethnicity, race, age, ability \\& veterans.\n* Accessibility and Workplace Accommodations \\- We value the unique skills and experiences each individual brings to the Bank, and are committed to creating and maintaining an inclusive and accessible environment for everyone. Scotiabank continues to locate, remove and prevent barriers so that we can build a diverse and inclusive environment while meeting accessibility requirements.\n* Upskilling through online courses, cross\\-functional development opportunities, and tuition assistance.\n* Competitive Rewards program including bonus, flexible vacation, personal, sick days and benefits will start on day one.\n* Community Engagement \\- no matter where you choose to work from; we offer opportunities for community engagement \\& belonging with our various programs such as hackathons, contests, cooking with friends, Humans of Digital and much more!\n  \n\nLocation(s): Canada : Ontario : Toronto\n\n\nAt Tangerine we value the unique skills and experiences each individual brings to the team, and are committed to creating and maintaining an inclusive and accessible environment. If you require accommodation during the recruitment and selection process, please let our Recruitment team know.",
    "id": "in-1650a4ca59245de3",
    "currency": null,
    "site": "indeed",
    "location": "Toronto, ON, CA",
    "company": "Tangerine",
    "interval": null,
    "is_remote": true,
    "job_url": "https://ca.indeed.com/viewjob?jk=1650a4ca59245de3",
    "title": "Technical Support Analyst, Applications, Tangerine",
    "date_posted": "2025-12-20",
    "job_type": null,
    "max_amount": null,
    "min_amount": null,
    "job_url_direct": "https://jobs.scotiabank.com/Tangerine/job/Toronto-Technical-Support-Analyst%2C-Applications%2C-Tangerine-ON-M2H0A1/593436717/?feedId=352460&utm_source=Indeed&utm_campaign=TheBankofNovaScotia_Indeed",
    "company_group": "Tangerine",
    "company_search_term": "Tangerine",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": null,
    "location_city": "Toronto",
    "location_region": "ON",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:14.414042+00:00",
    "posted_days_ago": null,
    "dedupe_key": "555d42fbcc3c328ddc44722fd5f6ee053e2b9708"
  },
  {
    "description": "**Requisition ID**: 239499\n\n\nTangerine is Canada’s leading direct bank. We offer flexible and accessible banking options, innovative products, and award\\-winning Client service. The reason why Tangerine employees come to work each day is to help Canadians live better lives. We focus on making a difference in our communities, and that includes our own internal community. It’s important to us that our employees feel empowered and enthusiastic about belonging to our Orange culture.\n\n  \n\nAre you ready to make the change and become part of an established disruptor with the backing of a highly engaged team? If so come join us and help redefine the Canadian banking landscape!\n\n **What you will be doing:**\n\n\nBuilds out a new data engineering platform for Tangerine to enable business analytics and production AI and ML applications, in support of business strategies and objectives. Ensures all activities conducted are in compliance with governing regulations, internal policies and procedures.\n\n **Is this role right for you?**\n\n* Champions a customer\\-focused culture to deepen client relationships and leverage broader Bank relationships, systems and knowledge.\n* Leads the design and implementation of the Tangerine data engineering strategy and platform, advising senior leadership and executing on the vision with senior architects and the development team.\n* Collaborates with data scientists, data analysts, and software engineers to understand user requirements and inform the design and development of data engineering features.\n* Hands on development on highly complex initiatives.\n* Champions a data design pattern and architecture that supports Tangerine business needs and collaborates with senior architects on pipeline design to support our architectural vision.\n* Mentors technical leads and high\\-potential data engineers by providing stretch\\-goals and feedback through design and code reviews.\n* Remains delivery focused and help the team to resolve technical impediments.\n* Influences product roadmap by working closely with product team and by providing technical insights and suggestions.\n* Champions application security best practices and ensure security\\-by\\-design in data access and processing. Work closely with security architecture and security advisory committee to ensure continued adherence to directives and all security practices.\n* Advances our testing processes including unit, integration, functional, non\\-functional and security testing.\n* Keeps up with innovation in the field of data and AI, enabling advancements around cloud, agentic AI, and production ML workloads.\n* Champions a high\\-performance environment and contributes to an inclusive work environment.\n* Understands how the Bank’s risk appetite and risk culture should be considered in day\\-to\\-day activities and decisions.\n* Actively pursues effective and efficient operations of his/her respective areas in accordance with Scotiabank’s Values, its Code of Conduct and the Global Sales Principles, while ensuring the adequacy, adherence to and effectiveness of day\\-to\\-day business controls to meet obligations with respect to operational, compliance, AML/ATF/sanctions and conduct risk.\n **Do you have the skills that will enable you to succeed in this role?**\n\n* 10\\+ years of data engineering industry experience with a minimum of 8 years designing data platforms for large, complex enterprise applications.\n* Knowledge of/or hands\\-on experience with data and data warehousing technologies\n* Experience shaping and communicating the design pattern to store, organize, process and prepare data for various business purposes\n* Experience building, architecting, designing, and implementing data pipelines to support multiple types of downstream needs, ranging from reporting and analytics to production ML inference pipelines and agentic workflows.\n* Experience designing and implementing public cloud\\-based applications on Google Cloud Platform\n* Familiarity with DevOps practices and knowledge of enhancing CI/CD pipelines.\n* Excellent interpersonal, communication, and influencing skills with the ability to build and foster relationships with business partners, project stakeholders, strategic technology partners and external vendors.\n* Commitment to maintaining a diversified set of skills through continued education and mentoring peers and team members.\n* Ability to collaborate across organizational boundaries, build relationships, and achieve broader organizational goals.\n* Experience working with 3rd party vendors including defining SLOs, limitations, security assessments, etc. to achieve business goals.\n\n **What's in it for you?**\n\n* You will be part of a diverse and inclusive team of Client\\-focused go\\-getters looking to learn from each other in an environment that celebrates and recognizes success!\n* You will have access to thousands of online and in\\-person courses so you can shape your career growth with support from diverse industry leaders.\n* You will get our help to save for your future and to invest in your total well\\-being through our Tangerine benefits\\*.\n* You belong here, and we are equal and uncomplicated. Bring your true self to work, dress codes don’t apply here.\n* You will enjoy workspace flexibility and all the excitement that comes from working at the official Bank of the Toronto Raptors.\n\n **\\#BFUTR**\n\n\nLocation(s): Canada : Ontario : Toronto\n\n\nAt Tangerine we value the unique skills and experiences each individual brings to the team, and are committed to creating and maintaining an inclusive and accessible environment. If you require accommodation during the recruitment and selection process, please let our Recruitment team know.",
    "id": "in-2574b8565f3a8795",
    "currency": null,
    "site": "indeed",
    "location": "Toronto, ON, CA",
    "company": "Tangerine",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=2574b8565f3a8795",
    "title": "Principal Data Engineer - Tangerine",
    "date_posted": "2025-12-20",
    "job_type": null,
    "max_amount": null,
    "min_amount": null,
    "job_url_direct": "https://jobs.scotiabank.com/Tangerine/job/Toronto-Principal-Data-Engineer-Tangerine-ON-M2H0A1/596717117/?feedId=352460&utm_source=Indeed&utm_campaign=TheBankofNovaScotia_Indeed",
    "company_group": "Tangerine",
    "company_search_term": "Tangerine",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": null,
    "location_city": "Toronto",
    "location_region": "ON",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:14.416063+00:00",
    "posted_days_ago": null,
    "dedupe_key": "a9aae06560338ab2899fd96dfc0b07a05f00fdd4"
  },
  {
    "description": "**Requisition ID**: 241600\n\n\nTangerine is Canada’s leading direct bank. We offer flexible and accessible banking options, innovative products, and award\\-winning Client service. The reason why Tangerine employees come to work each day is to help Canadians live better lives. We focus on making a difference in our communities, and that includes our own internal community. It’s important to us that our employees feel empowered and enthusiastic about belonging to our Orange culture.\n\n **The Team**\n\n  \n\nScotiabank’s Security Advisory Services team is responsible for providing advisory services to Tangerine Bank and it’s business lines, subsidiaries and affiliates enabling the achievement of the Bank's Information Security as it continues to move to the Public Cloud.\n\n **The Role**\n\n  \n\nReporting to the Senior Manager of Security Advisory (Tangerine), the Information Security Advisor provides guidance to business lines to ensure design, development and implementation of complex projects and initiatives are in accordance with the Bank's Information Security Standards and in compliance with industry regulations. In this role, you will be supporting various business lines while assisting them in making informed decisions to protect information assets deployed in Public Clouds environments.\n\n **Is this role right for you? In this role, you will****:**\n\n  \n\n* You have a strong experience leading complex projects providing security advise to ensure information security risk are mitigated.\n* You thrive in solutioning for multiple security domains (Application Security, Data Protection, Cloud Security Engineering, Identity and Access Management, Cloud Security Architecture, Network Security, Risk Management, etc.) and knowledgeable of Zero Trust Architecture principles.\n* You have experience in solutioning security architecture, creating and reviewing security patterns, and advising on security risks.\n* You are proficient in reviewing architecture and solution design documentation and can identify and assess potential risks.\n* You excel in reviewing Technical Design and Security Design documents and creating assessment documents (Threat Risk Assessment) and evaluating risks.\n* You are passionate about new technologies and enjoy the challenges of implementing security controls to protect them.\n* Working on different types of projects (from large complex to simple) is a part of your DNA.\n* You love to collaborate with various business lines, IT support functions and IS\\&C Control functions\n\n **Do you have the skills that will enable you to succeed in this role? We'd love to work with you if you have:**\n\n  \n\n* Post\\-secondary education in Computer Science or in a related field.\n* You have at least 5 years of hands\\-on technical working experience in performing security assessments on cloud platforms, CI/CD deployment pipelines, network infrastructure and complex applications. Experience with Risk Assessments of applications migrated into the Cloud Environments.\n* You have at least 5 years experience in security solution architecture, software development, and/or hands\\-on experience with implementations of cloud environments, security controls and cloud\\-based solutions.\n* You are a strong communicator and capable of creating clear documentation and communicating ideas to others\n* You have solid knowledge of cloud technologies and cloud security (GCP or Azure or AWS, Kubernetes and IAM, CI/CD pipelines, Terraforms, infrastructure as a code).\n* Experience with GCP and Kubernetes is a strong asset.\n* Experience with tools used in securing cloud deployments such as CNAPP, CSPM, CWPP, etc.\n* You have cloud security engineering or cloud solution architecture certifications from Google, Microsoft or AWS.\n* You have used industry leading productivity tools to produce quantitative/qualitative reports, data flow diagrams \\& visual presentations.\n* Certifications (CISSP, CISM, CCSP, CRISC) are nice to have.\n* Familiar with industry standards and frameworks e.g., NIST 800\\-53, ISO 27001, ISO27002, ISO 27017, ISO27018, PCI DSS, CIS.\n* You possess advanced communication (verbal/written/presentation) skills in English. Knowledge of Spanish is an asset.\n\n **Key Job Accountabilities:**\n\n  \n\n* Provide strategic guidance and technical expertise to business lines, IT support functions, and IS\\&C Control functions to include security within early stages of the design of Bank´s technological solutions.  \n\nProviding the following functions to Tangerine/Scotiabank’s Initiatives:\n* Conducting Threat Risk Assessments and performing security advisory work on specific applications and infrastructure associated with Scotiabank’s Cloud and other Initiatives ensuring that controls are adequate, meet Bank standards, and enable business objectives.\n* Conducting Risk Management activities.\n* Provide Quality Assurance on Threat Risk Assessments and Threat Modelling as required for Cloud initiatives. Provide strategic guidance and technical expertise on security solutions and recommend best practices.\n* Conduct comprehensive security assessments on large high\\-profile initiatives implemented in GCP and Azure.\n* Collaborate with cross\\-functional teams to design and implement robust security architectures for various systems, applications, and networks.\n* Evaluate existing security solutions and propose enhancements or new designs to address emerging threats and business requirements.\n* Ensure alignment with industry best practices, compliance standards, and organizational security policies.\n* Identify security weaknesses, vulnerabilities, and gaps in existing systems and recommend remediation strategies.\n* Provide support on how to apply the Bank's portfolio of standards to the technology footprint of Scotiabank’s Cloud offering.\n* Provide oversight over the specific line of business security posture, ensuring that all tools available to detect and remediate security risks have been applied.\n* Conduct industry reviews and benchmarking exercises to ensure our controls are aligned with our peers, emerging threats, and available mitigation strategies.\n* Working directly with technical leads from assigned Lines of Businesses supporting their initiatives from an Information Security perspective.\n* Providing relationship management function primarily to the Tangerine and Enterprise Cloud team from an Information Security perspective.\n\n **What's in it for you?**\n\n  \n\n* Diversity, Equity, Inclusion \\& Allyship \\- We strive to create an inclusive culture where every employee is empowered to reach their fullest potential, respected for who they are, and are embraced through bias\\-free practices and inclusive values across Scotiabank. We embrace diversity and provide opportunities for all employees to learn, grow \\& participate through our various Employee Resource Groups (ERGs) that span across diverse gender identities, ethnicity, race, age, ability \\& veterans.\n* Accessibility and Workplace Accommodations \\- We value the unique skills and experiences each individual brings to the Bank and are committed to creating and maintaining an inclusive and accessible environment for everyone. Scotiabank continues to locate, remove and prevent barriers so that we can build a diverse and inclusive environment while meeting accessibility requirements.\n* Upskilling through online courses, cross\\-functional development opportunities, and tuition assistance.\n* Competitive Rewards program including bonus, flexible vacation, personal, sick days and benefits will start on day one.\n* Community Engagement \\- no matter where you choose to work from; we offer opportunities for community engagement \\& belonging with our various programs such as hackathons, contests, Humans of Digital and much more!\n\n\nLocation(s): Canada : Ontario : Toronto\n\n\nAt Tangerine we value the unique skills and experiences each individual brings to the team, and are committed to creating and maintaining an inclusive and accessible environment. If you require accommodation during the recruitment and selection process, please let our Recruitment team know.",
    "id": "in-fe5c88711e0f2435",
    "currency": null,
    "site": "indeed",
    "location": "Toronto, ON, CA",
    "company": "Tangerine",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=fe5c88711e0f2435",
    "title": "Information Security Advisor",
    "date_posted": "2025-12-20",
    "job_type": null,
    "max_amount": null,
    "min_amount": null,
    "job_url_direct": "https://jobs.scotiabank.com/Tangerine/job/Toronto-Information-Security-Advisor-ON/597547817/?feedId=352460&utm_source=Indeed&utm_campaign=TheBankofNovaScotia_Indeed",
    "company_group": "Tangerine",
    "company_search_term": "Tangerine",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": null,
    "location_city": "Toronto",
    "location_region": "ON",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:14.411556+00:00",
    "posted_days_ago": null,
    "dedupe_key": "8c3c8f9f9eac99edd729d359b2d909435f570265"
  },
  {
    "description": "**Numéro de la demande:** 245553\n\n  \n\nTangerine est la plus importante banque directe au Canada. Nous offrons des options bancaires souples et accessibles, des produits novateurs et un service à la clientèle primé. La raison pour laquelle les employés de Tangerine se présentent au travail chaque jour est d'aider les Canadiens à vivre une meilleure vie. Nous nous efforçons de faire une différence dans nos communautés, et cela inclut notre propre communauté interne. Il est important pour nous que nos employés se sentent responsabilisés et enthousiastes à l'idée d'appartenir à notre culture d’entreprise.\n\n **Qui nous sommes :** L’équipe du Centre contact clientèle est au cœur de nos opérations. En joignant notre Centre de contact, vous découvrirez un milieu de travail inclusif dont l’excellence a été soulignée par de nombreux prix et qui offre un service à la clientèle de qualité hors pair. Au cours de votre carrière à Tangerine, vous ferez l’expérience d’une culture d’entreprise axée sur la reconnaissance et les récompenses, la diversité et l’inclusion, ainsi que sur nos valeurs fondamentales que sont le respect, l’intégrité, la passion et la responsabilisation.\n\n  \n\nDes leaders des services bancaires s’emploieront à nourrir et soutenir vos aptitudes et vos compétences pour favoriser votre réussite et votre perfectionnement.\n\n\nTangerine reconnaît la valeur de la diversité et son apport à l’expérience de ses équipes et de ses clients.\n\n\nVous serez accueilli au sein de la famille Tangerine et aurez accès à une communauté autochtone importante et en pleine croissance, où vous pourrez réseauter, échanger et apprendre avec les membres de notre équipe issus d’une communauté autochtone et leurs alliés. Nous encourageons aussi ceux et celles qui se font le porte\\-voix de l’intersectionnalité et avons divers groupes de ressources pour les employés qui correspondent à votre style de vie et à votre parcours.\n\n **Spécialiste bilingue, Service clientèle – Tangerine**\n\n\nLa technologie à Tangerine, la principale banque numérique du Canada, est au cœur de tout ce que nous faisons. Nous avons redéfini ce qu’est une banque numérique et nous continuons à évoluer pour saisir toutes les occasions et relever tous les défis grâce à une technologie de pointe et au pouvoir de la collaboration.\n\n  \n\nVous aimez relever de nouveaux défis? Êtes\\-vous prêt à mener votre carrière vers de nouveaux sommets et à faire partie d’une entreprise novatrice bien établie? Si c’est le cas, joignez\\-vous à nous et aidez\\-nous à redéfinir le paysage bancaire canadien!\n\n **Vos responsabilités**\n\n\nÀ titre d’ambassadeur de la marque au sein de notre Centre de contact, vous ferez partie d’une équipe qui offre aux Canadiens un service primé et des solutions bancaires de premier ordre. Votre rôle de spécialiste, Service clientèle, vous amènera à interagir avec les clients en leur fournissant un soutien exceptionnel pour effectuer leurs opérations bancaires courantes, à leur expliquer les canaux libre\\-service et à leur recommander de manière proactive des produits qui répondent à leurs besoins financiers.\n\n\nCette fonction vous convient\\-elle? Voici les principales responsabilités de son titulaire :\n\n* offrir aux clients un service professionnel et courtois durant les appels entrants et sortants, et par l’intermédiaire des services numériques, dans un environnement dynamique;\n* interagir avec les clients en leur fournissant un soutien exceptionnel pour effectuer leurs opérations bancaires courantes et leur recommander de manière proactive des produits qui répondent à leurs besoins financiers;\n* renseigner les clients sur une vaste gamme de produits financiers (p. ex. compte\\-chèques, compte d’épargne, etc.) et les canaux libre\\-service afin qu’ils puissent trouver eux\\-mêmes les ressources en ligne;\n* favoriser le règlement au premier contact en relevant les obstacles à l’excellence du service et en travaillant à leur élimination.\n\n **Embauche et formation:**\n\n* Date d’entrée en fonction : Janvier 2026\n* Type de poste : Temps plein (37,5 heures)\n\n **Formation et quart de travail**\n\n* Le candidat doit être disponible pour suivre une formation en personne à notre bureau à Moncton pendant une période pouvant aller jusqu’à 11 semaines. Le candidat doit faire preuve de souplesse et être disposé à travailler le matin, l’après\\-midi et le soir, y compris les fins de semaine et les jours fériés entre 7 h et 0 h (minuit).\n\n **Avez\\-vous les compétences vous permettant de réussir dans cette fonction? Nous serions heureux de travailler avec vous si vous remplissez les exigences suivantes :**\n\n* Solides compétences en anglais et en français, tant à l’oral qu’à l’écrit\n* Grande curiosité, ce qui contribue à répondre aux besoins des clients et à élaborer des solutions\n* Détermination à offrir un service à la clientèle exceptionnel\n* Facilité à résoudre les problèmes et les conflits\n* Capacité d’apprendre facilement et de s’adapter rapidement aux technologies d’un Centre de contact\n* Aptitudes marquées pour la gestion du temps et grand sens de l’organisation\n* Expérience dans la vente ou le commerce de détail ou dans un autre environnement de service à la clientèle, un atout\n\n **Qu’avez\\-vous à y gagner?**\n\n* Vous ferez partie d’une équipe diversifiée et inclusive, composée de personnes motivées et axées sur la clientèle, désireuses d’apprendre les unes des autres dans un environnement qui célèbre et reconnaît les réussites!\n* Vous aurez accès à des milliers de cours en ligne et en présentiel, ce qui vous permettra de façonner votre carrière avec le soutien de divers leaders du secteur.\n* Nous vous aiderons à épargner pour votre avenir et à investir dans votre bien\\-être grâce aux avantages sociaux de Tangerine\\*.\n* Vous avez votre place ici, nous sommes égaux et faciles à vivre. Soyez vous\\-même au travail.\n* Vous bénéficierez d’un espace de travail souple et de toute l’excitation que procure le fait de travailler à la Banque officielle des Raptors de Toronto.\n\n* Les employés de Tangerine participent aux régimes de retraite et aux avantages sociaux de la Banque Scotia (offerts aux employés permanents).\n\n  \n\nTangerine valorise les compétences uniques que chaque employé apporte à l’équipe. Nous nous engageons à offrir un environnement inclusif et accessible pour tous. Si vous avez besoin de mesures d’adaptation durant le processus de recrutement et de sélection, veuillez en informer l’équipe de recrutement.\n\n\nEmplacement(s): Canada : Nouveau\\-Brunswick : Moncton\n\n\nChez Tangerine, nous valorisons les compétences et les expériences uniques que chaque personne apporte à l’équipe. Nous nous engageons à créer et à maintenir un environnement inclusif et accessible. Si vous avez besoin de mesures d’adaptation pendant le processus de recrutement et de sélection, veuillez en informer notre équipe de recrutement.",
    "id": "in-6a770340ac40a78a",
    "currency": null,
    "site": "indeed",
    "location": "Moncton, NB, CA",
    "company": "Tangerine",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=6a770340ac40a78a",
    "title": "Bilingual Client Service Specialist- Janvier 2026 1",
    "date_posted": "2025-12-19",
    "job_type": null,
    "max_amount": null,
    "min_amount": null,
    "job_url_direct": "https://jobs.scotiabank.com/Tangerine/job/Moncton-Bilingual-Client-Service-Specialist-Janvier-2026-1-NB/598325317/?feedId=352460&utm_source=Indeed&utm_campaign=TheBankofNovaScotia_Indeed",
    "company_group": "Tangerine",
    "company_search_term": "Tangerine",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": null,
    "location_city": "Moncton",
    "location_region": "NB",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:14.418345+00:00",
    "posted_days_ago": null,
    "dedupe_key": "7fe91d9fb431b2906dd543d26197608f4e39d9bd"
  },
  {
    "description": "**Requisition ID**: 245553\n\n\nTangerine is Canada’s leading direct bank. We offer flexible and accessible banking options, innovative products, and award\\-winning Client service. The reason why Tangerine employees come to work each day is to help Canadians live better lives. We focus on making a difference in our communities, and that includes our own internal community. It’s important to us that our employees feel empowered and enthusiastic about belonging to our Orange culture.\n\n  \n\nYour skills and abilities will be nurtured and supported by banking leaders, with the focus on your success and development. At Tangerine, we value diversity and what it brings to our teams and customer experiences.\n\n  \n\nYou will be welcomed into our Tangerine family and have access to a large and growing Indigenous community, where you will be able to connect, share, and learn with our Indigenous team members and their allies. We also uplift voices that value intersectionality and have a variety of Employee Resource Groups to fit your lifestyle and background.\n\n **Bilingual (French and English) Client Service Specialist \\- Tangerine**\n\n  \n\nAs Canada’s leading digital bank, Tangerine technology is at the heart of everything we do. We have redefined what digital banking is, and we continue to evolve to tackle any opportunity and face every challenge through progressive technology and the power of collaboration.\n\n  \n\nDo you like new challenges? Are you ready to reach new heights in your career and become part of an established disruptor? If so, come join us and help redefine the Canadian banking landscape!\n\n  \n\n\n\n**What you will be doing:**\n\n\nBeing a brand ambassador within our contact centre means you will be part of a team that provides award\\-winning service and delivers best in class banking solutions to Canadians. As a Client Service Specialist, you will engage with clients by providing exceptional support on their daily banking needs, educate them on self\\-service channels and proactively recommend products that meet their financial needs.\n\n **Is this role right for you? In this role you will:**\n\n* Deliver friendly and professional service to clients through inbound, outbound and eService channels in a fast\\-paced environment\n* Engage with clients by providing best\\-in\\-class support on their daily banking needs, and proactively recommend products that meet their financial needs.\n* Educate Clients on a wide range of financial products (e.g. Chequing/Savings accounts etc.) and on self\\-service channels to enable Clients to serve themselves online.\n* Drive first contact resolution while identifying barriers to excellent service and work towards eliminating them.\n\n **Hiring \\& Training Details:**\n\n* **Please note this position is in office in Moncton, New Brunswick.**\n* Position Start Date: March 2026\n* Position Status: Full\\-time (37\\.5 hours)\n\n **Work Shift Details:**\n\n* Must be available to attend training in person, in full for a total for 11 weeks. Flexibility in working morning, afternoon and evening shifts including weekends and statutory holidays between the hours of 7 am to 12 am (midnight).\n\n **Do you have the skills that will enable you to succeed in this role? We'd love to work with you if you have:**\n\n* Strong English and French, both oral and written communication skills\n* High curiosity to help meet clients’ needs and build solutions\n* Passion for providing an exceptional client experience\n* Strong problem solving and conflict resolution capabilities\n* Ability to learn and adapt quickly to contact centre technology\n* Strong time management and organizational skills\n* Experience in retail, sales or other customer service environment is an asset\n\n **What's in it for you?**\n\n* You will be part of a diverse and inclusive team of Client\\-focused go\\-getters looking to learn from each other in an environment that celebrates and recognizes success!\n* You will have access to thousands of online and in person courses so you can shape your career growth with the support from diverse industry leaders.\n* You will get our help to save for your future and to invest in your total wellbeing through our Tangerine benefits\\*.\n* You belong here, we are equal and un\\-complicated. Bring your true self to work.\n* You will enjoy workspace flexibility and all the excitement that comes from working at the official Bank of the Toronto Raptors.\n\n* Tangerine employees participate in Scotiabank’s pension \\& benefits programs (available to permanent employees)\n\n  \n\nAt Tangerine we value the unique skills and experiences each individual brings to the team and are committed to creating and maintaining an inclusive and accessible environment. If you require accommodation during the recruitment and selection process, please let our Recruitment team know.\n\n\nLocation(s): Canada : New Brunswick : Moncton\n\n\nAt Tangerine we value the unique skills and experiences each individual brings to the team, and are committed to creating and maintaining an inclusive and accessible environment. If you require accommodation during the recruitment and selection process, please let our Recruitment team know.",
    "id": "in-fead39b66d013a77",
    "currency": null,
    "site": "indeed",
    "location": "Moncton, NB, CA",
    "company": "Tangerine",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=fead39b66d013a77",
    "title": "Bilingual Client Service Specialist- January 2026 1",
    "date_posted": "2025-12-19",
    "job_type": null,
    "max_amount": null,
    "min_amount": null,
    "job_url_direct": "https://jobs.scotiabank.com/Tangerine/job/Moncton-Bilingual-Client-Service-Specialist-January-2026-1-NB/598325217/?feedId=352460&utm_source=Indeed&utm_campaign=TheBankofNovaScotia_Indeed",
    "company_group": "Tangerine",
    "company_search_term": "Tangerine",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": "onsite",
    "employment_types": null,
    "location_city": "Moncton",
    "location_region": "NB",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:14.419971+00:00",
    "posted_days_ago": null,
    "dedupe_key": "8ea8d38d9151806e1c75cc7904f33c6878950c82"
  },
  {
    "description": "**Requisition ID**: 245413\n\n\nTangerine is Canada’s leading direct bank. We offer flexible and accessible banking options, innovative products, and award\\-winning Client service. The reason why Tangerine employees come to work each day is to help Canadians live better lives. We focus on making a difference in our communities, and that includes our own internal community. It’s important to us that our employees feel empowered and enthusiastic about belonging to our Orange culture.\n\n  \n\nAs Canada’s leading digital bank, Tangerine technology is at the heart of everything we do. We have redefined what digital banking is, and we continue to evolve to tackle any opportunity and face every challenge through progressive technology and the power of collaboration.\n\n  \n\nDo you like new challenges? Are you ready to reach new heights in your career and become part of an established disruptor? If so, come join us and help redefine the Canadian banking landscape!\n\n **What you will be doing:**\n\n  \n\nThe Senior Manager, Sales Operations \\& Enablement will play a critical role in driving the effectiveness and efficiency of our investment sales organization. This position is responsible for developing and executing strategies that optimize sales processes, tools, and reporting, while also leading sales enablement initiatives to equip our advisors and sales teams with the resources, training, and insights they need to succeed. The ideal candidate will combine strong analytical and operational expertise with a passion for empowering sales teams, ensuring alignment between business goals, technology, and client experience.\n\n **Is this role right for you? In this role, you will:**\n\n  \n\n* Deliver accurate and timely pipeline reporting and forecasting to provide visibility into sales performance and support strategic decision\\-making.\n* Oversee sales technology and tool adoption, including the integration and effective use of AI\\-driven solutions to enhance productivity and insights.\n* Collaborate on email campaign strategy, creation, and deployment to drive engagement and conversion across the sales funnel.\n* Lead workflow optimization and process improvement initiatives, identifying bottlenecks and implementing solutions to streamline operations.\n* Design and maintain sales dashboards and performance analytics that enable data\\-driven decisions and actionable insights.\n* Manage a sales enablement team responsible for training, onboarding, change management, and quality assurance, ensuring the sales organization is equipped for success.\n\n **Do you have the skills that will enable you to succeed in this role? We'd love to work with you if you have:**\n\n  \n\n* Bachelor’s degree\n* 5\\+ years of relevant experience in Sales Operations \\- implementation \\& execution\n* Demonstrated ability to create shared vision, inspire collaboration, and drive change with momentum.\n* Strong background in client research and analytics techniques, client strategy, process improvement, human\\-centered design, and performance management\n* Track record of analytical, data\\-driven, and client\\-centric decision\\-making skills.\n* Ability to translate business objectives and strategic investments into actionable plans that positively impact profit and performance.\n* Ability to thrive in a fast\\-paced and ambiguous environment, collaborating across functions and adapting to a rapidly changing organization.\n* Exceptional communication and relationship\\-building abilities across all levels of the organization, with the ability to collaborate effectively with cross\\-functional teams.\n* Critical thinker, problem solver\n* Results, KPI and accountability\\-oriented\n* Agile, persuasive, and resilient\n* Expert in querying database (SQL) and Microsoft Excel Expert\n\n **What's in it for you?**\n\n  \n\n* Work in a mission\\-driven culture that prioritizes empowerment, diversity, and continuous learning.\n* Join a modern banking environment where design plays a central role in shaping client value.\n* Be part of a high\\-visibility team that is reimagining the future of personal finance in Canada.\n* You will get our help to save for your future and to invest in your total wellbeing through our Tangerine benefits\\*.\n* You belong here, we are equal and un\\-complicated. Bring your true self to work, dress codes don’t apply here.\n* You will enjoy workspace flexibility and all the excitement that comes from working at the official Bank of the Toronto Raptors.\n\n* Tangerine employees participate in Scotiabank’s pension \\& benefits programs (available to permanent employees)\n\n  \n\nLocation(s): Canada : Ontario : Toronto\n\n\nAt Tangerine we value the unique skills and experiences each individual brings to the team, and are committed to creating and maintaining an inclusive and accessible environment. If you require accommodation during the recruitment and selection process, please let our Recruitment team know.",
    "id": "in-aedf549e58f900fa",
    "currency": null,
    "site": "indeed",
    "location": "Toronto, ON, CA",
    "company": "Tangerine",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=aedf549e58f900fa",
    "title": "Senior Manager, Sales Operations & Enablement - Tangerine",
    "date_posted": "2025-12-18",
    "job_type": null,
    "max_amount": null,
    "min_amount": null,
    "job_url_direct": "https://jobs.scotiabank.com/Tangerine/job/Toronto-Senior-Manager%2C-Sales-Operations-&-Enablement-Tangerine-ON-M5C2W1/598289017/?feedId=352460&utm_source=Indeed&utm_campaign=TheBankofNovaScotia_Indeed",
    "company_group": "Tangerine",
    "company_search_term": "Tangerine",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": null,
    "location_city": "Toronto",
    "location_region": "ON",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:14.423130+00:00",
    "posted_days_ago": null,
    "dedupe_key": "11ba0331f733356b33ff0145492e8accd7cbbad6"
  },
  {
    "description": "**Requisition ID**: 245048\n\n\nTangerine is Canada’s leading direct bank. We offer flexible and accessible banking options, innovative products, and award\\-winning Client service. The reason why Tangerine employees come to work each day is to help Canadians live better lives. We focus on making a difference in our communities, and that includes our own internal community. It’s important to us that our employees feel empowered and enthusiastic about belonging to our Orange culture.\n\n  \n\nDo you like new challenges? Are you ready to reach new heights in your career and become part of an established disruptor? If so, come join us and help redefine the Canadian banking landscape!\n\n  \n\n\n\n**What you will be doing:**\n\n\nContributes to the overall success of the Information Technology (IT) in Canada ensuring specific individual goals, plans, initiatives are executed / delivered in support of the team’s business strategies and objectives. Ensure all activities conducted are following governing regulations, internal policies and procedures.\n\n **Is this role right for you? In this role, you will:**\n\n\n* Champions a customer focused culture to deepen client relationships and leverage broader Bank relationships, systems and knowledge.\n* Defines vision, strategy and principles for data management at the Enterprise level.\n* Defines standards for naming, describing, governing, managing, modeling, cleansing, enriching, transforming, moving, storing, securing, searching and delivering data within the enterprise.\n* Ensures consistency across the board for internal and external datasets.\n* Creates logical and physical designs for data management capabilities (full lifecycle)\n* Evaluates data management platforms and solutions\n* Documents and defining data processes, eliminating activities that don't add value and straightening out the flow of the activities\n* Defines, socializes and implements Data Architecture (business intelligence reporting, predictive/reactive analytics, business rules, data warehouse, data\\-mart, data migration, ETL, backup and archival)\n* Reviews projects for impact and compliance\n* Identifies and maintains an up\\-to\\-date picture of opportunities and risks\n* Participate in research, development, testing and production support activities\n* Prepare and present recommendations to management team\n* Responsible for understanding and complying with the Regulatory Compliance Framework including the Anti\\-Money Laundering/Anti\\-Terrorist Financing and Sanctions Policy and all AML related policies, procedures and controls within the department\n **Do you have the skills that will enable you to succeed in this role? We'd love to work with you if you have**\n\n* University or College degree or equivalent experience\n* 5\\+ years of demonstrated experience in data management solution design and development\n* Possesses proven technical skills in\n\t+ OLTP and decision support information management\n\t+ DDL and DML in Oracle, SQL Server, BigQuery\n\t+ Python programming\n\t+ Data Warehouse solutions (SAS and PowerBI)\n\t+ ETL tools (Apache Airflow, Informatica)\n\t+ Cloud: GCP, Azure or AWS\n* Excellent data modelling, and data management skills\n* Strong analytical skills required in identifying problems, validatin gand making recommendations\n* Strong financial background with excellent documentation skills\n\n **What's in it for you?**\n\n* You will be part of a diverse and inclusive team of Client\\-focused go\\-getters looking to learn from each other in an environment that celebrates and recognizes success!\n* You will have access to thousands of online and in\\-person courses so you can shape your career growth with support from diverse industry leaders.\n* You will get our help to save for your future and to invest in your total well\\-being through our Tangerine benefits.\n* You belong here, and we are equal and uncomplicated. Bring your true self to work, dress codes don’t apply here.\n* You will enjoy workspace flexibility and all the excitement that comes from working at the official Bank of the Toronto Raptors.\n\n  \n\nLocation(s): Canada : Ontario : Toronto\n\n\nAt Tangerine we value the unique skills and experiences each individual brings to the team, and are committed to creating and maintaining an inclusive and accessible environment. If you require accommodation during the recruitment and selection process, please let our Recruitment team know.",
    "id": "in-2542b3d41925ae2b",
    "currency": null,
    "site": "indeed",
    "location": "Toronto, ON, CA",
    "company": "Tangerine",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=2542b3d41925ae2b",
    "title": "Data Architect - Tangerine",
    "date_posted": "2025-12-18",
    "job_type": null,
    "max_amount": null,
    "min_amount": null,
    "job_url_direct": "https://jobs.scotiabank.com/Tangerine/job/Toronto-Data-Architect-Tangerine-ON-M2H0A1/598277917/?feedId=352460&utm_source=Indeed&utm_campaign=TheBankofNovaScotia_Indeed",
    "company_group": "Tangerine",
    "company_search_term": "Tangerine",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": null,
    "location_city": "Toronto",
    "location_region": "ON",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:14.421469+00:00",
    "posted_days_ago": null,
    "dedupe_key": "c29144d778b59ef8d63412344d588836ca2061f6"
  },
  {
    "description": "**Requisition ID**: 245078\n\n\nTangerine is Canada’s leading direct bank. We offer flexible and accessible banking options, innovative products, and award\\-winning Client service. The reason why Tangerine employees come to work each day is to help Canadians live better lives. We focus on making a difference in our communities, and that includes our own internal community. It’s important to us that our employees feel empowered and enthusiastic about belonging to our Orange culture.\n\n  \n\nAs Canada’s leading digital bank, Tangerine technology is at the heart of everything we do. We have redefined what digital banking is, and we continue to evolve to tackle any opportunity and face every challenge through progressive technology and the power of collaboration.\n\n  \n\nDo you like new challenges? Are you ready to reach new heights in your career and become part of an established disruptor? If so, come join us and help redefine the Canadian banking landscape!\n\n **What you will be doing:**\n\n  \n\nContributes to the overall success of the Tangerine Marketing Department in Canada ensuring specific individual goals, plans, initiatives are executed / delivered in support of the team’s business strategies and objectives. Ensures all activities conducted are in compliance with governing regulations, internal policies and procedures.\n\n **Is this role right for you? In this role, you will:**\n\n  \n\n\nHelps drive CMO strategic priorities by tracking and advancing the success of our Marketing Vision and Plan; developing high\\-impact, high\\-visibility materials for senior leaders; and delivering on projects as assigned by CMO.  \n\n* \n\nChampions a customer\\-focused culture, ensuring customer and client needs are placed at the centre of marketing strategy work across the business. This could take 2 approaches:  \n* + High\\-touch support: supporting end\\-to\\-end development of customized marketing strategies for stakeholders:\n\t\t- Develops project plan, working group definition and project governance model.\n\t\t- Defines objectives, strategic deliverables, measurement, and implementation plans.\n\t\t- Gathers, analyzes and synthesizes consumer insights and other research inputs into actionable business\\-driving solutions.\n\t\t\n\t\tLeads project implementation including ideation sessions, workshops and programs planning aligned to project objectives and strategic deliverables (ensuring seamless hand\\-off if project is identified as an ongoing program).  \n\t\t-\n* + Low\\-touch support: provides advisory support by leveraging a pre\\-defined set of tools to address ad\\-hoc requests, or as part of working groups/steering committees for key initiatives:\n\t\t- Translation of high\\-touch key projects into \"project frameworks\" that can be applied by teams.\n\t\t- Development of strategic marketing tools that empower individual teams to make decisions (including guidance and flexibility to adapt execution based on local business realities).\n\n  \n\n\nDelivers on specific projects as assigned, leading the development and deployment of creative assets; acting as main point of contact for internal and external stakeholders; and monitoring spend in coordination with the broader team and partners for budget investment.  \n\n* \n\nFosters and maintains collaborative relationships with marketing and non\\-marketing stakeholders to support the achievement of deliverables and overall objectives.  \n* \n\nWorks effectively in grey space, putting structure around ambiguous tasks that have often not been completed before.  \n* \n\nChampions proper usage of the Tangerine brand, in full compliance with brand guidelines and Tangerine’s visual identity continuum.  \n* \n\nDemonstrates a commitment to Tangerine’s values: accountability, passion, integrity and respect. Delivers results in accordance to Tangerine behavioural competencies. Creates an inclusive team culture and an environment where team members hear, share, and appreciate diverse perspectives.  \n* \n\nDirects day\\-to\\-day activities in a manner consistent with the Bank’s risk culture and the relevant risk appetite statement and limits. Communicates and models the Bank’s risk culture and risk appetite statement throughout their teams.  \n* \n\nCreates an environment in which his/her team pursues effective and efficient operations of his/her respective areas, while ensuring the adequacy, adherence to and effectiveness of day\\-to\\-day business controls to meet obligations with respect to operational risk, regulatory compliance risk, AML/ATF risk and conduct risk, including but not limited to responsibilities under the Operational Risk Management Framework, Regulatory Compliance Risk Management Framework, AML/ATF Global Handbook and the Guidelines for Business Conduct.  \n* \n* Builds a high\\-performance environment and implements a people strategy that attracts, retains, develops and motivates their team by fostering an inclusive work environment and using a coaching mindset and behaviours; communicating vison/values/business strategy; and, managing succession and development planning for the team.\n\n **Do you have the skills that will enable you to succeed in this role? We'd love to work with you if you have:**\n\n  \n\n* 8 years of experience in a similar role working in a management consulting firm or as a strategist within an agency/marketing environment.\n* Demonstrated experience in the development of marketing strategies and go\\-to\\-market plans. Expertise within the Financial Services industry is a plus.\n* End\\-to\\-end project management.\n* Exceptional analytical skills. Highly proficient at processing large amounts of research and other information into relevant strategies that support the Bank’s business goals.\n* Natural storyteller. Highly proficient in using PowerPoint with strong communication skills and ability to write, design and deliver impactful presentations in relatable and convincing ways.\n* Ability to manage multiple projects and competing priorities simultaneously and effectively in a fast\\-paced, challenging, and dynamic business environment.\n* Highly developed relationship management skills. Capable to engage and work directly with senior marketing and business strategy leaders across the Bank – to gain their trust and fully understand their business.\n* Authentic, decisive, resilient, highly collaborative, and results oriented.\n* Self\\-starter who takes end\\-to\\-end ownership and responsibility.\n\n **What's in it for you?**\n\n  \n\n* Work in a mission\\-driven culture that prioritizes empowerment, diversity, and continuous learning.\n* Join a modern banking environment where design plays a central role in shaping client value.\n* Be part of a high\\-visibility team that is reimagining the future of personal finance in Canada.\n* You will get our help to save for your future and to invest in your total wellbeing through our Tangerine benefits\\*.\n* You belong here, we are equal and un\\-complicated. Bring your true self to work, dress codes don’t apply here.\n* You will enjoy workspace flexibility and all the excitement that comes from working at the official Bank of the Toronto Raptors.\n\n* Tangerine employees participate in Scotiabank’s pension \\& benefits programs (available to permanent employees)\n\n  \n\nLocation(s): Canada : Ontario : Toronto\n\n\nAt Tangerine we value the unique skills and experiences each individual brings to the team, and are committed to creating and maintaining an inclusive and accessible environment. If you require accommodation during the recruitment and selection process, please let our Recruitment team know.",
    "id": "in-209b73364d258a94",
    "currency": null,
    "site": "indeed",
    "location": "Toronto, ON, CA",
    "company": "Tangerine",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=209b73364d258a94",
    "title": "Senior Manager, Marketing - Tangerine",
    "date_posted": "2025-12-16",
    "job_type": null,
    "max_amount": null,
    "min_amount": null,
    "job_url_direct": "https://jobs.scotiabank.com/Tangerine/job/Toronto-Senior-Manager%2C-Marketing-Tangerine-ON-M5C2W1/598198117/?feedId=352460&utm_source=Indeed&utm_campaign=TheBankofNovaScotia_Indeed",
    "company_group": "Tangerine",
    "company_search_term": "Tangerine",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": null,
    "location_city": "Toronto",
    "location_region": "ON",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:14.425772+00:00",
    "posted_days_ago": null,
    "dedupe_key": "3e684b02090c9bcb5237169edb5b338566f54a38"
  },
  {
    "description": "**Requisition ID**: 244872\n\n\nTangerine is Canada’s leading direct bank. We offer flexible and accessible banking options, innovative products, and award\\-winning Client service. The reason why Tangerine employees come to work each day is to help Canadians live better lives. We focus on making a difference in our communities, and that includes our own internal community. It’s important to us that our employees feel empowered and enthusiastic about belonging to our Orange culture.\n\n  \n\nAs Canada’s leading digital bank, Tangerine technology is at the heart of everything we do. We have redefined what digital banking is, and we continue to evolve to tackle any opportunity and face every challenge through progressive technology and the power of collaboration.\n\n  \n\nDo you like new challenges? Are you ready to reach new heights in your career and become part of an established disruptor? If so, come join us and help redefine the Canadian banking landscape!\n\n **What you will be doing:**\n\n  \n\nThe Tangerine Advisor, Level 1 is responsible for delivering exceptional investment advice and servicing in the spirit of the Investments team mission to Coach, Educate and Enable Canadians to become better investors. The Tangerine Advisor, Level 1 will respond to Client inquiries via the inbound phone channel (Investments/Deposit) and E\\-services when needed. They will report directly to the Manager of Tangerine Investments.\n\n **Is this role right for you? In this role, you will:**\n\n  \n\n* Client Engagement Outbound/Inbound\n\t+ Assess Clients’ financial situations and fit for mutual funds using probing questions and exceptional communication skills, both verbal and written.\n\t+ Simplify and explain investment strategies using language and analogies that make investing concepts easier to understand.\n\t+ Coach Clients to adopt sound investor behaviors and habits that will position them to have long\\-term success with their investments \\& deposits\n\t+ Educate Clients on the fundamentals of our products with the intention of raising their overall investor IQ.\n\t+ Enable Clients to take control of their investments by providing them a tailored recommendation suited to their needs.\n\t+ Empower Clients to use online self\\-serve tools to assist with planning and goal setting\n\t+ Recommend other Tangerine products that are well suited to the Clients identified needs\n\t+ Assist Clients with trade requests and account maintenance needs and execute with high accuracy\n\t+ Meet monthly productivity, sales and quality targets for both phone and E\\-services channels when needed\n\t+ Other duties as assigned.\n* Deliver appropriate Investment Advice\n\t+ Review Know Your Client details, assess a client’s personal circumstances and make a recommendation based on client needs and objectives\n\t+ Understand products offered by Tangerine Investments, including the structure, features, risks and costs of the investments and the impact of those costs.\n\t+ Create customized action plans for clients to build appropriate Investment Goals.\n\t+ Provide additional research and context on Deposit, Mutual Fund and Exchange Traded Funds (ETF) products; educate and simplify the methodology used for clients.\n\t+ Use superior judgement to develop and recommend Investment Strategies for clients to achieve desired goals such as fee minimization and specific life\\-based goals.\n\t+ Understand and practice the boundaries and limitations of advice in the context of Tangerine Investment.\n* Risk Management and Compliance\n\t+ Demonstrate an in\\-depth understanding of client suitability \\& KYP.\n\t+ Adhere to all aspects of the Know Your Client standards, policies and procedures.\n\t+ Protect the Bank’s assets by adhering to all policies and procedures, legal and ethical requirements and regulations, and established risk guidelines. Ensure all business is in conformity with Bank Policies and other guidelines.\n\t+ Actively pursues effective and efficient operations of his/her respective areas in accordance with Scotiabank’s Values, its Code of Conduct and the Global Sales Principles, while ensuring the adequacy, adherence to and effectiveness of day\\-to\\-day business controls to meet obligations with respect to operational, compliance, AML/ATF/sanctions and conduct risk.\n* Contribute to the effectiveness of the Tangerine Investment Team\n\t+ Participate in ongoing professional development; keep up\\-to\\-date on financial services/market trends and new Bank initiatives in order to effectively perform in the role.\n\t+ Contribute to the overall efficiency and effectiveness of both the Tangerine Investment and your own individual investment team\n\t+ Work toward meeting productivity goals and targets.\n\t+ Identify areas and recommend solutions to the Management team to improve the overall customer service experience.\n\n **Do you have the skills that will enable you to succeed in this role? We'd love to work with you if you have:**  \n\n\n\n* Bilingualism in French and English is required\n* Minimum High School Diploma\n* Minimum 2\\-3 years of work experience preferably in retail/sales or customer service\n* Successful completion of CSC or IFIC\n* Ability to multi\\-task and work in a dynamic and changing environment\n* Ability to demonstrate excellent sales and customer service skills\n* Ability to demonstrate excellent written and reading comprehension skills\n\n **What's in it for you?**\n\n  \n\n* You will be part of a diverse and inclusive team of Client\\-focused go\\-getters looking to learn from each other in an environment that celebrates and recognizes success!\n* You will have access to thousands of online and in person courses so you can shape your career growth with the support from diverse industry leaders.\n* You will get our help to save for your future and to invest in your total wellbeing through our Tangerine benefits\\*.\n* You belong here, we are equal and un\\-complicated. Bring your true self to work, dress codes don’t apply here.\n* You will enjoy workspace flexibility and all the excitement that comes from working at the official Bank of the Toronto Raptors.\n\n* Tangerine employees participate in Scotiabank’s pension \\& benefits programs (available to permanent employees)\n\nLocation(s): Canada : Ontario : Toronto\n\n\nAt Tangerine we value the unique skills and experiences each individual brings to the team, and are committed to creating and maintaining an inclusive and accessible environment. If you require accommodation during the recruitment and selection process, please let our Recruitment team know.",
    "id": "in-ecbe95d680d48c68",
    "currency": null,
    "site": "indeed",
    "location": "Toronto, ON, CA",
    "company": "Tangerine",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=ecbe95d680d48c68",
    "title": "Tangerine Advisor - Tangerine",
    "date_posted": "2025-12-15",
    "job_type": null,
    "max_amount": null,
    "min_amount": null,
    "job_url_direct": "https://jobs.scotiabank.com/Tangerine/job/Toronto-Tangerine-Advisor-Tangerine-ON/598136417/?feedId=352460&utm_source=Indeed&utm_campaign=TheBankofNovaScotia_Indeed",
    "company_group": "Tangerine",
    "company_search_term": "Tangerine",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": null,
    "location_city": "Toronto",
    "location_region": "ON",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:14.428193+00:00",
    "posted_days_ago": null,
    "dedupe_key": "ff2291ad16f3d6c3b0eba2d1e371509bb5825241"
  },
  {
    "description": "**Requisition ID**: 228191\n\n\nTangerine is Canada’s leading direct bank. We offer flexible and accessible banking options, innovative products, and award\\-winning Client service. The reason why Tangerine employees come to work each day is to help Canadians live better lives. We focus on making a difference in our communities, and that includes our own internal community. It’s important to us that our employees feel empowered and enthusiastic about belonging to our Orange culture.\n\n  \n\nYou will be accountable to perform the required duties in support of the Bank’s scheduling tool Tidal Enterprise Scheduler. The responsibility of the Production Scheduling Analyst is overall Support, Operation, Maintenance, and Administration of the Enterprise job scheduling systems at Tangerine. These systems execute over 1500 jobs daily and are responsible for executing Production processes which are critical to the Operation of the Bank. This responsibility includes full support of the Tidal Enterprise Scheduling application including all Production and non\\-Production instances; including maintaining the application by installing patches and upgrades as required and resolving Production issues when necessary.\n\n  \n\nIn addition to these Operational responsibilities, the role also requires participation in Projects and enhancement initiatives to architect, develop, program, test, document, and Operationalize new Production job scripts and programs in AIX UNIX, Windows, and Tidal environments.\n\n  \n\nThis position also provides database and programming expertise to help support custom IT Operations tools and be involved in developing and producing Operational metrics reports. The incumbent will also provide support to the 24/7 IT Operations team and assist in creating and maintaining Operational procedures.\n\n **Is this role right for you?**  \n\n* You will support of the Bank’s scheduling tool Tidal Enterprise Scheduler. This includes expertise in developing scheduling networks and job definitions according to business line requests and providing guidance on best practices.\n* You will provide support for assigned applications systems, evaluate problems, and identify actions to be taken and recommend/implement solutions.\n* You play a critical role by testing new Tidal software releases to ensure successful implementation with no impact to the existing environments.\n* You ensure delivery of negotiated product/function, as per the bank’s standards and methodologies. This includes preparing deliverables for operational readiness and steady state support.\n* You will maintain the Enterprise Scheduling environments including Application patching and upgrades.\n* Your role supports Production incident management and troubleshooting for all Operational issues and events.\n* You will participate in projects to ensure that Operational impact is identified and planned for in the development lifecycle.\n* You will oversee and participate in the development and testing of all new Production scheduled jobs.\n* You will facilitate the translation of business requirements into IT Operations jobs\n* You will write, maintain, and troubleshoot custom programs for Tidal Scheduler jobs, including UNIX and Windows scripts.\n* You will set and enforce standards for the scheduling systems and environments based on industry best practices and internal policies and requirements.\n* You will provide documentation and training to other Operational teams for Job and automation processes.\n* Provide Weekend and After hour Support where required to troubleshoot issues or execute planned projects.\n* Other duties as requested by IT Management.\n* 2\\+ years of hands\\-on technical working experience with systems software on multiple platforms.\n* Demonstrated capability working with the Tidal Enterprise scheduling tool in a real\\-time Production environment.\n* 2\\+ years of hands\\-on experience with multiple batch automation or scheduling tools across multiple platforms.\n* Demonstrated ability to quickly learn \\& embrace new systems, tools and processes.\n* Knowledge of and experience with scripting in AIX and Windows platforms\n* Experience working with database tools\n* Programming and scripting experience on multiple platforms and languages\n* Proficient analytical and problem solving skills\n* Sound technical of knowledge and experience with AIX, Linux, Windows and Job Scheduling software\n* Experience working in a high\\-availability real\\-time Production IT environments\n* Understanding of FTP, SFTP and other industry standard data transfer protocols\n* Ability to work outside of business hours when projects and Production circumstances require\n **Do you have the skills that will enable you to succeed in this role?**  \n\n* 2\\+ years of hands\\-on technical working experience with systems software on multiple platforms.\n* Demonstrated capability working with the Tidal Enterprise scheduling tool in a real\\-time Production environment.\n* 2\\+ years of hands\\-on experience with multiple batch automation or scheduling tools across multiple platforms.\n* Demonstrated ability to quickly learn \\& embrace new systems, tools and processes.\n* Knowledge of and experience with scripting in AIX and Windows platforms\n* Experience working with database tools\n* Programming and scripting experience on multiple platforms and languages\n* Proficient analytical and problem solving skills\n* Sound technical of knowledge and experience with AIX, Linux, Windows and Job Scheduling software\n* Experience working in a high\\-availability real\\-time Production IT environments\n* Understanding of FTP, SFTP and other industry standard data transfer protocols\n* Ability to work outside of business hours when projects and Production circumstances require\n **What's in it for you?**  \n\n* Diversity, Equity, Inclusion \\& Allyship \\- We strive to create an inclusive culture where every employee is empowered to reach their fullest potential, respected for who they are, and are embraced through bias\\-free practices and inclusive values across Scotiabank. We embrace diversity and provide opportunities for all employee to learn, grow \\& participate through our various Employee Resource Groups (ERGs) that span across diverse gender identities, ethnicity, race, age, ability \\& veterans.\n* Accessibility and Workplace Accommodations \\- We value the unique skills and experiences each individual brings to the Bank, and are committed to creating and maintaining an inclusive and accessible environment for everyone. Scotiabank continues to locate, remove and prevent barriers so that we can build a diverse and inclusive environment while meeting accessibility requirements.\n* Upskilling through online courses, cross\\-functional development opportunities, and tuition assistance.\n* Competitive Rewards program including bonus, flexible vacation, personal, sick days and benefits will start on day one.\n* Community Engagement \\- no matter where you choose to work from; we offer opportunities for community engagement \\& belonging with our various programs such as hackathons, contests, cooking with friends, Humans of Digital and much more!\n\nLocation(s): Canada : Ontario : Toronto\n\n\nAt Tangerine we value the unique skills and experiences each individual brings to the team, and are committed to creating and maintaining an inclusive and accessible environment. If you require accommodation during the recruitment and selection process, please let our Recruitment team know.",
    "id": "in-11106c58e475b97b",
    "currency": null,
    "site": "indeed",
    "location": "Toronto, ON, CA",
    "company": "Tangerine",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=11106c58e475b97b",
    "title": "Production Scheduling Analyst, Tangerine",
    "date_posted": "2025-12-14",
    "job_type": null,
    "max_amount": null,
    "min_amount": null,
    "job_url_direct": "https://jobs.scotiabank.com/Tangerine/job/Toronto-Production-Scheduling-Analyst%2C-Tangerine-ON-M2H0A1/593255017/?feedId=352460&utm_source=Indeed&utm_campaign=TheBankofNovaScotia_Indeed",
    "company_group": "Tangerine",
    "company_search_term": "Tangerine",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": null,
    "location_city": "Toronto",
    "location_region": "ON",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:14.433039+00:00",
    "posted_days_ago": null,
    "dedupe_key": "718828dca95613c12a0b44f4fb1f9534c2da3c31"
  },
  {
    "description": "**Requisition ID**: 242050\n\n\nTangerine is Canada’s leading direct bank. We offer flexible and accessible banking options, innovative products, and award\\-winning Client service. The reason why Tangerine employees come to work each day is to help Canadians live better lives. We focus on making a difference in our communities, and that includes our own internal community. It’s important to us that our employees feel empowered and enthusiastic about belonging to our Orange culture.\n\n  \n\nThe Information Technology (IT) department manages Tangerine’s technology and computer infrastructure, supporting business systems across Core Banking Server Systems, VMware Infrastructure, Contact Center VDI Management, End\\-User Technical Support, Mobile Management, Network Management, Voice and Data Communications, Business and Web Applications, and Strategic Technical Planning.\n\n  \n\nThe Manager, Technical Services, Applications leads the Technical Services, Applications team in delivering reliable, secure, and optimized enterprise applications and server environments. This role requires deep expertise in administering corporate O365 environments. The manager combines solid technical knowledge, strong analytical skills, and hands\\-on experience in the administration and support of Windows Server OS, MS licensing, vulnerability patch management for operating systems and applications, and core banking infrastructure applications.\n\n  \n\nKey responsibilities include overseeing Microsoft O365, Teams, Exchange, OneDrive, SharePoint, Intune, Autopilot, and Entra ID, while maintaining a highly secure, reliable, and optimized operating environment. The role integrates technical expertise, strategic planning, and people leadership to ensure IT services meet business requirements and support Tangerine’s growth.\n\n\nThis position follows a hybrid work model but requires onsite 4 days per week at our office location.\n\n **Is this role right for you?**\n\n\nLeadership \\& Team Development\n\n* Lead, coach, and develop the Applications team, fostering a culture of collaboration, continuous improvement, and high performance.\n* Provide guidance and mentorship to team members and analysts in daily operations, troubleshooting, and project delivery.\n* Set clear goals, conduct performance reviews, and support professional growth.\n\n  \n\nTechnical Operations \\& Service Delivery\n\n* Oversee Lead and manage a team of 6–8 Level 3 engineers responsible for supporting Windows servers and associated infrastructure applications.\n* Collaborate with the team to deliver solutions for day\\-to\\-day business requirements within the scope of supported applications.\n* Oversee the implementation, administration, and support of Tangerine’s Windows Server OS environment and related applications, including O365, Exchange, Teams, SharePoint, SCCM, SCOM, CyberArk, Trellix Endpoint Suite, VMware, Intune, Autopilot, and Entra ID.\n* Ensure the availability, reliability, scalability, and security of all Windows servers and storage, including application, file, print, and BCP servers.\n* Lead annual Disaster Recovery planning, testing, and maintain DR readiness.\n* Manage software currency and maintain the applications portfolio under Technical Services – Applications team.\n* Oversee Incident, Request, and Change Management processes for the Applications team.\n* Drive evaluation, selection, and deployment of operating systems and infrastructure technologies.\n* Manage vulnerability assessments, patching, and compliance for server applications.\n* Provide guidance and oversight for audits related to supported applications.\n* Monitor and manage alerts and notifications from all supported applications.\n* Review and approve requests and changes logged by the team; participate in CAB meetings.\n* Set goals for direct reports and conduct quarterly and annual performance reviews.\n* Coordinate 24x7 support for critical systems and applications as required.\n\n  \n\nStrategic Planning \\& Project Management\n\n* Develop and implement IT policies, procedures, and best practices to drive operational excellence.\n* Plan and execute technical projects, including migrations, integrations, and capacity expansions.\n* Collaborate with cross\\-functional teams to align technology initiatives with business goals.\n\n  \n\nStakeholder Engagement \\& Communication\n\n* Serve as the primary escalation point for complex technical issues, ensuring prompt resolution and clear communication.\n* Build strong relationships with internal business partners, vendors, and external stakeholders.\n* Effectively communicate technical information to both technical and non\\-technical audiences.\n\n  \n\nRisk, Compliance \\& Documentation\n\n* Ensure compliance with IT security standards, risk management, and regulatory requirements.\n* Maintain accurate documentation of systems, procedures, and incident resolutions.\n* Support disaster recovery and business continuity planning.\n\n  \n\nContinuous Improvement\n\n* Drive process improvements and innovation within the team.\n* Stay current with emerging technologies and industry trends, recommending enhancements as appropriate.\n\n **Do you have the skills that will enable you to succeed in this role?**\n\n\nEducation \\& Experience\n\n* University or College Degree in Computer Science, Engineering, or related field.\n* Minimum of 7 years of progressive experience in technical services, systems administration, or IT operations, including management roles within medium to large enterprise environments. Experience in financial or regulated industries is considered an asset.\n* 2\\+ years of leadership experience with demonstrated success in implementing continuous improvement and strategic initiatives.\n\n  \n\nTechnical Skills\n\n* Deep working knowledge of Windows Server OS, Active Directory, O365 administration, SCCM, SCOM, Exchange, Teams, SharePoint, VMware, CyberArk, Trellix and endpoint security solutions.\n* Experience with PowerShell scripting and automation.\n* Strong troubleshooting and analytical skills.\n\n  \n\nLeadership \\& Communication\n\n* Proven ability to lead technical teams and manage multiple projects.\n* Excellent verbal and written communication skills, including presentation abilities.\n* Strong interpersonal skills and stakeholder management.\n\n  \n\nAttributes\n\n* Logical thinker, detail\\-oriented, and proactive problem solver.\n* Results\\-driven, able to prioritize and manage competing demands.\n* Commitment to continuous learning and professional development.\n* Willingness to dive in and take charge, identifying and tackling key issues.\n\n  \n\nWorking Conditions\n\n* Hybrid work model (remote and onsite 4 days per week is required).\n* May require evening, weekend, or on\\-call work to support critical systems.\n* Occasional travel may be required.\n\n **What's in it for you?**\n\n* Diversity, Equity, Inclusion \\& Allyship \\- We strive to create an inclusive culture where every employee is empowered to reach their fullest potential, respected for who they are, and are embraced through bias\\-free practices and inclusive values across Scotiabank. We embrace diversity and provide opportunities for all employee to learn, grow \\& participate through our various Employee Resource Groups (ERGs) that span across diverse gender identities, ethnicity, race, age, ability \\& veterans.\n* Accessibility and Workplace Accommodations \\- We value the unique skills and experiences each individual brings to the Bank, and are committed to creating and maintaining an inclusive and accessible environment for everyone. Scotiabank continues to locate, remove and prevent barriers so that we can build a diverse and inclusive environment while meeting accessibility requirements.\n* Upskilling through online courses, cross\\-functional development opportunities, and tuition assistance.\n* Competitive Rewards program including bonus, flexible vacation, personal, sick days and benefits will start on day one.\n* Community Engagement \\- no matter where you choose to work from; we offer opportunities for community engagement \\& belonging with our various programs such as hackathons, contests, cooking with friends, Humans of Digital and much more!\n\n\nLocation(s): Canada : Ontario : Toronto\n\n\nAt Tangerine we value the unique skills and experiences each individual brings to the team, and are committed to creating and maintaining an inclusive and accessible environment. If you require accommodation during the recruitment and selection process, please let our Recruitment team know.",
    "id": "in-db3ba8187d8da3f4",
    "currency": null,
    "site": "indeed",
    "location": "Toronto, ON, CA",
    "company": "Tangerine",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=db3ba8187d8da3f4",
    "title": "Manager, Technical Support and Services, Applications",
    "date_posted": "2025-12-14",
    "job_type": null,
    "max_amount": null,
    "min_amount": null,
    "job_url_direct": "https://jobs.scotiabank.com/Tangerine/job/Toronto-Manager%2C-Technical-Support-and-Services%2C-Applications-ON-M2H0A1/597382417/?feedId=352460&utm_source=Indeed&utm_campaign=TheBankofNovaScotia_Indeed",
    "company_group": "Tangerine",
    "company_search_term": "Tangerine",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": "hybrid",
    "employment_types": null,
    "location_city": "Toronto",
    "location_region": "ON",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:14.430636+00:00",
    "posted_days_ago": null,
    "dedupe_key": "5dfc33a994989fd5586c9246cbff4ab312f73d00"
  },
  {
    "description": "**Requisition ID**: 241943\n\n\nTangerine is Canada’s leading direct bank. We offer flexible and accessible banking options, innovative products, and award\\-winning Client service. The reason why Tangerine employees come to work each day is to help Canadians live better lives. We focus on making a difference in our communities, and that includes our own internal community. It’s important to us that our employees feel empowered and enthusiastic about belonging to our Orange culture.\n\n  \n\nAs Canada’s leading digital bank, Tangerine technology is at the heart of everything we do. We have redefined what digital banking is and we continue to evolve on what it can be, using technology to create innovative, forward thinking banking solutions with our clients’ needs in mind. We are made up of high performing, curious, energetic and collaborative individuals who thrive in our high trust agile environment to deliver best in class solutions for our customers. We believe in giving people hands\\-on challenges and the responsibilities that come with them, allowing them to grow, evolve and create opportunities to build their career.\n\n\nAre you ready to make the change and become part of an established disruptor with the backing of a highly engaged team? If so come join us and help redefine the Canadian banking landscape!\n\n  \n\nWe are looking for a **SRE \\& Production Support** join our Tangerine’s Production Support and SRE team.\n\n **Is this role right for you? In this role you will:**\n\n  \n\n* Manages the team workflow to maximize business and technical efficiencies. Develop and guide the team members in enhancing their technical capabilities and increasing productivity\n* Supervises IT Support team; assigns and prioritizes production incidents, and problems, trains and coaches IT Support teams on ways to improve customer support; develop staff skills\n* Ensures all production issues are resolved within SLAs, and user requests are completed satisfactorily and that all customer requests are responded to in a timely manner.\n* You’ll be responsible for providing investigation and second level support on client issues, technical issues, system/web site outages and questions from all internal and external application by maintaining, prioritization and addressing to respective Tangerine technology groups and vendors.\n* You will run the production environment by monitoring availability and taking a holistic view of system health.\n* You will improve our suite of software solutions' reliability, quality, and time\\-to\\-market.\n* Measure and optimize system performance to push our capabilities forward, get ahead of customer needs, and innovate to improve continually\n* You’ll be responsible for maintaining the production applications and day\\-to\\-day operational activities, manage escalations and modify established procedures / approaches to suit specific situations including 24 x 7 support and coordination of recovery efforts\n* Participate in defining SLIs, SLOs and SLAs for Enterprise Systems\n* Gather and analyze metrics from both applications and infrastructure to assist in performance tuning and fault finding\n* Partner with development teams to address outstanding tickets and implement permanent fixes\n* Create sustainable systems and services through automation and process improvements.\n* Balance feature development speed and reliability with well\\-defined service level objectives.\n* Monitor multiple application health and discover opportunities to optimize in a continuously growing large complex hybrid environment.\n* Lead on\\-call problem escalation and outage recovery effort, not limited to code fixes in presentation and integration layer, but also provide infrastructure level investigation and support where necessary.\n* Lead post\\-incident technical retrospect to discover and implement remediation actions.\n* You will perform troubleshooting, deploy systems or execute maintenance tasks as necessary to meet the specified SLOs.\n **Do you have the skills that will enable you to succeed in this role? We'd love to work with you if you have:**\n\n  \n\n* 2\\-4 years of experience in developing and/or supporting complex, large\\-scale customer\\-facing platforms.\n* Good understanding of multi\\-tier applications, microservices (Docker, Kubernetes etc.)\n* Experience instrumenting and monitoring cloud hosted software stacks (preferably GCP, Vertex AI, GCE, Network, BigQuery, Cloud SQL)\n* Good understanding of networking concepts: TCP/IP, DNS, HTTP, TLS, OSI Model.\n* Familiarity with Tech Stack is Java/J2EE/SpringBoot/Python/JS NodeJs: FrontEnd IOS, Android native Apps; Deploymnet Runtime: K8s, WebSphere, WebSphere Liberty, NdeJS/TS.\n* Basic knowledge of one or more scripting languages (Ansible, Terraform, Bash etc.).\n* Strong working experience with incident management and setting up monitoring alerts.\n* Have a proficient understanding of code versioning tools, such as Git/Bitbucket.\n* Knowledge about building a highly automated production monitoring and support model, hands\\-on experience integrating Splunk, Ansible, Dynatrace, Sumologic, Service now ,PagerDuty.com, or equivalents.\n* Proven ability to translate ideas into technical and business realities and map technology to business problems.\n* Experience with private/public cloud services and platforms.\n* Superior verbal and written communication skills with the ability to influence decision\\-making with stakeholders.\n* A proactive approach to spotting problems, areas for improvement, and performance bottlenecks.\n* Exceptional written and verbal communication skills\n* Excellent problem\\-solving skills\n* Flexible approach to work and the ability to adapt to change\n* Prior production support or SRE experience.\n* Proficient with MS suite\n* Nice to have: Experience in building public and internal REST APIs.\n* Nice to have: Experience with CI/CD tools such as Jenkins.\n* Nice to have: Experience working with database technology such as SQL server, Oracle.\n* Nice to have: Experience with the Atlassian tools (JIRA, Confluence).\n\n **What's in it for you?**\n\n  \n\n* You will be part of a diverse and inclusive team of Client\\-focused go\\-getters looking to learn from each other in an environment that celebrates and recognizes success!\n* You will have access to thousands of online and in person courses so you can shape your career growth with the support from diverse industry leaders.\n* You will get our help to save for your future and to invest in your total wellbeing through our Tangerine benefits\\*.\n* You belong here, we are equal and un\\-complicated. Bring your true self to work, dress codes don’t apply here.\n* You will enjoy workspace flexibility and all the excitement that comes from working at the official Bank of the Toronto Raptors.\n\n* Tangerine employees participate in Scotiabank’s pension \\& benefits programs (available to permanent employees)\n\nLocation(s): Canada : Ontario : Toronto\n\n\nAt Tangerine we value the unique skills and experiences each individual brings to the team, and are committed to creating and maintaining an inclusive and accessible environment. If you require accommodation during the recruitment and selection process, please let our Recruitment team know.",
    "id": "in-75b0fbe28b9ddbe7",
    "currency": null,
    "site": "indeed",
    "location": "Toronto, ON, CA",
    "company": "Tangerine",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=75b0fbe28b9ddbe7",
    "title": "Site Reliability Engineer (SRE)",
    "date_posted": "2025-12-13",
    "job_type": null,
    "max_amount": null,
    "min_amount": null,
    "job_url_direct": "https://jobs.scotiabank.com/Tangerine/job/Toronto-Site-Reliability-Engineer-%28SRE%29-ON-M2H0A1/597349017/?feedId=352460&utm_source=Indeed&utm_campaign=TheBankofNovaScotia_Indeed",
    "company_group": "Tangerine",
    "company_search_term": "Tangerine",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": "hybrid",
    "employment_types": null,
    "location_city": "Toronto",
    "location_region": "ON",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:14.435000+00:00",
    "posted_days_ago": null,
    "dedupe_key": "fe8ff44ff51565305b057e4f4c3912f65a12bd95"
  },
  {
    "description": "**Requisition ID**: 235995\n\n\nTangerine is Canada’s leading direct bank. We offer flexible and accessible banking options, innovative products, and award\\-winning Client service. The reason why Tangerine employees come to work each day is to help Canadians live better lives. We focus on making a difference in our communities, and that includes our own internal community. It’s important to us that our employees feel empowered and enthusiastic about belonging to our Orange culture.\n\n  \n\nDo you like new challenges? Are you ready to reach new heights in your career and become part of an established disruptor? If so, come join us and help redefine the Canadian banking landscape!\n\n **What you will be doing:**\n\n\nSenior Performance Engineer provides support to the Performance Engineering Lead and is responsible for the execution of Performance Engineering activities within IT feature delivery. Responsibilities include working with delivery teams in the development of testing strategy, design, execution, defect management and analysis relating to performance testing tasks as well as working with members of the PE team in coaching, process improvement of internal policies and procedures. The Senior Performance Engineer will report directly to Manager or Senior Manager, Quality Engineering.\n\n **Is this role right for you? In this role, you will:**\n\n* Act as point of contact for Performance testing across delivery team and other areas of IT as required in evaluating intake requests and defining initial testing scope as pertaining to Performance across all channels\n* Directly support and execute day\\-to\\-day performance testing activities within test region and production, working with delivery teams and other areas of IT (enterprise architects, solutions architects, development) to validate performance testing and non\\-functional requirements\n* Utilize a variety of testing techniques which support the performance and non\\-functional testing activities, single user profiling, spike, stress, endurance, fail over\n* Assess the risks associated with the development aspects of each solution/project and define a performance testing approach and strategy\n* Analyzes, recommends and implements engineering suggestions to improve efficiencies and increase responsiveness of client project requirements, ensure technology is current and up to date with industry standards while maintaining established service levels\n* Coach and provide mentorship to the large Quality Engineering team in areas including performance testing strategy, test automation and non\\-functional testing approaches, as well as business domain, while ensuring the PE team is compliant with Tangerine test methodologies and industry best practices\n* Manage and execute testing activities across multiple large scale enterprise\\-wide programs/projects for Tangerine that are executed in Waterfall or Agile methodology\n* Risk Management – document testing risks and provide mitigation and contingency plans from testing standpoint.\n* Develop and maintain continuous performance testing within CICD pipelines and support /maintain performance tests and metrics gathering to ensure system stability and trending analysis\n* Collect strategic, technical and operational test metrics across testing and production environments. Analyze current defects and test execution trends and extrapolate data for predictive analysis\n* Ensure all test assets, execution results/analysis, sign off and closure reports are captured within JIRA\n* Drive the creation, support and on\\-going maintenance of the Tangerine Performance Engineering knowledge repository, tools, and testing strategy and processes.\n* Responsible for consolidated test dashboards outlining key metrics and performance KPI’s for Senior Management.\n* Work PE team lead and QE management in support of discussion and discovery with vendors related to testing methodologies, tooling, resources, POCs, etc.\n\n **Do you have the skills that will enable you to succeed in this role? We'd love to work with you if you have:**\n\n* + University or College Degree or equivalent experience in Computer Science/Engineering\n\t+ 6\\+ years of experience working within SDLC/TDLC\n\t+ 5\\+ years of testing experience specifically within the Performance testing discipline\n\t+ Proficient testing background in the Canadian financial services industry\n\t+ Solid understanding of Performance test process methodologies, approaches and tools\n\t+ Extensive experience test planning and management tooling\n\t+ Ability to understand enterprise scale infrastructures and emerging technologies such as DataPower, Microservices, Mobile Native Apps, Akamai services, middleware technologies, Various DB services, complex networks\n\t+ Experience working with cloud technologies such as GCP, AWS, Anthos\n\t+ Solid understand of web and mobile applications and related implementations\n\t+ Must have Unix/Linux Intermediate experience\n\t+ Must be strong in one of the coding languages: Java, JavaScript, python etc.\n\t+ Knowledge of web services and implementing APIs\n\t+ Sound knowledge about SQL / PL\\-SQL, stored procedures and SQL Server database\n\t+ Solid understanding of hardware utilization and related Garbage Collection and memory footprints\n\t+ Expertise in metrics gathering and developing dashboards and reports which clearly and concisely capture and communicate performance testing analysis / results\n\t+ Demonstrated competency with various tools including Defect Management Tools, Requirement Management Tools, Test Management and Planning Tools, Web Content Management tools and concepts, Banking systems and their integration\n\t+ Extensive experience with Performance testing and automation tools such as JMeter, LoadRunner, Cloud test, Selenium, Appium or similar\n\t+ Hands on experience with Performance engineering and monitoring tools such as Sumo Logic, Dynatrace, Crashlytics etc.\n\t+ Hands on experience within API REST/SOAP testing and experience using related tools, Postman, Rest Assured etc.\n\t+ Experience with CI/CD and related tools and techniques; Jenkins/Dockers/Kubernetes an asset\n\t+ CTFL, ISTQB, CSQA, CSTE good to have\n\t+ Development background an asset\n\n **What's in it for you?**\n\n* You will be part of a diverse and inclusive team of Client\\-focused go\\-getters looking to learn from each other in an environment that celebrates and recognizes success!\n* You will have access to thousands of online and in\\-person courses so you can shape your career growth with support from diverse industry leaders.\n* You will get our help to save for your future and to invest in your total well\\-being through our Tangerine benefits.\n* You belong here, and we are equal and uncomplicated. Bring your true self to work, dress codes don’t apply here.\n* You will enjoy workspace flexibility and all the excitement that comes from working at the official Bank of the Toronto Raptors.\n\n **\\#BFUTR**\n\n\nLocation(s): Canada : Ontario : Toronto\n\n\nAt Tangerine we value the unique skills and experiences each individual brings to the team, and are committed to creating and maintaining an inclusive and accessible environment. If you require accommodation during the recruitment and selection process, please let our Recruitment team know.",
    "id": "in-e511bdb6529bd789",
    "currency": null,
    "site": "indeed",
    "location": "Toronto, ON, CA",
    "company": "Tangerine",
    "interval": null,
    "is_remote": false,
    "job_url": "https://ca.indeed.com/viewjob?jk=e511bdb6529bd789",
    "title": "Senior Performance Engineer - Tangerine",
    "date_posted": "2025-12-11",
    "job_type": null,
    "max_amount": null,
    "min_amount": null,
    "job_url_direct": "https://jobs.scotiabank.com/Tangerine/job/Toronto-Senior-Performance-Engineer-Tangerine-ON-M2H0A1/595729617/?feedId=352460&utm_source=Indeed&utm_campaign=TheBankofNovaScotia_Indeed",
    "company_group": "Tangerine",
    "company_search_term": "Tangerine",
    "search_country_indeed": "Canada",
    "search_location": "Canada",
    "work_arrangement": null,
    "employment_types": null,
    "location_city": "Toronto",
    "location_region": "ON",
    "location_country_hint": "CA",
    "scraped_at": "2026-01-09T22:15:14.437421+00:00",
    "posted_days_ago": null,
    "dedupe_key": "c4366b7b501ec762500a09f52d7f8312fcdb0f92"
  }
]